{"vocab": ["<PAD>", "<UNK>", "O-O", "{", "[%eval", "}", "Nf3", "e4", "d4", "Nf6", "d5", "e5", "Nc3", "Nc6", "e6", "c5", "d6", "c4", "Be7", "c6", "c3", "a6", "g6", "exd5", "Bd3", "d3", "h3", "Bc4", "h6", "e3", "Bg5", "f4", "Be3", "cxd4", "b5", "Be2", "a3", "Bg4", "Bg7", "Ne5", "Nxd4", "Nxe5", "f5", "O-O-O", "dxe5", "b4", "b6", "Bd6", "g3", "Ne4", "Bd7", "Nxe4", "Bb7", "cxd5", "Nd5", "b3", "Nd7", "Be6", "Bf4", "exd4", "Nxd5", "f6", "Re1", "Qe2", "Bc5", "Bxf6", "Bd2", "a4", "g4", "Qc7", "Bxf3", "1...", "2...", "3...", "4...", "f3", "a5", "Nd4", "dxe4", "Bg2", "Nd2", "Bf5", "g5", "Qd2", "Qe7", "Ne7", "Bb5", "h4", "h5", "Nbd7", "Re8", "Bb2", "Bb4", "Qf3", "Qc2", "Ne2", "Qd7", "Ng5", "Nbd2", "Qb6", "Qxd5", "Qf6", "Ng4", "Qxd4", "bxc6", "dxc4", "Bxe5", "Bb3", "bxc3", "Nf5", "fxe5", "Bxc6", "Qd3", "Qb3", "Bxe4", "Rc8", "Bxc3", "Bxd5", "Nc5", "dxc5", "Nc4", "Rb8", "Bxc4", "Nxc6", "Qxf3", "Nb5", "Rc1", "Ng6", "Rad1", "Kh1", "Qd6", "Bxd4", "Nf4", "Nb6", "Nh5", "Qh5", "Nb4", "Qa5", "Bh4", "Ng3", "Bg3", "Rb1", "Kh8", "Nxc3", "Qxf6", "Bf6", "Bg6", "exf5", "Bh5", "Bb5+", "fxe4", "Na5", "exf4", "Bxc5", "Nh4", "Bh6", "Qg4", "Qd8", "Rad8", "Bb6", "Ba6", "Qg3", "Qh4", "Bxf4", "Nb3", "fxe6", "gxf6", "Nh6", "Qe3", "exf6", "Ke7", "gxf3", "Bxf5", "Bf3", "Bb4+", "Rd8", "Bxe7", "Rd1", "Bxd6", "Bxe6", "Qg5", "axb5", "Qxd6", "Qxd3", "Na4", "Nge7", "Na6", "Rfe1", "Qg6", "Bc2", "Qxe5", "Na3", "Qd1", "Kf8", "dxc6", "Qa4", "Bxg5", "Nxc4", "Bc6", "Bxd3", "Qxe4", "Nge2", "Kd7", "Rg8", "Rac1", "Nxf6+", "axb4", "Bxc3+", "Qxe7", "Rfe8", "exd6", "bxc4", "Nxd7", "Ba4", "Nxf6", "Be4", "Ke2", "Nxf3+", "Rac8", "Qd5", "Nh3", "Bd5", "bxc5", "hxg6", "Bxe2", "Ba3", "Kf1", "Bh3", "Bd4", "Qe6", "0.18]", "Bxc6+", "dxc3", "hxg5", "Be5", "0.17]", "Ne3", "Qf4", "Bxh6", "fxe3", "Kb1", "Rf8", "0.2]", "Bc3", "0.22]", "Bxg4", "Qd4", "Bxe3", "Bxg7", "Qc6", "Kd8", "Nxe3", "0.25]", "Rg1", "Nxc5", "hxg4", "Rae1", "Ne6", "Qxd7", "0.15]", "Rfd1", "Qxb2", "Kb8", "Qf5", "0.24]", "Qe1", "Qe8", "Nxg5", "cxb5", "Kxf7", "Qh5+", "Bxd7+", "0.27]", "Nxe6", "Qxg5", "Kf7", "Nxf3", "Bxb5", "Qxc3", "Qa5+", "Qxb7", "Rfd8", "Nd6", "Ngf6", "Qc8", "Qxe2", "Kd2", "cxd6", "Rae8", "Qc3", "Rf1", "Qe4", "Nxg4", "Qxc4", "Rxd8", "Nh2", "dxe6", "0.29]", "Qb4", "Nxd2", "Bxf7+", "fxg6", "Kg7", "Nxf7", "Ba5", "Qa4+", "0.13]", "Bxh3", "Nxf4", "Nd3", "Qxg4", "Kg8", "Bxb4", "Rxd1", "gxf5", "exf3", "Qe5", "Nxf5", "cxd3", "Qxc6", "Kf2", "Qh3", "Nxb5", "Bc7", "Qc5", "Rab1", "cxb4", "Qxd2", "hxg3", "Qxc5", "Nc7", "Ba2", "Kd1", "Nxd3", "Ke8", "Kxg7", "axb3", "Qb5", "0.12]", "Nh7", "0.19]", "0.16]", "0.21]", "Nfd7", "Qc4", "0.31]", "Bxb2", "Qc1", "Qh6", "0.23]", "Qf2", "Qxd8+", "Rab8", "Qh4+", "Bxg2", "axb6", "Kh7", "0.26]", "Nxg6", "Kg2", "Ne8", "0.32]", "Bxb7", "Ngf3", "Bxd2+", "Qxf4", "Bxa6", "0.14]", "Bf8", "Kxd8", "0.28]", "Qf7", "0.0]", "Nxd6", "Nc2", "Kh2", "Nxe7", "Nxb4", "Rxe5", "gxf4", "Bc8", "Qxd1+", "Bxd7", "Qxe3", "gxh6", "Kg1", "Rf7", "Kc7", "Rd7", "Rd2", "0.1]", "fxg3", "0.3]", "0.34]", "Rf2", "fxg5", "Bxg6", "Nf7", "Bf2", "Nb8", "Qxf5", "Nxg3", "Nf8", "Rxe4", "Qxe5+", "Qxe6", "Nf1", "Nbc6", "Qb7", "Bxd2", "Bxf2+", "Re2", "Nxb3", "Kxf2", "Kxd1", "Qxc2", "0.08]", "Rxf6", "Bxf8", "Bxa8", "Qxe4+", "0.36]", "Rxf3", "gxh3", "Bxa1", "Nxf2", "Rf3", "Qxa8", "Qxg7", "Bf1", "Bxa3", "0.11]", "Qa3", "Qxd8", "Qxc7", "Nxe2", "Rhe1", "Rxf7", "Qxb4", "Bxg3", "Bxf1", "Qxd1", "Bc1", "Qb8", "Ng8", "exd3", "fxg4", "Nd6+", "Re7", "Qxb5", "Qa6", "Bxd8", "Ke1", "Nxa8", "Ne1", "dxe3", "Kxg2", "Nce7", "Qg7", "Re1+", "0.33]", "cxb3", "Nxe7+", "Kc2", "Re3", "Bc5+", "Qxa1", "0.37]", "0.05]", "Rfc8", "Rxd5", "Bxd1", "Nb1", "Rxd4", "Qxa2", "Bh2", "Qb2", "Qxh5", "Nbc3", "Qxh6", "Qe6+", "Qxh4", "0.06]", "Bb1", "Nce2", "Qxa7", "Qxg2", "0.35]", "gxh5", "Rxa1", "Qb5+", "Ba7", "Rfc1", "Nf2", "Nxb6", "Nfd2", "Nxd3+", "Bxc7", "Bxc2", "cxb6", "Qe5+", "Nxh4", "0.39]", "Rhe8", "Qxb6", "Rxa8", "0.03]", "Nxa1", "Rxf4", "Kc8", "Ra7", "0.07]", "Bf7", "Ra8", "Qe2+", "Rxe8", "Rc7", "Rxd6", "Rxf5", "Nxh5", "Qb4+", "Qxb3", "Rxf2", "Bxh4", "Nxd6+", "Ndf3", "0.09]", "Rxc1", "Qg2", "Bxb6", "Rf6", "0.01]", "Kxd7", "0.41]", "Rxe7", "Qb1", "Rxb2", "bxa6", "Nxc2", "Nxh8", "Qxh3", "Rd3", "Qxe6+", "Rxc8", "Re6", "Qb6+", "bxa3", "Rc2", "bxa5", "Bxb3", "Nxe2+", "bxa4", "Nf6+", "Ndf6", "Rxe3", "Rxe1", "Re8+", "Nxd8", "Rxd7", "Rxe6", "Rxd3", "Qxe2+", "Rxb7", "Nxf8", "Bxh7+", "Qg4+", "Nxd1", "Bxh5", "Qg5+", "-0.03]", "Qe4+", "Qe7+", "Ra2", "Ra1", "Rh8", "0.43]", "Nxc7+", "0.38]", "Rh3", "Rxd1+", "Qxe7+", "Qf8", "Rg3", "Bh7", "Rd6", "0.44]", "Qxf7", "-0.01]", "Rxe1+", "Qxf7+", "Rxd2", "0.46]", "Bc4+", "gxh4", "Rxf8", "Bxh8", "Rxd8+", "-0.05]", "0.48]", "Be8", "Nxc2+", "Rxe8+", "Nxc7", "Ng1", "Qxh8", "0.53]", "Kxe7", "Rhg8", "Bd8", "Bg5+", "Nd3+", "Rxc3", "Nd1", "Qxe3+", "0.5]", "Nc7+", "Qxh7", "Qxc3+", "Ke6", "0.51]", "Bxf7", "Bxa7", "Rxf1", "Ng5+", "Rg6", "Nf3+", "Qxa5", "Kxd2", "Qxg6", "Nd8", "Qxc6+", "Bxh2+", "Rhg1", "Qd4+", "Kd6", "0.04]", "Na7", "Rxe2", "-0.06]", "Qxa4", "Rhf8", "0.4]", "Nxb2", "0.02]", "Rh1", "0.55]", "Nxf1", "Qf3+", "Ke3", "Kc1", "0.58]", "Nxb7", "Qc5+", "-0.08]", "Rh7", "Qxf8", "Rxc6", "Kxe2", "Kxf8", "0.56]", "Qxa6", "Re4", "Qxd2+", "Qe3+", "Qxg3", "Qxd7+", "Qxf2+", "Qxf2", "Bxa4", "Bxh1", "Raf1", "Qd5+", "Qf1", "Kxf1", "Qb3+", "Bd1", "Kf6", "Rxa6", "-0.02]", "Rd5", "Qxd4+", "Bxe6+", "Rh6", "Nxa6", "Rxc2", "Rde1", "Bg4+", "-0.1]", "Kb7", "0.6]", "0.62]", "Nxa4", "Ne5+", "Rxf1+", "Bxa2", "Re5", "Rxa7", "Rhf1", "Rf5", "Bxc1", "Qxa3", "Rhd1", "0.42]", "Rf4", "-0.04]", "-0.12]", "Rxc7", "Rd4", "Rb3", "Rhd8", "Kg6", "Ng7", "Kxh7", "Qxh1", "Bxf2", "Kc6", "Bh4+", "Na2", "Rd1+", "Raf8", "-0.13]", "Qxh2", "Rb6", "Nc2+", "Nce5", "Nce4", "Rxb8", "Nc8", "Qf7+", "Rxb1", "O-O-O+", "-0.07]", "Nxh1", "Bb8", "Rxc4", "0.49]", "Rxa2", "Ne2+", "Rde8", "Kd3", "Qa7", "Rxf8+", "Qg6+", "0.52]", "Qc4+", "Nxa5", "Rh2", "0.45]", "Be1", "Nxh7", "0.47]", "0.63]", "-0.15]", "Rxa4", "Rg7", "-0.18]", "Rb7", "Rfb8", "Nbd5", "Nxc8", "Bxe3+", "Rxa5", "Rh4", "Rxc5", "Qxd5+", "e5?!", "Qxe8", "Bxc8", "Rdg1", "Nxh6", "Bxd4+", "0.54]", "Rxh5", "Kf3", "Bxb8", "Rh5", "Qxf7#", "Ng4+", "Rxh6", "Ne7+", "Bxa5", "Bxb5+", "-0.17]", "Qf5+", "0.57]", "Qxe1", "Nd5+", "Nf2+", "Rfb1", "Rxh4", "Nb7", "Qf4+", "Rxa3", "0.65]", "Nf7+", "Nxa3", "Ra6", "Rxh8", "Qxc8", "Rxg7", "Ra3", "Qg3+", "f4?!", "Qxf1", "Qxg6+", "Nxh2", "Bxg8", "0.61]", "Nxg7", "Rg4", "Rc4", "Nd4+", "Ncxe5", "Bh5+", "Kb2", "Rg5", "-0.2]", "Bxf6+", "-0.09]", "Bxb1", "Kxh2", "Ne4+", "Rxh1", "Rb2", "Ngxe5", "Raxd1", "Rc5", "Rxg2", "Raxd8", "Nc1", "-0.24]", "Qxc1", "-0.22]", "Nxa7", "Qc6+", "Rdg8", "Bf4+", "Rc3", "Nfd5", "0.67]", "Rb4", "Ra4", "Kg3", "0.59]", "Rc6", "Nxc1", "Rxh3", "Ra5", "Qf6+", "cxb2", "Kc3", "-0.25]", "Qxg5+", "Rdf8", "Qh6+", "Rg2", "Be6+", "0.68]", "Bxb4+", "Rxh7", "Qh2", "exf7+", "Nbxd2", "Ncxe4", "Rdf1", "Nb2", "Rd8+", "-0.11]", "Neg5", "Qxh7#", "Bxd5+", "Qxg3+", "Ndb5", "Qh7", "Bd4+", "Rb5", "Qa2", "-0.14]", "Nge5", "Nxe5+", "Rxg8", "Ng2", "Bxf3+", "-0.27]", "Nec6", "Nxg2", "Bxh7", "Qxa8+", "g6?!", "fxg7", "Nxh3", "Nbxd7", "Kb6", "Nge4", "-0.16]", "Qxg4+", "Qxb5+", "Nxa2", "Qc3+", "Nxe1", "Bg6+", "Qxe1+", "Rxb5", "Bxe1", "Qh3+", "Bh8", "Nbd4", "0.64]", "d5?!", "Ndxe5", "-0.29]", "-0.32]", "Be3+", "Bh6+", "Red1", "Qxa1+", "Qf2+", "Bf5+", "Nxf7+", "Bc4?!", "Nf4+", "Nxg7+", "Nf5+", "Qxh7+", "Rxh2", "Nde5", "Nxe8", "Bxg6+", "Qf7#", "Neg4", "-0.26]", "Rxb4", "Qxb4+", "Ne6+", "-0.21]", "Qxh2+", "Nfd4", "-0.19]", "Nfxd4", "Qxh2#", "Ng6+", "Qxf6+", "Kxf6", "Rxg4", "Kxe6", "Qh7+", "-0.34]", "-0.31]", "-0.37]", "Rxg5", "Rxe5+", "Qh1+", "Nc6?!", "0.72]", "Qg8", "Bxe8", "Nde4", "Qxe8+", "Qxg2#", "Ba6+", "-0.36]", "Qa1+", "Bd5+", "-0.23]", "Qd3+", "Qa8", "0.7]", "Qxh8+", "Nxf2+", "cxb7", "N7f6", "-0.3]", "Qa8+", "Ngxe4", "Bh3+", "Bxh2", "-0.28]", "Nc3?!", "0.66]", "Qxf3+", "Qxf8+", "-0.43]", "Qxc5+", "Ba4+", "Ba8", "d6?!", "Qxb8", "Qd6+", "Ne3+", "Kb3", "Nhf6", "Qxf2#", "Ba3+", "Nde2", "Bf7+", "0.74]", "-0.39]", "Rcd1", "Rcd8", "Kxd6", "f6?!", "Nf3?!", "Qa1", "Nf6?!", "Rxg1", "Qh8+", "-0.41]", "Ka8", "Nfg5", "Kxe3", "Qf3?!", "Bxg1", "Nxe6+", "Ng3+", "Bc6+", "Qxh1+", "Nxg2+", "0.75]", "N8d7", "Red8", "Rxe7+", "Qxb1", "Qa6+", "Ncd7", "Kxc7", "0.69]", "N2f3", "Rxe4+", "-0.44]", "Ndxe4", "Bxc5+", "Nxe4+", "Kh6", "Nh3+", "Qxg8", "Qxf4+", "Nbxd5", "Kxf3", "Qh2+", "-0.35]", "0.77]", "-0.33]", "Nxh3+", "dxe7", "Ned7", "Kxb7", "Qh7#", "Nef6", "Nh6+", "Qa3+", "f3?!", "Nec3", "Bh7+", "Nc5+", "Raxc8", "Ned5", "Bxg3+", "Bg3+", "Rbc8", "Rxe6+", "Bh2+", "Bh1", "Rfxd8", "dxc7", "Nxa7+", "Nfxd5", "Raxc1", "c5?!", "exf6+", "Rbd8", "Qxc4+", "fxg2", "Qc8+", "Qxc1+", "Qxg2+", "-0.46]", "Qxg7+", "Qxg7#", "Qxh5+", "Qe8+", "Bd6+", "Qg1", "exf2+", "Nexd4", "Ka1", "Rfxd1", "0.71]", "Nexd5", "Bxg5+", "d3?!", "Nc6+", "Nxc6+", "Nxe3+", "Qxh4+", "Ncxd4", "Ncd2", "Bc3+", "Qxf5+", "Nfe5", "Nxh6+", "Qe1+", "Qxf1+", "Qf6?!", "Bc5?!", "Rbc1", "Nc3+", "Nfe4", "Ndb4", "Rxb3", "Rxb6", "-0.48]", "d4?!", "Qxd6+", "f5?!", "Bxe7+", "Rag8", "b4?!", "0.79]", "Kxd3", "-0.51]", "Qxg8+", "Nc4+", "Nxa2+", "Qxc7+", "Rbd1", "Rxg6", "Ba1", "Kc5", "Nxc3+", "Nef3", "-0.5]", "Nbxd4", "Rxc1+", "Ned2", "Rg8+", "Qc1+", "Qf2#", "Ned4", "Nfg4", "0.73]", "e4?!", "Rxg3", "Kxb2", "e6?!", "N6d7", "g3?!", "Nb6+", "Ncd5", "Ngxe2", "Qxb7+", "Nxb8", "Qc2+", "Kxc2", "Bxb7+", "Kxe8", "c3?!", "Rxg2+", "-0.53]", "Kf5", "Rfe1+", "-0.45]", "Bf2+", "-0.42]", "c4+", "Nxb3+", "Rhc1", "c6?!", "Qc7+", "0.81]", "-0.55]", "Bxb2+", "-0.38]", "Rf1+", "Rxc8+", "0.82]", "Nxb1", "-0.4]", "Qxg1+", "Bd3+", "N1d2", "Nxg8", "Bxg4+", "b6?!", "Rag1", "Ncd4", "Qxc2+", "Qxh6+", "Qxh3+", "Bxg2+", "exd5+", "Rhc8", "Nb5+", "d6+", "Qh8", "Rxe2+", "Bxd6+", "Bxe2+", "0.87]", "Nxd5+", "Nxg3+", "0.84]", "Ngxe7", "Qg7#", "Qh2#", "Rfa8", "Qb2+", "Nf3?", "d3+", "dxc2", "Kxe1", "Nxd4+", "Bg1", "Nhf3", "Qxb8+", "Nb3+", "Nxg6+", "Qxb1+", "Nfxe4", "0.86]", "Kxc6", "Bxc4+", "Rec1", "Kh3", "Bb6+", "Qd1+", "Nh8", "c4?!", "N7b6", "Ba5+", "N1c3", "Qxc8+", "exd6+", "Qxb2+", "-0.52]", "-0.47]", "Ncb5", "Qg8+", "Rxg7+", "Bxf5+", "Bxd3+", "Qg2#", "gxf7+", "Rc8+", "Qxd3+", "Rdh1", "Kf4", "-0.54]", "-0.6]", "e6+", "Ke4", "Nxb6+", "Rce1", "-0.49]", "-0.58]", "Ncb4", "Qd7+", "Qb7+", "Rg1+", "Rf8+", "Rc1+", "Rad1+", "Bxe5+", "Bg8", "Rxe3+", "Ka7", "Rce8", "0.76]", "Rfe8+", "Rbe8", "0.78]", "N5f6", "Bxf4+", "Nfe7", "N1e2", "Nb4+", "Qg7+", "Rfa1", "Rdh8", "0.91]", "fxe7", "N4f3", "Nxg1", "Ng7+", "Nfxe5", "-0.62]", "Be5+", "Rec8", "f6?", "Ng2+", "Nhf5", "Kc4", "Bxg7+", "Rxh8+", "f5?", "Bb3+", "0.83]", "hxg7", "Rbe1", "Rxf7+", "Qg2+", "dxc6+", "Kd5", "Qd8+", "0.93]", "exf3+", "Nxh8+", "h6?!", "0.89]", "Bxh4+", "b5?!", "b3?!", "Ke5", "Nde7", "dxe2", "Kh5", "Ka2", "Qd2+", "Nxf5+", "Ncxd5", "hxg2", "0.88]", "Kxe5", "Bg4?!", "Qf1+", "Bxh5+", "Nxg4+", "Nh4+", "d4?", "Rd7+", "0.85]", "Qf8+", "Kg5", "Bxe4+", "exd7+", "e3?!", "Ka6", "Kb5", "0.94]", "-0.65]", "Kxh8", "gxh7+", "Qxa4+", "Qxa6+", "Nef5", "Nhf4", "Nh5+", "Rh1+", "Qb1+", "Qg1+", "Rh8+", "-0.56]", "Rxf2+", "0.98]", "Nxf4+", "g4?!", "-0.67]", "Be4+", "e5+", "Qd8#", "Qh5?!", "Qxg1", "Nxc8+", "Qb8+", "Kxg8", "N8e7", "0.8]", "N1h2", "Rxh1+", "Nxg5+", "Nxd2+", "Kg4", "Nh1", "e5?", "0.96]", "a6?!", "Rf7+", "Rhb8", "Qh1#", "c5+", "Ndc4", "Qxa7+", "gxh2+", "0.92]", "Qxa3+", "Kd4", "Ndc5", "-0.57]", "Rg3+", "Ncxe7", "1.0]", "Bxh6+", "Kxc3", "Rdd1", "1.15]", "-0.68]", "gxf2+", "N5c3", "Qh1", "Rdc1", "exd7", "1.01]", "dxc3+", "Nxd7+", "Ra8+", "Nc6?", "Qxe7#", "-0.63]", "Rxb1+", "Rxa8+", "cxb7+", "c2", "exd4+", "Ndxc4", "Nfe2", "Na8", "1.13]", "Kxg6", "Kxc8", "Ra1+", "Qh8#", "Nxd8+", "Bf6+", "N4c6", "N2g3", "Bf3+", "-0.59]", "1.03]", "d5+", "Ka5", "1.06]", "-0.74]", "0.9]", "1.05]", "Rhe1+", "Nac5", "Bf4?!", "Nd7+", "Ngxf6", "Rxg1+", "Re7+", "Kxh6", "Kxg3", "Rxd7+", "Qe2?!", "Ree1", "Rae1+", "dxe6+", "Qe7?!", "Qxa2+", "1.08]", "Nd2+", "Reb1", "-0.81]", "Ndxe7", "Ree8", "Rad8+", "N7c6", "Rdc8", "Nef4", "Raa8", "-0.61]", "-0.66]", "Kh4", "Qxa5+", "cxd7+", "h5?!", "Nac3", "Ndxb5", "h6+", "1.12]", "Rxg8+", "f5+", "N3d2", "Rhe8+", "-0.7]", "Kxe4", "-0.77]", "Nxc4+", "fxg6+", "Nf6?", "Rf2+", "cxd2+", "Nec5", "Rxc2+", "e2", "Nxc1+", "-0.72]", "N7g6", "Ndc6", "-0.75]", "fxe6+", "cxb2+", "N2b3", "0.97]", "Ndxf6", "Nec4", "g4+", "Nc3?", "-0.71]", "Rxd2+", "e3+", "d7", "-0.64]", "Nxf8+", "Bxf7+?", "Rdd8", "Nac4", "1.17]", "-0.86]", "Bc5?", "Reb8", "Kxd5", "Rxg3+", "c7", "Qa7+", "Nac6", "Qxf1#", "exd3+", "dxe5+", "Re2+", "Nfxd2", "d4+", "Bd6?!", "Ncxe2", "Ndc3", "d2", "1.18]", "Bxh3+", "Rxc7+", "Na1", "Rhb1", "Kxd4", "e4+", "Ndf5", "Bf5?!", "Rxd4+", "Kb4", "Rxb8+", "N2c3", "d7+", "Ndxe2", "-0.69]", "Rb8+", "Bxc7+", "-0.82]", "Nd4?!", "-0.84]", "Ndf8", "Be7?!", "Qxe2#", "bxc2", "Rxd5+", "e7", "f3?", "Rff1", "Nxf1+", "Nfxd7", "Rd2+", "Nexg4", "Rxa1+", "O-O+", "Ndf4", "1.1]", "0.95]", "Nxb7+", "Kxg4", "Rxd6+", "1.2]", "Rfd1+", "b4+", "-0.89]", "-0.79]", "1.16]", "Kxh1", "exd2+", "1.07]", "Kxc1", "Bg5?!", "d5?", "dxe3+", "Qd1#", "d6?", "-0.87]", "Kxg1", "Nxh1+", "d3?", "Qf3?", "Qe6#", "Qxb3+", "fxe2", "Bd2+", "Nxh2+", "1.24]", "N5b6", "Nxd1+", "Qe8#", "Rg6+", "a7", "g5?!", "1.09]", "Rexd1", "c4?", "Rac1+", "Rc7+", "Rxf6+", "bxc7", "Nfxg5", "1.22]", "Qxb6+", "Ng5?!", "Raa1", "f4+", "Na2+", "Bc7+", "Rxb2+", "0.99]", "Ref1", "bxa2", "Rb1+", "Ref8", "N5c6", "Qa2+", "Nexg5", "Na7+", "Nbxc6", "fxe5+", "Rae8+", "Bd3?!", "exf7", "Rff8", "h2+", "N8c6", "Na4+", "-0.73]", "Kxg5", "-0.8]", "Ndxc5", "Qxe1#", "gxh2", "Nh3?!", "Rxh7+", "Rxd3+", "cxd4+", "Kxa7", "Bc4?", "Bxc2+", "Rd6+", "1.19]", "Rfxc1", "-0.78]", "-0.85]", "Ka3", "Bxa3+", "g6?", "h5+", "-0.83]", "1.02]", "f7+", "Nhg5", "gxf3+", "Ndxf3", "h3+", "Qxb2#", "Qxd7#", "Nexd7", "gxh7", "g5?", "1.04]", "1.27]", "Ka4", "exf5+", "Nxc5+", "Rh2+", "axb7", "N4c3", "Rac8+", "exf4+", "N3h4", "dxe4+", "Nxe8+", "-1.06]", "f3+", "h4?!", "Re3+", "c6?", "Qa8#", "Re8#", "g3+", "Rhxf8", "f6+", "-1.03]", "f4?", "Nac7", "Bd7+", "cxd7", "Be3?!", "h6?", "Rbb8", "Rbxc8", "1.37]", "-0.94]", "Be6?!", "Rd3+", "g5+", "Raxb8", "Qe1#", "Qxf8#", "Rdb8", "Rxb7+", "Qa1#", "Be7+", "Be2+", "Rxc3+", "a3?!", "Qxe8#", "Qd7#", "Ne5?!", "N4a6", "g4?", "Bxf2+?", "Nab4", "1.31]", "Rxh2+", "bxa8=Q", "-0.93]", "Rhxf1", "-1.0]", "-0.9]", "1.21]", "e6?", "Rah8", "1.23]", "Rg2+", "Rcc8", "dxc5+", "Bxa6+", "Nh6?!", "Rge1", "Bxf7#", "Nce8", "b7", "N1f3", "Nxe1+", "fxg3+", "Rxg5+", "hxg6+", "Neg6", "1.14]", "Ngxf3", "N3h2", "Bb7+", "1.39]", "Nxh7+", "Ndf1", "-0.91]", "h7+", "axb2", "Kxh3", "Ngf5", "Kxf4", "Rxf4+", "e4?", "Ncxb5", "1.34]", "Ne7?!", "b3+", "1.25]", "cxd2", "-0.96]", "Rbb1", "Qxg6#", "-1.18]", "Rxc6+", "Nab5", "1.28]", "h3?!", "Qc7#", "Na3+", "Rgf8", "Rh3+", "hxg4+", "N7xf6", "Rcxd1", "Ndb8", "Qxb7#", "-0.98]", "N4g3", "Nbxc3", "Qh4+?!", "b6+", "Neg5+", "Rxf3+", "Qxc7#", "fxg7+", "c5?", "Rh7+", "Kxa8", "Qf8#", "Qxe6#", "Ncd6", "Qh5#", "-1.08]", "Nce3", "Rd8#", "Kxc5", "1.36]", "Nde3", "Rfxc8", "Ngxf7", "N5e4", "Qxd8#", "b5+", "Qe7#", "Rxf5+", "Nba6", "Nxd5?!", "Ne4?!", "Rb7+", "Rfd8+", "N5g6", "N5a3", "c3?", "Nfe8", "Nhg4", "Na5+", "Qa5+?!", "g7", "N6h5", "N4b3", "-1.12]", "Kxb6", "gxh8=Q", "Raxb1", "Naxc4", "Nfxg4", "h4+", "Qe3#", "Re6+", "d2+", "-0.92]", "Qb6?!", "hxg3+", "Rexd8", "Rah1", "exd2", "Qxd5?!", "Bf5?", "Kxb5", "c3+", "-1.1]", "Kxa2", "Rdb1", "Qxd2#", "b6?", "Nh7+", "Qe2#", "gxf7", "a5?!", "Nf3#", "Rg5+", "Bg6#", "Re4+", "c7+", "Bg4??", "bxa7", "Ncb8", "bxa1=Q", "cxd3+", "a2", "Bb2+", "Rcc1", "Rfxe8", "N6e7", "b2", "-1.05]", "Rgf1", "Rxg6+", "Rge8", "Rhg8+", "dxc7+", "Nd6#", "h7", "Rcf8", "dxc5?!", "Ndxb4", "Neg1", "Bb4?!", "f2+", "1.26]", "Rcb8", "Nbc5", "Bb5?!", "Nd5#", "Qc8#", "Rgd8", "Nac2", "Rcf1", "fxe4+", "Rhg1+", "Ba6?!", "Nexd2", "Qh5?", "Qf1#", "Nbc4", "Bg7+", "dxc4?!", "Rg4+", "exf8=Q+", "a3+", "Nxd4?!", "Qh4?!", "Kxb4", "a4?!", "O-O?!", "Nfg6", "-1.01]", "Nfg8", "Kxf5", "Qf6?", "-1.13]", "Rcxd8", "Nfe1", "Rxg4+", "Bxb6+", "Qb2#", "Re5+", "Bd7?!", "Kxb3", "Nf7#", "Bg5#", "Re1#", "Rdd7", "Kxc4", "Qd6?!", "Bg4?", "N4f6", "1.32]", "Rb2+", "Bxa7+", "b5?", "Neg8", "Nf6#", "g3?", "Qg8#", "a5+", "Bg7?!", "c2+", "Ncd3", "Rxh3+", "Rde2", "Rc2+", "Bb5+?!", "1.29]", "Qh4#", "cxd6+", "Nhf7", "-0.95]", "Rf4+", "Rbxd1", "Bg5?", "Nxb4+", "Rd5+", "Nd4?", "1.11]", "Nh6?", "Nba3", "Nxg8+", "-0.76]", "Rd1#", "Qxc2#", "dxe5?!", "Bxf3?!", "N8h7", "Rde1+", "bxc6+", "Ngf4", "1.46]", "Bh6#", "Qg4#", "Raxe8", "fxe5??", "Nxf7?", "Qd2#", "N6d5", "Nc7#", "Rde8+", "Nca6", "Ncxb4", "Rh1#", "Rh6+", "Rxh6+", "Nexc3", "Nb4?", "e3?", "Neg3", "Bxf1+", "Nxb5+", "e2+", "Nexf5", "Nxh4+", "Ndb6", "Nxe4?!", "Raxf8", "Nce6", "Qg3#", "Nxb2+", "Bb4+?!", "a4+", "-1.11]", "c6+", "-0.88]", "Bg4#", "-0.97]", "Ngh3", "Bxa4+", "gxf6+", "Ngh6", "Qxc1#", "dxe4?!", "exf2", "g6+", "gxh1=Q", "Bf7#", "-1.09]", "Bg5??", "Ncxe6", "Ncb6", "Nxe5?", "N4d5", "Nfh5", "Bg2+", "Nb5?!", "Ng8?!", "Ngxf2", "Ng3#", "Qxd1#", "Ne2?!", "Rdg1+", "Nexc6", "Nxh5+", "Rxe1#", "Qg6#", "Ngxe6", "Rf6+", "exd4?!", "Bxa2+", "Qxh3#", "Ngf8", "Nf6??", "Nd7?!", "Be2?!", "exd5?!", "Ne8+", "Bxf2#", "Ng1?!", "Qd4#", "dxe7+", "f7", "Nge6", "Nfd3", "Nxf2?", "Qb5#", "Ng5??", "g2", "Bb7?!", "Nb4?!", "Rf5+", "Qxh6#", "Qd5#", "Bxd8+", "Kxb8", "Rde6", "N5f3", "hxg7+", "Bd1+", "Qd6#", "Rxa7+", "Nec8", "N8f6", "e7+", "gxf1=Q+", "Nh2+", "Nxf2#", "Na6+", "dxc4+", "fxg2+", "Nhxg5", "Qxc8#", "e6??", "Nexc5", "Ngf7", "f2", "Nxc7#", "Rh8#", "Bc4??", "b3?", "Rbxc1", "bxc3+", "hxg5+", "Rbf1", "Kf1+", "Nfg3", "-1.2]", "Rfxe1", "Ncb3", "Rbxd8", "Nbd3", "fxg5+", "Qe5#", "-1.17]", "-1.04]", "Ne5?", "Nhxf6", "R6d2", "Qxd4?!", "Ndc7", "Nfg1", "Qh6#", "d5??", "1.56]", "Reg8", "Nge7?!", "1.48]", "Bxa5+", "Be7?", "Qd3#", "1.5]", "Rc5+", "Rd4+", "Rf3+", "-1.28]", "Raxe1", "N3e4", "Rxf1#", "Ncxe3", "Nexc4", "Bd2?!", "Qh3#", "Rfc8+", "Nexf6", "Nxf3#", "Ra2+", "bxc2+", "Rxc5+", "Nbd6", "cxd5+", "Be6?", "Rxh5+", "g2+", "-1.14]", "g7+", "Ndb1", "Bb4?", "Ned6", "Rhh8", "1.4]", "Qg5#", "Nd3#", "Nb7+", "1.44]", "Be6#", "1.35]", "Rhh1", "Bxc6?!", "Ned3", "-0.99]", "dxc4?", "Rc4+", "Ngh2", "axb2+", "Qxh8#", "N6a5", "1.33]", "-2.44]", "Qe7?", "Qa4+?!", "Rff2", "1.38]", "Ndxf7", "Bxg6#", "Nhxf3", "Rha1", "Ng4?!", "Be2?", "Nh3?", "N3e2", "Qxg8#", "fxe4?!", "Rxa2+", "h2", "Rha8", "Bc2+", "Bxf8+", "Qc1#", "Bd3?", "Ndc7+", "Rdd2", "N3a4", "Qf6#", "fxe5?!", "exf5?!", "Kxa1", "1.42]", "Rgd1", "Rbf8", "Nef3+", "Nf3??", "Nca3", "exf6?!", "Bxb3+", "-1.02]", "Nfe3", "Nxa8+", "-1.33]", "Rea1", "Bb5+?", "Ng4?", "Nxe4?", "N8xd7", "-1.24]", "Ndxf2", "Rfg8", "Nc6??", "-1.31]", "bxa8=Q+", "Rcg1", "Nxb8+", "Rae2", "Ngh7", "fxe5?", "Nce1", "Bxb7??", "fxg4+", "Nf2#", "Na5?!", "Ra7+", "Qe4+?!", "N3d4", "Ree2", "Rg7+", "Nbxc4", "Bc5#", "Bg8+", "Neg4+", "gxf8=Q+", "1.7]", "Bf2#", "axb3+", "fxe3+", "-3.16]", "Qf4#", "Rxc4+", "Rb8#", "d6??", "Nfh4", "Ndxe3", "Qxe3#", "Qb4#", "Ne4?", "Bxb4??", "fxe7+", "Be3?", "Qb7#", "N8xe7", "-1.21]", "Nexf7", "Rf8#", "gxf2", "Nbxd6", "Ree7", "Nd8+", "Nde6", "N5h3", "-1.07]", "Rcg8", "Ndf7", "Bh3??", "Red4", "Bg2?!", "Rxf8#", "Rhf8+", "-3.01]", "Rfd2", "Ng6#", "Bxc4?!", "Qb3?!", "Nexf4", "a6?", "Nxf7#", "1.3]", "Nfxe7", "Nb2+", "Na3?!", "1.47]", "Ne5#", "Rcb1", "-1.48]", "Qf5#", "Na6?!", "Ref2", "R8f7", "f6??", "-1.43]", "Nd5?", "1.41]", "Rgg8", "h1=Q", "1.63]", "Nhxg4", "Rxd1#", "-1.27]", "Qb1#", "Ncb1", "1.53]", "Ncxd7", "Red2", "R5d3", "g6??", "N6e5", "Naxc6", "hxg2+", "a3?", "Rdc2", "1.71]", "N4e5", "Ra8#", "Qd1?!", "Ngf1", "1.51]", "-2.1]", "a6+", "-1.4]", "-3.13]", "Nhxf4", "Bf4??", "-3.56]", "1.82]", "Ng5?", "Rfc1+", "gxf5+", "Ned6+", "Bg1+", "Rxb6+", "Nhg6", "dxc2+", "Nhf8", "Red3", "R3f2", "Nhxf5", "Bg7??", "e5??", "Qd5?!", "Nfg5+", "Qd2?!", "-1.5]", "Kf8+", "Bxc8+", "exd8=Q+", "Bb4+?", "Rb3+", "-1.53]", "Nec1", "Nexg6", "Nef7", "Nexf2", "1.45]", "Nc2#", "Rde4", "2.68]", "Rc3+", "Rxb3+", "Naxb5", "Qxh4#", "d4??", "Nd4#", "Ngxe3", "Qb6?", "Nfe6", "Reg1", "Nbd7?!", "Nab8", "Nfh3", "N5d4", "Nhg1", "Nac6+", "Rdg8+", "Qc2#", "gxh3+", "Ne4#", "R6c7", "Nxf6#", "Bxe6#", "bxa3+", "Ngh4", "b4?", "N2xf3", "Bf5#", "Nge3", "Raa2", "-2.15]", "R8d7", "Ne7#", "Ncxd6", "dxc3?!", "Qg4?!", "R4e2", "Nd5?!", "Ne7?", "Rfc7", "Nab1", "Nb4#", "-2.25]", "Ndxc6", "Rab8+", "Qh5+?!", "Rh5+", "Bxf3#", "exf3?!", "Rbg8", "Qg1#", "Ba6#", "Na5?", "Nxg1+", "N5h4", "cxb1=Q", "R3d2", "Nbc2+", "Bxc3+?!", "Nbxc7+", "Bh3?!", "Ng1+", "Qc7?!", "Nexf6+", "Kxb1", "Qxf3#", "cxb4+", "Red7", "Ne1+", "N5f4", "fxg8=Q", "Rxh2#", "-1.15]", "Nxe5?!", "Qd3?!", "bxc5+", "-1.19]", "Nh6#", "Bb5?", "1.68]", "d3??", "-3.71]", "Rdxd7", "1.62]", "Bxh7#", "N1xd2", "-1.55]", "Qxf6#", "-3.14]", "Rcd3", "Qxg1#", "Bb2?!", "Nfxd3", "Rfe2", "Ng5#", "exf1=Q+", "Bd7?", "Nfh6", "Nc3??", "Nef6+", "Rexc1", "Rfxf2", "cxb5+", "Ba5?!", "-2.18]", "-2.04]", "Be8+", "Ng4#", "Rxf2#", "Nh5??", "Bf6#", "1.81]", "Nfd7?!", "-1.56]", "Nxd5?", "Bb5#", "1.54]", "Nhg3", "Rde7", "dxc5?", "N3xe4", "dxe2+", "a7+", "Rxh4+", "Rhf1+", "N8a6", "exf4?!", "1.43]", "dxc8=Q", "Nb6?!", "-1.46]", "Rab7", "Ba3?!", "Rgc1", "Qxa1#", "gxh8=Q+", "Qg5?!", "Nexd3", "N6h7", "exd1=Q", "Ne5??", "Rg8#", "dxc1=Q", "Bxf6?!", "Rec2", "Rf1#", "Nge2?!", "Rhxd1", "Qxg4#", "Bb6?!", "cxd4?!", "Qc5#", "Rfg1", "Bxg5#", "Naxc5", "Rexe7", "Nfxe3", "Qxg3#", "N1h3", "2.43]", "Qd7?!", "Ncd8", "3.55]", "2.81]", "1.67]", "1.64]", "Nbd6+", "Bf3#", "-1.77]", "Be7??", "bxc7+", "3.43]", "Rff3", "Rfg3", "Bf4#", "Nexf3", "-3.12]", "-1.79]", "1.75]", "Nhf1", "Kxh5", "Qxf5#", "1.98]", "Rdf7", "-1.95]", "h8=Q", "Nxa1+", "Rdxf8", "Rxe8#", "O-O?", "-2.23]", "Bxe1+", "Bd6?", "N7d5", "-1.22]", "Nhf6+", "Bh6??", "-3.48]", "-2.22]", "f3??", "N4b5", "Nbc8", "Kxf3+", "cxb8=Q+", "Qf3#", "Red1+", "Qc2?!", "Rfxb1", "Bc5??", "Nbd3+", "Rec7", "Kf7?!", "1.65]", "-1.44]", "Bxb8?!", "Nhf2", "R8e7", "axb7+", "-1.36]", "exd1=Q+", "Qb8#", "Rbg1", "Rhh7", "Qd8?!", "Qh4?", "Nge4+", "1.72]", "R3e2", "Qa5?!", "Raa3", "Qc3#", "-3.18]", "Nce5+", "Qxc6#", "N4h5", "dxe5?", "1.59]", "Nhg8", "-1.62]", "Ra3+", "bxa6+", "Rdf2", "bxc4+", "Bd2?", "gxf4+", "1.76]", "Rce7", "Bh3#", "Rgg1", "N7xe5", "N1a3", "-2.33]", "1.94]", "Rxh7#", "1.55]", "-3.91]", "Rcd2", "N1c2", "Rfe3", "Nh8+", "Rxg1#", "hxg8=Q+", "Rhxg1", "Qxa7#", "-1.69]", "-3.15]", "-3.17]", "Bxd1+", "R1d5", "Nfxd6+", "Rxc8#", "Rhxg8", "Rcf2", "Qf3??", "-3.24]", "Rgf4", "Rad7", "g4#", "-1.38]", "1.57]", "Kf7?", "1.91]", "1.77]", "Rab6", "Kxh4", "Naxc3", "Qxb4#", "bxa1=Q+", "N2g4", "Rdh2", "R1e2", "Qxg5#", "1.83]", "Nb6#", "Nf5#", "dxe4??", "-2.13]", "Nd2?!", "Ndxf4", "Qxh5#", "#1]", "Rh2#", "1.86]", "Nhf3+", "Rdxe1", "Qa4?!", "Bxc3?!", "-2.36]", "h5?", "Nfe2+", "-3.09]", "-3.32]", "Raxa7", "Bd6??", "Bf5??", "Nef2+", "gxh6+", "2.69]", "N4xe5", "Bd8+", "Nac8", "Nxg3#", "gxh1=Q+", "Nxd4?", "2.76]", "fxe8=Q+", "c8=Q+", "Rfd7", "Nbc2", "1.74]", "bxa7+", "f8=Q+", "-2.46]", "Rdxf1", "Rhxe1", "Raf7", "Ndb5+", "Ba4?", "-2.11]", "-3.21]", "exd6?!", "bxc8=Q+", "Nxc2#", "Rgxf8", "Qxb5#", "Nfxg3", "-2.08]", "N4h6", "b3??", "Nbxd3+", "-3.39]", "Rcc7", "Qc5?!", "Qa5?", "-3.6]", "-1.35]", "-7.08]", "fxg1=Q", "-1.29]", "Bxf2+??", "1.93]", "Bh4?!", "Rg5#", "Ng4??", "R1d2", "Ncd5+", "Rfxf7", "-1.92]", "Nbc7", "-2.35]", "Ncb5+", "Qxa2#", "Bc1+", "h3?", "-2.14]", "R5c2", "-2.31]", "Nxd6#", "Bb5??", "Nbc7+", "R8e6", "Kxa4", "cxd8=Q+", "Nfe4+", "-1.82]", "-2.98]", "Ndc2", "N6a7", "Nef8", "Bxh8+", "7.6]", "Nfxe7+", "Rexc8", "-3.11]", "-1.67]", "-3.58]", "Rdxe8", "-3.53]", "-3.5]", "R5d7", "-1.32]", "Rxg8#", "Qe7+?!", "R8f6", "3.58]", "Qc3?!", "dxe6?!", "Nh6??", "Ba4?!", "Qxb1#", "N2e4", "Bg3#", "Rhxd8", "Bxb1?!", "Rge8+", "-2.02]", "Qe4#", "N7xg6", "Bxd5?!", "N7f5", "Na8+", "-1.98]", "Nd4??", "Rad3", "Ndf2", "Nba4", "Nd1+", "Nd5??", "Bd6#", "-2.48]", "f4#", "Rb1#", "cxb6+", "c5??", "Ndxf5", "Bb3?!", "Nb8?!", "R5d6", "Bg7?", "4.89]", "Ndc2+", "2.61]", "N2c4", "Bb4??", "N8c7", "N2d4", "1.79]", "3.24]", "R6f7", "Nab3", "fxe2+", "Bf1#", "-1.94]", "Kxa5", "R4d7", "Nexd6", "Qe2?", "Na7#", "Bb6?", "Rxc1#", "N7b5", "Ng8?", "Nce7+", "Nxe5#", "Nfxg6", "Ba3#", "Rab1+", "Nde8", "Bh5?", "bxc4?!", "-1.23]", "Nfe7+", "3.15]", "Nfxd3+", "Rad2", "Nbxc5", "e8=Q+", "-1.72]", "Rgc8", "Rde3", "Bxh3?!", "Rg1#", "dxe8=Q+", "Na2#", "R6b7", "2.77]", "cxb3+", "2.75]", "Rb5+", "Bxe7??", "-3.34]", "Nca4", "Bb1+", "-1.25]", "Ra6?!", "Nc1+", "-1.37]", "c6??", "Nfd6", "Ng3?!", "Be4?!", "Ne2#", "Rce2", "1.61]", "Bxe5?", "cxd6?!", "Rcc2", "-3.7]", "fxg8=Q+", "2.71]", "N2xg3", "Nexd6+", "Qg3?!", "a5?", "Ndxf6+", "Nfxd4+", "-2.75]", "-2.61]", "-2.77]", "Qd6?", "6.79]", "R1d7+", "Rf7#", "Rbb2", "Qc3??", "Qe5+?!", "Ngxh3", "-2.88]", "-2.81]", "-3.63]", "dxe5??", "Qxa6#", "Rcd7", "Qd8?", "Rfb7", "Nc6#", "cxd1=Q", "Ncxe6+", "3.38]", "N6c5", "N7g5", "3.31]", "Nde2+", "Nec7", "Rhh6", "N7xc6", "Nfd5+", "Ke1+", "-2.56]", "N6f5", "Nef1", "Ndxf8", "Nxa7#", "Kxa3", "Ra3?", "-2.07]", "-2.06]", "-1.99]", "Bc3?!", "R5a2", "Rexf1", "-1.42]", "c1=Q+", "-2.41]", "Nec6+", "Bb4#", "2.88]", "Rbc1+", "N5xh4", "2.91]", "2.93]", "N6g5", "Qe2+?!", "Nfg4+", "4.56]", "Rdd6", "R7b2", "Qb3#", "Rhxh4", "g1=Q+", "Qxd5#", "e4??", "2.78]", "4.13]", "Nec3+", "Ree4", "Be2#", "Rc7#", "Nce3+", "Rexc3", "Bxh6?!", "Qa2#", "1.73]", "N6xe5", "-3.25]", "-3.03]", "-3.0]", "Rhg3", "Nbxd3", "Rb6+", "-2.16]", "Nfd4+", "Ra6+", "Rh7?!", "Nde7+", "Rhd1+", "Rce6", "N3f4", "Ndb3", "Ngxf6+", "Qc6?!", "f7#", "Rba8", "-2.05]", "Rdd3", "c3??", "cxd1=Q+", "R1d3", "Rdc8+", "Ndf7+", "2.99]", "Reh1", "-1.85]", "Nd6?!", "Rdf4", "e3??", "Nxa2#", "2.23]", "Rh4+", "N2xc3", "Qxd3#", "N4xb3", "4.03]", "Rh6#", "Nfxe6", "Rgf3", "Bxe8+", "Rbc2", "cxd8=Q#", "Qe6+?!", "Rc6+", "-1.58]", "R1b5", "Nba5", "2.25]", "Ndxe6", "Bh5#", "Bxe2#", "Na6?", "-1.59]", "Rec3", "-2.62]", "Nba7", "Ra1#", "Ke2?", "cxd4??", "Ncd4+", "-3.19]", "Ncd6+", "-2.83]", "Ree6", "Rff7", "N5xd4", "N3c2", "Ncxd3+", "Nfxh7", "Ree3", "Rgxf1", "-1.34]", "-3.08]", "-3.06]", "Ref5", "gxh4+", "R8xd4", "7.56]", "fxe4?", "Ng6?!", "Qh4??", "Bd5#", "e1=Q+", "Rfd6", "R1b2", "Raxg1", "Bxf7+??", "Bc4#", "Rhxc8", "Bxc2#", "Nxb3#", "2.45]", "Bxf6?", "-3.26]", "-3.35]", "-2.99]", "Bd5?!", "Bxd5??", "-3.54]", "Qg5?", "Ngh5", "Nfh2", "-2.2]", "Qa5+?", "4.27]", "Ncxd2", "N3xh4", "R8b7", "Rxf7#", "Nge3+", "Nxd3#", "a1=Q", "Qxc5#", "Rde5", "7.59]", "Rfd3", "-2.49]", "Nhg7", "4.45]", "Rdxe7", "Kd7+", "Rdh4", "Nexc7", "3.7]", "Qb4+?!", "Bd3#", "Rgh8", "N6xd4", "-3.04]", "Naxb3", "1.85]", "Nef7+", "d1=Q+", "Rxb5+", "Ncb7", "Rh3#", "2.95]", "Bxg1+", "R3a2", "1.99]", "1.6]", "Nh3#", "Bxf3?", "N2e3", "Rexe2", "Ng6?", "Ngxh2", "Ngxf5", "Rdg3", "Nf1+", "R3d6", "Bb3#", "R5g4", "Qxh1#", "3.33]", "Be2??", "Bxc3#", "Qg5??", "Bg2??", "2.63]", "Nhxf6+", "3.72]", "g3#", "-2.5]", "-3.41]", "N6c4", "2.03]", "-2.58]", "3.86]", "Bf4?", "1.69]", "Nac1", "Nfd8", "Ned3+", "Rcd6", "Ndf6?", "Nf8+", "g8=Q", "Bxf6#", "-2.59]", "-2.45]", "8.18]", "Rge5", "1.78]", "Qxb8#", "Rb8?!", "Bb7#", "Rac7", "Rba1", "-1.75]", "Bxh6#", "-3.68]", "Ndxc7", "Bxb8+", "R6e7", "Rag1+", "Nc8+", "Ndxc2", "-1.16]", "Nxg6#", "Qa3#", "3.34]", "Neg7", "Bxd5#", "Rxd2#", "Bc2??", "Qb4?!", "-1.47]", "-3.77]", "Rbe7", "Ndxe5+", "Ncxd3", "Naxb4", "hxg1=Q+", "Kc1+", "Rhc8+", "Nexc2", "Red5", "Nca5", "R1f2", "Rhxf4", "Nexg3", "N8g6", "-2.72]", "Rae3", "Nfd6+", "Nh2#", "3.59]", "Bg3?", "Nfd3+", "2.17]", "Rfe7", "N6xh5", "Rxd6#", "Bc6#", "Bf1+", "-1.26]", "h2#", "-2.01]", "Nbxc7", "Bc3??", "dxe4?", "Qxc3#", "1.52]", "Nb5?", "-1.73]", "-3.31]", "Bf6?!", "Bd3??", "Raxg8", "Rea8", "exf8=R+", "Qc8?!", "Be3#", "h6??", "Rxh3#", "2.62]", "Rbd2", "Rec4", "Bxc5??", "4.67]", "R5f7", "Nh5?", "2.94]", "Rdg2", "-2.27]", "3.57]", "N5xf4", "Nb5#", "-3.36]", "Nxc6#", "Nd6??", "Qc4#", "Bg2?", "-2.32]", "Nh4?!", "h8=Q+", "Nfd2?!", "Bxb1+", "7.52]", "2.51]", "Rgd3", "a5#", "3.16]", "3.17]", "3.19]", "Naxc6+", "Rd6#", "Nxd4??", "Nc5?!", "Ncxe4+", "-1.3]", "Rhxc1", "Nxh7#", "N4g6", "R6d3", "Qxd6#", "Nxe6#", "2.73]", "N1xe2", "-1.87]", "cxb8=Q", "Nd7?", "Ncxd4+", "N1xc3", "R8xd6", "R1a7", "Kf2?!", "-1.51]", "Nbxd6+", "Ncd1", "Bxh2#", "Ned4+", "Ncxd5+", "Bxg4?!", "-2.97]", "3.29]", "Ndf3+", "Bxe7#", "#-1]", "Nbxc2", "R6d4", "Ba7+", "Rxe7#", "R6f3", "-2.21]", "Nf4#", "Qa6#", "g3??", "2.82]", "Ngxf4", "-1.49]", "N3e5", "3.36]", "-3.49]", "Ng1?", "Ne7??", "3.84]", "3.9]", "Rxh6#", "N3e5+", "N4f5", "R1g2", "Nxb7#", "Nbd2?!", "Bg6?!", "Bb7??", "5.11]", "Qxf6?!", "4.1]", "Nbd7??", "Rce3", "Nef2", "2.72]", "Qf6+?!", "d1=Q", "Qa4#", "Rbxb2", "Rcxd5", "-3.94]", "cxd5?!", "-6.88]", "5.98]", "fxe8=Q#", "Be4#", "-3.59]", "-3.67]", "exf6?", "Raf1+", "Nf5?!", "R8c4", "Bg6?", "R8b3", "N5c4", "Nc5#", "-6.16]", "Rfxf8", "-3.96]", "Rbxe1", "R6c4", "N2d3", "Nbxa2", "Bxd4?!", "-1.76]", "Nxb5#", "Nef4+", "N3c4", "7.07]", "7.15]", "8.84]", "8.76]", "Q1xc3+", "Qac3#", "a6??", "-6.89]", "-6.84]", "-7.22]", "10.67]", "10.61]", "Kh7+", "Nfxe6+", "2.1]", "4.69]", "4.61]", "Ncd3+", "Rda2", "Rdc7", "R2xb3", "Ndxe7+", "Qea5", "h5??", "R1h4", "Rbxe7", "Qh3?", "R1xd5", "Ng7#", "Bxg4?", "R4d5", "Nab6", "Rexd7+", "Nbxa7", "Bxe7?", "Qdxd2+", "N4xd5", "Nce2?!", "Bxf2+?!", "Qc6??", "6.59]", "R6d7", "Ncxd6+", "Rxa8#", "Rfxc7+", "Rbb3+", "N3g5", "fxg1=N+", "R8a7", "Rcxc7", "Qxc4#", "Qh6??", "Bxc5?!", "Qda4#", "gxh8=R+", "-3.65]", "Nb6?", "4.18]", "4.25]", "4.05]", "Bg7#", "R1f5", "-1.86]", "R5xc4", "Ndf6+", "-2.66]", "Nf7??", "g5#", "exd8=Q", "-2.37]", "gxh1=N+", "g1=Q#", "Nxh3#", "Rcd4", "b3#", "Rgd7", "Rfc2", "1.9]", "Nde4+", "Qdxd4", "Qhf6+", "R1c3", "dxe3?", "N4e3", "Rfxc2", "Rdh5", "Rbd1+", "a6#", "Nab7", "Q3xf6", "Q8g7+", "-4.86]", "Rca5", "f6#", "-4.28]", "3.88]", "2.9]", "Nh4?", "-2.74]", "c4#", "R1c6", "Qaxd8+", "h1=Q+", "N5xe4", "N7xd5+", "exf2#", "3.25]", "gxf6?", "2.96]", "Bxa3?!", "Bxg3#", "a8=Q#", "Qf3+?", "-6.99]", "R1e6", "Rad6", "R3d4", "Ngxh7", "Reg4+", "3.46]", "2.27]", "Rhxd2", "bxc3?!", "Ngh2+", "Qhe5+", "Nexd8", "3.92]", "N2h3", "Kf6+", "b1=Q#", "Rdg7", "-1.68]", "Bxc2?!", "Rgxh6", "-3.37]", "hxg5#", "-2.65]", "Nxg4?!", "Nh7?!", "dxe4#", "Bxb5?", "Bc4+?", "R6c5", "N4c5", "Nc7?", "Nab2", "Ndc8", "R5e7", "N8a7", "R6f4", "Nexg3+", "4.93]", "g5??", "N4xh5", "gxf5??", "Nbc6+", "Bd5?", "Rexe2+", "Rcxa7", "3.95]", "3.87]", "Qxd2+??", "15.57]", "15.05]", "R5b6", "Qd7?", "Rbxb2+", "7.85]", "7.87]", "8.88]", "8.91]", "cxb1=Q+", "exf1=Q#", "Ngf5+", "Naxb6", "-3.75]", "Bh5?!", "1.87]", "h4??", "-2.93]", "Rexa4", "R4xd6", "Nf4?!", "Rfxe3", "Bxa1+", "7.54]", "7.55]", "Be4?", "-2.96]", "Nh4??", "-3.61]", "Bg6??", "Qd4?!", "Nhf5+", "R4xd5", "-4.27]", "Bc8+", "Ngxf7+", "10.77]", "10.68]", "11.37]", "Rbxb8", "Bxe6??", "Rhxe8", "Ned1", "N5xb4", "Rf6#", "N8h6", "Qe5?!", "R8g2", "-4.17]", "2.7]", "Rda1", "-2.53]", "-4.15]", "Bxb7#", "Ba2+", "-2.57]", "R2e4", "N5a4", "Rdb4", "-2.26]", "Rhe4", "R8d3", "R8g7", "N6xf4", "fxg3#", "Ncb3+", "R4c7", "Bxg8+", "Ndc6+", "Rdf1+", "g6#", "g7#", "Nxg2#", "Re2#", "7.63]", "6.98]", "Rexf8", "Rba7", "Rexf7", "a8=Q", "4.54]", "Rcb6", "Raxd8+", "Rfb2", "3.77]", "-7.91]", "-7.84]", "-8.81]", "Qdf6", "N7a5", "f5??", "-7.06]", "Bxc3+?", "Nc4?", "N4xg5", "-2.51]", "Nexf7+", "3.74]", "Rfh7", "R8a3", "Rcxc2+", "-6.64]", "Rexe6", "Bxc6+??", "Rbxe6", "Rhg2", "Qd4?", "-6.15]", "R2xe5", "g8=Q+", "axb5+", "N3xd4", "2.31]", "Bxc1+", "Rce8+", "Ngxe4+", "R1h7", "Kf1?", "Ngf6?!", "fxe1=Q+", "-6.41]", "Qxf6?", "Bxd3#", "3.65]", "3.52]", "Ngf6+", "Ndxe6+", "Rbxe5", "3.1]", "c4??", "Bxb1?", "-5.5]", "Raxf1", "R7xf6", "Nbxa6", "Rdf6", "Q8xd5", "Q5d4", "e5#", "8.33]", "8.51]", "3.67]", "3.51]", "3.56]", "3.5]", "Nhxf3+", "N6xd4+", "Nbxa5", "Rexe8", "R7c2", "Ncxb7", "4.72]", "4.71]", "4.96]", "Rbe1+", "R2xa3+", "Rbb4", "Rbg4", "Rdf5", "Ke2+", "N6h5+", "R5e2", "Rdxg8", "Reg5", "Nfxd6", "Be7#", "Nexc2+", "-1.39]", "N2xd4", "Rab2", "Rff5", "10.38]", "Nh5#", "2.97]", "Rbb5", "Qg6?!", "Kxa6", "gxf8=Q", "Qe6??", "2.65]", "R2b6", "Rhd5", "-3.29]", "Raf3", "Qxc7?!", "Ncxb3", "Rxd7#", "Rxg1?!", "exf4?", "a1=Q+", "Nfe6+", "gxf4??", "-3.07]", "Qxf4?", "R7g2", "1.8]", "Rah5", "a8=Q+", "Nbd2?", "Qc4?!", "3.06]", "3.27]", "Nbc1", "-8.26]", "3.0]", "3.11]", "Ke7??", "R5a7", "h3#", "Ned7+", "2.18]", "Nfxe4+", "N6e5+", "N3xc4", "-3.62]", "2.3]", "2.2]", "c5#", "-2.55]", "Rhd8+", "Ngf2+", "6.83]", "6.84]", "8.03]", "Rhc1+", "Rbxc6", "Nbxc2+", "Nxe4??", "Nxe3#", "Rcxe8", "Reb7", "a4#", "Rge1+", "R1e2+", "b1=Q+", "-1.83]", "-1.63]", "Rfxe4", "-2.95]", "-3.66]", "Q8xh7", "Qxd6?!", "N5xh3", "Bxf7+?!", "Nfg2", "a2+", "bxa5+", "N1e3", "Rh5#", "R4f7", "-1.45]", "3.66]", "N2xe4+", "R4d6", "Rge7", "Rdxg1", "Raxa8", "Ngxh4", "Ke7?", "Ke7?!", "6.72]", "Qd6??", "Rfxg7", "Rgxg6+", "Rdxe6", "Qg4?", "Ndxf2+", "axb8=Q", "Rdg4", "Rfxb8", "Bf3?!", "-5.45]", "N2xg4", "2.47]", "Rcd1+", "Bxc6+?!", "b8=Q", "-2.39]", "-6.52]", "2.74]", "2.66]", "6.77]", "6.66]", "2.04]", "N3c5+", "Rbxc2", "Bxa6#", "R3b2", "Ndxc3", "Nce7?", "Ne2?", "-1.9]", "exf3??", "4.63]", "Rbxe4", "cxd8=N+", "Rgd2", "Nfxe2", "h7#", "Rexa6", "Nexg2", "b5??", "Rhe3", "Rgb3", "R3b5", "Nde5+", "2.02]", "Rcb2", "Rad1#", "Rgxe4", "Qe6?!", "2.05]", "Bb2?", "d5#", "Nb3#", "Nxg7#", "R4c5", "Rdxe3", "Kxf6+", "Rdxd5", "Rba3", "Ndxb6", "-2.09]", "-1.91]", "Nbxd4+", "R5e6", "N2xe4", "Rg1?!", "Ra6?", "2.12]", "Rfxe6", "5.54]", "5.64]", "-3.27]", "Bxe3#", "N6f5+", "Rxc7#", "-1.81]", "Bxg7#", "N4xc3", "-2.91]", "N3f5", "Rfxd6", "-3.4]", "-10.44]", "Ref4", "Qhxf8+", "Rch1", "R7d2", "Nc5??", "Rca2", "Nxg1#", "R3f6", "Nh7#", "Ng8+", "Qxd4??", "9.79]", "9.74]", "Rba6", "Rch8", "b1=Q", "4.57]", "Ned5+", "Rfh3", "Rdc4", "R3f7", "Kxd6+", "Ne6#", "-1.6]", "bxc1=Q", "Raxa5", "Rcxc6", "Bxe4#", "Nge7?", "Qb3?", "-2.29]", "Rxd8#", "Ngf4#", "e6#", "Rbe2", "Bb6#", "Rcd5", "Rcxc2", "Nxc4?", "N7d5+", "Rbxb5", "4.84]", "Bd4?", "Rc8#", "Bh4+?", "R6e2", "R4g3", "Rc5#", "N5xf6", "Ne1#", "2.89]", "Qfxf3+", "3.18]", "3.07]", "Nhxg4+", "R6xd3", "-4.84]", "Nxe5??", "Nxa3+", "N3g4", "Nhg4+", "Rdxa7", "Rce5", "10.65]", "10.64]", "4.29]", "-2.4]", "-2.19]", "g4??", "Bc3#", "Raxb4", "-1.88]", "R5h2", "-1.84]", "Nexd4+", "8.36]", "8.35]", "R1d4", "-1.96]", "gxf6?!", "3.02]", "2.83]", "4.53]", "Kd2+", "fxe8=Q", "R4c6", "Rhxe8+", "Ndc4+", "Reh8", "Ba6?", "2.21]", "f1=Q+", "7.58]", "7.64]", "-4.11]", "Qd7??", "Bd8??", "Qxc7?", "Qxe4+?!", "2.39]", "Raxb5", "Raxa2", "cxb6?!", "Qc2?", "R5f4", "Rab4", "Rfh1", "Rgh4", "N7e5+", "Naxc8", "N4xa5", "Rdxg7", "2.41]", "3.03]", "Kd1??", "N6xd5", "Rxa7#", "Rfe6", "Kf2?", "Rf4#", "exd4?", "R8d2", "3.6]", "N7xh5", "6.86]", "6.82]", "7.02]", "6.95]", "Rbd8+", "dxc6?!", "Qcd1", "Qhg4+", "Nf2?", "Nb8+", "2.06]", "Nxf7?!", "Rcxc7+", "Rfxd3", "Ba4#", "R8h3+", "Bxh4#", "Rh3?!", "Bf6?", "Nba7+", "Qc7?", "bxa1=Q#", "Rfxf5", "-2.8]", "Qf5?!", "Bh7#", "N4a5", "Nfxh4", "R7d4", "Ncxa5", "R1xe3", "R5e3", "N6b4", "Rxa1#", "Ndxc7+", "Rexe3", "Rea4", "gxh5?!", "-1.89]", "Rxb2#", "gxf3?", "bxc8=Q", "N7e6", "Nbd7+", "N3d5+", "-3.43]", "7.42]", "7.43]", "7.46]", "7.31]", "cxd5?", "R3c7", "Nhxf8", "cxd8=B", "Bd7#", "Rexc4", "Bh6?", "Kd3+", "Nec5#", "Rda4", "Qbb5", "N4a5+", "Rexb1", "-2.17]", "Rxe6#", "axb6+", "Rbxe8", "Qb5??", "11.17]", "Nf5??", "R8a2+", "N6xc5", "2.67]", "Qf4?!", "Rxb1#", "Ra7#", "6.44]", "R1c2", "Kg3?", "Nhxf7", "Rfe5", "Be6??", "8.28]", "hxg8=Q", "Rdxc3", "h4?", "Rdxd1+", "1.49]", "Rhxh7#", "Nb4??", "-2.82]", "N5xc6", "Qxe4#", "N4g3+", "Qe7??", "-2.76]", "2.07]", "dxe3?!", "Qxb2?!", "Rdxe2", "2.54]", "Raxd7+", "10.36]", "Nd2??", "Raxa4", "Bxe5?!", "h1=N", "Nh4#", "-6.19]", "-6.2]", "-6.57]", "Raf8+", "Raxa6", "Rgb1", "-2.89]", "b5#", "1.96]", "N2xc4", "Rhf6", "Nxa5+", "Qxd6?", "Rdh6", "-2.24]", "f5#", "Bxe4??", "3.69]", "Bb2#", "Kb1+", "3.8]", "3.08]", "f2#", "Reh4", "Ncxe8", "-2.9]", "R8xd5", "R8a5", "-1.65]", "Rxg6#", "Bc7#", "Qb5+?!", "Nfxh5", "Rh3?", "f4??", "-18.28]", "R7f6+", "N2a4", "Bxa3#", "b4#", "Rhd2", "Qf4?", "Nxb4?", "-3.44]", "-3.52]", "Ngh8", "-2.28]", "-3.22]", "7.11]", "7.2]", "7.18]", "Bxh8?!", "6.61]", "Bxc6#", "Qxe5?!", "Rexe3+", "Ncxe5+", "Ngxh7+", "Qg6??", "Ndxc2+", "-4.31]", "Rcxf8", "Bf3??", "Rdd5", "d8=Q+", "Bxg5?", "N3xf4", "N6g5+", "Rhg6", "Bd2#", "gxf8=R+", "Qc1?!", "Ndxb4+", "Qxa8#", "R3f5", "2.29]", "2.11]", "Rdg5", "axb4+", "fxe6#", "N4xf3", "Ndxb2", "2.55]", "2.6]", "Rbc6", "h6#", "R1e7", "N6xg5", "R4d2", "cxd4?", "Rgf6", "Raf2", "Nexg5+", "3.48]", "Qf5?", "-2.84]", "R5xb6", "Nbd1", "Ndf3?!", "Rac2", "Rxg7#", "Rfb1+", "Rda8", "Nce7?!", "Rcxa2", "-3.97]", "Bd7??", "R8c6", "R2c7", "2.49]", "5.23]", "5.06]", "Bxg2#", "Nge5+", "2.15]", "Qc6#", "-3.47]", "-4.1]", "Be1+", "-1.66]", "Rcd8+", "Rhg7", "Rgxd8", "Rexb2", "Rb4+", "-1.64]", "N1d3", "N2f4", "5.1]", "Bxc6?", "R1d7", "Rg3#", "Rexd4", "-4.67]", "6.62]", "Reb8+", "-2.34]", "Ref3", "Rxh4?!", "1.89]", "Qxc5??", "-10.06]", "-9.91]", "-12.57]", "Nfd2?", "c7?", "Rexd2", "Nfxd5+", "N6xa5", "Qxd4?", "exf7#", "Rfg2", "Nxh2#", "N2b4", "Bb2??", "-5.0]", "Bf6??", "-1.41]", "-2.42]", "3.94]", "4.14]", "3.62]", "-3.28]", "-4.04]", "Qg6?", "Qxf7+??", "-8.72]", "-8.74]", "-8.82]", "Ndb4+", "-4.3]", "Bf8+", "Ned8", "Ngxf5+", "Rdg2+", "-3.45]", "Bg2#", "exd5?", "Rxe5#", "R5g7", "3.85]", "1.88]", "#-3]", "Nbc6?!", "2.01]", "c2?!", "Qb6#", "N4f5+", "2.8]", "bxc5?!", "Qh6?!", "Ndxf1", "c1=Q", "Nf2??", "Re6?!", "1.97]", "Kf3+", "R7c6", "Nhg6+", "b8=Q+", "Qfxf7+", "Rdc3", "Ba5?", "Raxd2", "Rxb4+", "Nexc4+", "Nfe5+", "2.32]", "2.19]", "2.22]", "Rcxb7", "R3xf4", "Rcxd3", "N7e5", "Nfg3#", "-3.05]", "-3.1]", "-3.33]", "Rdxd2", "N3xe5", "Bh6?!", "R2c3+", "-1.7]", "Bxf4#", "Rgh5", "7.53]", "N4xf5", "5.22]", "-10.18]", "Nbd2??", "-2.86]", "Rxc2#", "axb1=Q", "Nac7+", "7.3]", "7.16]", "7.96]", "Bxh8?", "6.52]", "Nf5?", "R8xh5", "Bxg8?!", "Bg3?!", "Rab3", "Rce1+", "Nexc6+", "3.82]", "3.81]", "N3xe5+", "-4.81]", "N4e3+", "Nxc7+?", "1.58]", "a3#", "Qxe5+??", "-9.05]", "Ba5??", "Nhxf1", "Rhh3", "fxe4??", "4.44]", "exf4??", "R3f4", "3.35]", "Rhh5", "N7xd6", "2.59]", "Rfxf6", "Bd4?!", "e4#", "Ndc3+", "Rhxd6", "-7.17]", "N5h4#", "Nac4+", "Bxd4#", "exd3?!", "Rfxd2+", "Ncxb6", "R1e3", "-1.54]", "Nexc8", "Rhxe6", "Rdxc1", "N7xd5", "Qe4+?", "Bd2??", "Rhxc3", "Nbxa4", "cxd8=Q", "N1f2", "Qxf4#", "Rc1#", "6.22]", "6.31]", "Na4#", "R7g6", "Bxd5?", "4.73]", "Reb4", "R1f3", "Nfxg2+", "Ref7", "N6xe4", "Bxc4??", "Raa6", "R1xf5", "Ba5#", "2.38]", "2.14]", "N7g6+", "R4f3", "Neg4?!", "2.84]", "Rfg7", "N3b5", "3.32]", "3.23]", "-3.72]", "3.12]", "R8xe3", "1.66]", "Ngf3+", "-3.55]", "Rb7#", "dxc1=N", "Rbc3"]}