{"vocab": ["<PAD>", "<UNK>", "{", "[%eval", "}", "O-O", "Nf3", "e4", "d4", "Nf6", "d5", "e5", "Nc3", "Nc6", "c5", "e6", "c4", "d6", "f4", "c6", "c3", "g6", "h3", "Be7", "a6", "h6", "b5", "Bd3", "f5", "b4", "exd5", "Be3", "Bg5", "a3", "e3", "d3", "Ne5", "Bc4", "Be2", "g3", "cxd4", "Ne4", "b6", "a4", "a5", "Bg7", "Bg4", "b3", "Nd5", "Nxe5", "Re1", "g4", "Nxd4", "h4", "Bd6", "dxe5", "f6", "h5", "g5", "Nd7", "1...", "2...", "3...", "4...", "5...", "Bd7", "cxd5", "f3", "O-O-O", "Bb7", "Nxe4", "Be6", "Re8", "Bf4", "Qe2", "Nd4", "Qc7", "Nd2", "Qd2", "Bd2", "Bxf6", "Nxd5", "Qe7", "exd4", "Bf5", "Bc5", "Bg2", "Ne7", "Bxf3", "dxe4", "Bb5", "Qc2", "Qd7", "Rc8", "Ne2", "Qf3", "Bb2", "Ng5", "Bb4", "Nf5", "Rc1", "Nbd7", "Qb6", "Nc5", "Rd8", "Qf6", "Rd1", "Nc4", "Bxe5", "Kh1", "Qd3", "Ng4", "Rb8", "Nbd2", "Nf4", "Bxe4", "Qxd5", "Kh8", "Qxd4", "Rb1", "Rad1", "fxe5", "Kg7", "Qb3", "bxc3", "Bb3", "Bxd5", "bxc6", "dxc4", "Bxc6", "Bf6", "Qd6", "Kg2", "Kf7", "Ke7", "Bxd4", "Nb6", "Ng3", "Ng6", "Nb5", "Rad8", "Rf8", "Kf8", "dxc5", "Bxc3", "Bxc4", "Kf2", "Qg4", "Nh5", "Qe3", "Rf1", "Nb4", "Bg3", "Qxf3", "Bf3", "Kf1", "Nxc6", "Qg3", "exf5", "Qg5", "Ke2", "Qh5", "fxe4", "Bh4", "Kh2", "axb5", "Rfe1", "Qa5", "Kd7", "Nh4", "Bg6", "Bxc5", "Qxf6", "Kh7", "Nb3", "Rg8", "Qd8", "Bc6", "Bh6", "Be4", "Rd2", "Rd7", "Bd5", "exf4", "Bd4", "Na5", "axb4", "Ne3", "Bxf4", "Qh4", "Ba6", "Be5", "Bxf5", "Rac8", "Nxc3", "Rfe8", "Qg6", "Rac1", "Re2", "Rg1", "Bh5", "Qxe5", "Nd6", "gxf6", "fxe6", "Bb6", "bxc4", "Kg8", "gxf3", "Ne6", "Qf4", "Qe6", "Rxd8", "Qxe4", "Qxd3", "Na4", "Bc2", "0.18]", "Re7", "Qxd6", "Kd2", "Nd3", "Qc6", "Bc3", "Rae1", "bxc5", "0.17]", "Rxd1", "0.2]", "0.22]", "hxg5", "Bxd6", "Qd1", "0.24]", "Qd5", "Bxe6", "Kb1", "Rfd1", "0.15]", "Qf5", "Rf7", "0.25]", "Nxc4", "Bxe7", "hxg6", "Rae8", "exf6", "Qc3", "Rfd8", "Bb5+", "Bxg5", "hxg4", "Qa4", "Qd4", "Kb8", "Kg1", "0.27]", "Rf2", "Qe4", "Bxd3", "Rc7", "Nh6", "Na6", "0.13]", "Na3", "0.29]", "Rc2", "Qf2", "Nxc5", "Ba3", "Qxe7", "Nxf6", "Qe5", "Bh3", "Kc7", "fxe3", "0.0]", "Rxe5", "Nxd7", "gxf5", "Ra8", "Re3", "Ba4", "Nxe3", "0.31]", "Rxe4", "Rf3", "Nge7", "Nxe6", "Qf7", "Qc5", "0.12]", "dxc6", "Rd3", "Rxd4", "Qc4", "Nxf6+", "Bb4+", "cxb5", "fxg6", "Qxc4", "Qb4", "Bxe2", "Qe8", "Kd8", "Qxb2", "Rxd5", "Rab1", "Qxc3", "Nxf4", "Bxg4", "exd6", "Ra1", "Bxg7", "Ke8", "Qb5", "Bxe3", "Nh3", "Qe1", "Nxf5", "axb3", "0.16]", "Qc8", "Nxf3+", "0.32]", "0.19]", "Rd6", "Qxg5", "Nc7", "Rxe8", "Qxd7", "Bf8", "Bxb5", "Qxc6", "0.21]", "hxg3", "Nxf3", "Nge2", "Bxh6", "0.23]", "Re6", "cxb4", "Kc2", "0.26]", "Nxg5", "Rab8", "Qh3", "Qxc5", "Qxe2", "Kf6", "Rf6", "0.1]", "gxf4", "Qxb7", "Qxf4", "Bc7", "Kxg7", "Bc8", "cxd6", "0.14]", "Qb7", "Rxf6", "Nxg4", "Rxe1", "0.34]", "Rxd6", "Nc2", "Rxe6", "Rxf7", "Ke6", "0.28]", "dxc3", "Qh6", "axb6", "Nxd2", "Qxg4", "Nxd3", "Nh2", "Bxc3+", "Rxc1", "Ke3", "Rxf3", "Qxf5", "Rxb2", "Kg6", "Rh8", "Bxb4", "Qc1", "Rxc8", "Bxb2", "Kf3", "Rxd3", "Kd1", "cxd3", "Kxf7", "Qxd2", "Nxd6", "Ra7", "0.3]", "Bf2", "Rxb7", "Qxe3", "fxg3", "Bxc6+", "Ba5", "Kg3", "Rxf2", "Rxd7", "0.08]", "Nxb5", "Rxf5", "Rxe3", "Rxf4", "Qxe6", "dxe6", "Rg3", "Re4", "Rd5", "Kd6", "Qb2", "Rd4", "Bxh3", "Re5", "Bc1", "Rxe7", "0.36]", "Rh1", "Rxc3", "fxg5", "Bf1", "Rfc8", "Bxb7", "Rxd2", "Ngf6", "Bxg2", "Nh7", "Qh5+", "Ke1", "exf3", "Ra2", "Nxg6", "0.37]", "0.06]", "0.05]", "0.11]", "Rxc6", "Ne8", "Qg7", "Nxf7", "Rxc2", "Rf4", "Rb7", "Rf5", "Bxd7+", "Rc6", "Rxa2", "fxg4", "Nf8", "Nf7", "Nf1", "0.33]", "Kd3", "Qa5+", "Bxa6", "Rxf8", "Rc3", "Rg6", "Rxe2", "Rxc7", "Kxd8", "Rfc1", "Nxb4", "Rxc4", "Bxg6", "Rxa1", "Rb2", "Kc8", "0.07]", "Qxc2", "Ba2", "Nxe7", "Nxg3", "0.03]", "Qxd8+", "Bxd7", "Rxd8+", "Kxg2", "Kb7", "Bxf8", "Qg2", "Rc4", "Rxf1", "Qa3", "Rxa7", "Re1+", "Qa6", "Qa4+", "Rxe1+", "0.39]", "gxh6", "Rxa8", "Rxd1+", "Rxe8+", "Bxf7+", "Qxb5", "Rc5", "0.01]", "Qxa2", "Rxc5", "Bf7", "Rhe1", "Qxc7", "Nfd7", "Qxb4", "0.09]", "Rb3", "Rh3", "Rb6", "Kc6", "Qh4+", "0.41]", "0.35]", "Qxd8", "Bxd2", "Nf2", "Bxf1", "Nxb3", "Bxg3", "Qxd1+", "cxb3", "gxh5", "Kxf2", "Ne1", "Nb8", "Qxb6", "Qb8", "Qxa7", "Ngf3", "Kb2", "Qxd1", "0.43]", "Nf6+", "Bxa3", "Rg7", "Re8+", "-0.01]", "-0.03]", "gxh3", "Kxd1", "Rhe8", "Qe6+", "Rxf1+", "Rxa6", "Qxb3", "Kc1", "Rxf8+", "Ra3", "Rd1+", "0.44]", "Bxd8", "Qxh4", "Bb1", "Nxe2", "Bxd2+", "Qxh5", "Rg2", "bxa4", "-0.05]", "Rg4", "Qf8", "0.46]", "Kxf8", "0.48]", "0.38]", "Qxh6", "0.5]", "Rg5", "Qe5+", "Bxa1", "cxb6", "Bxa8", "Qd4+", "Rb4", "Ra6", "Raf1", "Rh4", "bxa5", "Rh6", "Kxf1", "Bd8", "Nxf2", "Qg5+", "Be8", "Bxd1", "Nxb6", "-0.06]", "Qxg6", "Rh5", "Kh6", "Nd6+", "Qg4+", "0.51]", "Rh7", "Raf8", "Qb1", "Rde1", "Qxf7", "0.04]", "0.53]", "Qxe6+", "-0.08]", "Nxh4", "Nf3+", "Rd8+", "Bxc7", "Bc5+", "0.02]", "Nb1", "Qxg7", "Qd5+", "Bxc2", "Qe4+", "Ra5", "Bxh4", "Qe3+", "Ne2+", "Rxa4", "Qc5+", "0.55]", "Qf1", "Qxh3", "Bd1", "Bxb6", "Kb6", "Qxg3", "Kc3", "Rxa3", "Bxb3", "Rb5", "Ra4", "Bh2", "Rh2", "Nxf8", "0.56]", "Qxe5+", "Bxf2+", "0.4]", "Qxa6", "Qxf2", "Ne7+", "gxh4", "Rxa5", "Nxh5", "Rxb1", "Qxa8", "Rhf8", "Rxb8", "-0.1]", "exd3", "dxe3", "Nxc2", "Kh3", "Nbc6", "Kxd7", "Rhg1", "Nxd8", "bxa3", "Nxd1", "0.58]", "bxa6", "Qb6+", "Qxa5", "Nxe7+", "Ng8", "-0.12]", "Rde8", "Rhg8", "Nxb7", "Qxa4", "Nd1", "Qxg2", "Nxf1", "Kxe7", "Qa7", "Qxa3", "Ba7", "Qb5+", "Nxb2", "Qf4+", "-0.13]", "Nxc7", "0.42]", "-0.02]", "0.6]", "Rxg7", "Rxb4", "Nd8", "Qxa1", "Nxa8", "Qxe4+", "Bxh5", "-0.07]", "Qxe3+", "Rxb5", "Be1", "Bxa7", "Red1", "Rhf1", "-0.15]", "Qf5+", "Rhd1", "Qxf7+", "-0.04]", "0.45]", "Ndf3", "0.62]", "Rhd8", "-0.17]", "Rxh5", "Qc4+", "Nc8", "Bxf7", "0.63]", "Qxd4+", "Kf5", "Qe2+", "Kb3", "Nfd2", "0.47]", "Rxh7", "Nd3+", "Bc4+", "Qb4+", "Bxa4", "Nce7", "-0.18]", "Rxb6", "Bh7", "Bxa2", "Rxb3", "Rxh6", "Rxg2", "Qxf2+", "Nxa1", "Kxd2", "Bxc1", "0.49]", "Nxd3+", "Qxe8", "Nbc3", "Nxe2+", "Kxe2", "Bd4+", "Rfb8", "Ng1", "Rxh8", "-0.2]", "Rxh4", "Ng7", "Rxg5", "Qa2", "Nb7", "Nxd6+", "0.52]", "Nce2", "0.65]", "Qf3+", "Ndf6", "Kf4", "Ne5+", "-0.22]", "Bxc8", "Rfb1", "Rcd8", "Qxe2+", "0.54]", "Nxc8", "Qxe7+", "Rxg4", "Rxh3", "-0.09]", "Rcd1", "Qxf8", "Nxa4", "Bxf2", "Qg6+", "Kg5", "Nxa6", "Qg3+", "Qxe1", "-0.24]", "Red8", "Ng5+", "Na7", "Bg5+", "0.57]", "Qe7+", "Rxh1", "Nxg7", "-0.25]", "Bxa5", "Ke5", "Qxd5+", "Rxh2", "Nb2", "-0.11]", "Qf6+", "Nc1", "Ne4+", "0.68]", "Qxc8", "Qxh7", "Nxa5", "Kg4", "Qb3+", "-0.27]", "0.59]", "Rc1+", "Kxh7", "Bxh8", "Nxe8", "Bxe6+", "Nxc1", "Nxe1", "Qh2", "0.67]", "Qh7", "Qxd7+", "Qxf1", "Ke4", "Bb8", "Rxg6", "0.61]", "Qxc1", "Bxd4+", "Qc6+", "-0.29]", "Rdf1", "Bxh7+", "Nd5+", "Nf4+", "Nxh8", "-0.14]", "Nf5+", "Qxd2+", "Bxe3+", "Rdf8", "Ka7", "Kd5", "-0.16]", "Ng2", "Qh6+", "Rxc1+", "Ka8", "Qxh2", "Rxg8", "Kc5", "Rf1+", "Kxf6", "Rxg3", "Kd4", "Qxc6+", "e5?!", "Rxc8+", "-0.19]", "Rc8+", "Rdg1", "Nxa3", "Qxg6+", "Na2", "Rd7+", "Nxg2", "Bxe1", "Ng4+", "Ka1", "Nd4+", "-0.32]", "Qc3+", "Nf2+", "Qh3+", "Rf8+", "Bd5+", "-0.31]", "Bg4+", "Qd3+", "Nf7+", "0.7]", "Bxe8", "Rbc8", "Nxh6", "Nc7+", "Rd2+", "Bxh1", "Qc1+", "f4?!", "Rdg8", "Nxh7", "Qxc3+", "Be3+", "Ne6+", "0.64]", "Qa1+", "Kc4", "Bxh2+", "Qf7+", "-0.21]", "Rbd8", "Rbd1", "Kxh2", "-0.34]", "Bxb8", "Qa8+", "0.72]", "Nxa7", "Be6+", "Qxh8", "Qd6+", "Qa8", "Re7+", "Kxf3", "-0.23]", "Qh1+", "Bf4+", "Rbc1", "Ne3+", "Bxb1", "Rg8+", "Qe1+", "Nxa2", "Qxg3+", "Rxg2+", "Qh8+", "Bxd5+", "Qxg5+", "-0.36]", "Rxg1", "Re2+", "-0.26]", "0.66]", "Rg1+", "Ka2", "-0.37]", "Kxe8", "Qxg4+", "Qe8+", "Qxg7+", "Kxe6", "0.74]", "0.75]", "-0.28]", "Qxf6+", "Bh4+", "Qf2+", "Rxg7+", "Nce4", "Bf5+", "Qd1+", "Nbd5", "Kxe1", "Qh7+", "Rxf7+", "-0.41]", "Nce5", "Bxf6+", "Nxh2", "Qg8", "Qxf3+", "Qa1", "d7", "d5?!", "Nxc7+", "Ba8", "Qb1+", "Kb5", "Ra1+", "-0.39]", "Nc2+", "Nxh3", "-0.3]", "Qxg2+", "0.77]", "Rce8", "Rxf2+", "Kh5", "Bc4?!", "Kxd6", "-0.43]", "Rb1+", "g6?!", "Qxe8+", "Bxf3+", "Bxh7", "Qxh7+", "Qd8+", "Qc8+", "Qxe1+", "Ka6", "Rec1", "Qc7+", "Kh4", "Qxh1", "Nxc2+", "Ng6+", "Nh6+", "Kxc7", "0.69]", "Rc2+", "Rxe7+", "Ng3+", "Rh1+", "Rb8+", "Ra8+", "Qg1", "Rce1", "Kb4", "0.79]", "Kxe3", "Rf7+", "Nxh1", "Qxf4+", "Qxc5+", "d2", "-0.44]", "Qxb8", "0.71]", "Be5+", "Qb8+", "Qc2+", "Bh5+", "Rag8", "-0.33]", "Rc7+", "Qh2+", "O-O-O+", "Rh8+", "Kxb7", "-0.46]", "Bh6+", "e7", "Rbe1", "Nc3?!", "Raxd1", "Nh3+", "Nc5+", "Nfd5", "Rf2+", "Qxf8+", "Rbe8", "-0.48]", "Nc4+", "Raxd8", "0.81]", "Bh8", "Rec8", "0.84]", "Rag1", "Qd7+", "Bxg8", "0.82]", "Qxb1", "-0.51]", "Rxe2+", "-0.35]", "Qd2+", "Bxb5+", "d3?!", "Qxh2+", "Ncxe5", "Nxh3+", "Bxh2", "-0.5]", "Nxe6+", "Nbd4", "0.73]", "Kxd3", "Qxf5+", "Rhc8", "Kxb2", "0.86]", "Nc6?!", "Kxc2", "Nge5", "Qb2+", "Nc6+", "Qxf1+", "Nxe5+", "d6?!", "Nf3?!", "exf7+", "0.87]", "Qb7+", "Kxg6", "Nge4", "Ba1", "-0.38]", "Bd6+", "Nfd4", "Qa3+", "Kxg3", "Qg7+", "Qg2+", "Be4+", "Nf6?!", "Nxb8", "Nxf7+", "Ka3", "0.76]", "Nde5", "Qxc4+", "Qa6+", "Ngxe5", "Rdc8", "-0.42]", "Rxe6+", "Nxb1", "Qf1+", "Rxd7+", "e2", "-0.53]", "Nc3+", "0.78]", "Qxc7+", "Nec6", "Bg6+", "Rdc1", "-0.4]", "Kxc6", "Nxh6+", "Bh3+", "Qf3?!", "fxg7", "Bg1", "Nde4", "Ba6+", "f6?!", "c2", "-0.45]", "Qxc2+", "0.89]", "Rg7+", "Rg3+", "Rxe5+", "Kxe5", "f3?!", "Bxc5+", "Ba3+", "Qxb5+", "Ree1", "Qg8+", "-0.55]", "Qxh3+", "Qxa8+", "Rxc2+", "Rg2+", "0.8]", "Ncxe4", "Nxe3+", "Ndb5", "Qxb2+", "0.91]", "Ndxe5", "Qxa1+", "c3?!", "c5?!", "Rfa8", "Qg1+", "Neg5", "Rxd2+", "e4?!", "d4?!", "Bd3+", "exf6+", "Qxb4+", "Qxd6+", "Rd6+", "Bh7+", "Qxb7+", "Rhc1", "Bc6+", "-0.58]", "Bxg2+", "Bxg6+", "Rh2+", "Bxb4+", "-0.49]", "0.93]", "Qxh6+", "cxb2", "Qxc1+", "Rfa1", "c7", "Rdd7", "0.83]", "Rxc7+", "Rdd1", "-0.47]", "Ka5", "Nbxd2", "g3?!", "Bxg7+", "Rh7+", "Nbxd7", "Bxe5+", "c4?!", "Qxd3+", "Nd7+", "Bxf4+", "Qh8", "Rxg6+", "Bc3+", "-0.56]", "Qf8+", "Rxg3+", "a7", "Nxe4+", "-0.6]", "Ba4+", "0.94]", "Re6+", "Nhf6", "Nh5+", "f5?!", "Rxe4+", "Bc5?!", "Nxf2+", "Qxh5+", "Nfxd4", "Nd2+", "a2", "Rd3+", "Rdd8", "Neg4", "Nb6+", "Kxg8", "Kxc3", "Kxh6", "Kxe4", "Nxg7+", "0.98]", "Re3+", "Nh4+", "Bxg1", "0.85]", "Nxg8", "c4+", "Nxg6+", "Qxh4+", "Raxc8", "Rb7+", "Bh1", "Qxg8", "Bg8", "Rb2+", "-0.52]", "Ref8", "Bh2+", "-0.62]", "Qxc8+", "Rxb1+", "-0.54]", "Nb5+", "Rdh1", "Nec3", "b4?!", "e6?!", "N7f6", "1.0]", "Bg3+", "Ned5", "Rxg8+", "Rxb8+", "Kxf4", "Qh1", "Rdd2", "0.96]", "Reb1", "Qf6?!", "f5+", "Bxg3+", "Rg6+", "Ref1", "Nxd5+", "Ngxe4", "Rg4+", "Rdh8", "Bxf5+", "Nef6", "Qxh8+", "-0.63]", "Rg5+", "Nxc6+", "0.88]", "Nxc3+", "Bxe4+", "Rxg1+", "Ree7", "Ned4", "Rf3+", "Kxh3", "Raxc1", "Bxb7+", "Rfxd8", "g5+", "Nxf5+", "Rff1", "Ree2", "Ree8", "Bxd6+", "fxg2", "d6+", "Rxe3+", "Nxg1", "Nb3+", "dxe7", "Ncd7", "Nxf4+", "Kxh8", "1.03]", "Bxc4+", "0.92]", "Rxb2+", "1.01]", "Kxf5", "Nfe5", "c6?!", "c5+", "Ka4", "Ned7", "e6+", "Nhf3", "Rxh7+", "Kxc8", "f4+", "N2f3", "-0.67]", "Nb4+", "Nfe4", "cxb7", "exf2+", "-0.65]", "Qa7+", "1.05]", "Ndxe4", "f6+", "Kxg1", "-0.7]", "Bxe7+", "Bf6+", "0.9]", "Rxf6+", "Rxh2+", "Rf6+", "Bb6+", "Nxa7+", "Ra7+", "g4+", "b6?!", "Rfxd1", "1.13]", "Ra2+", "Rxd6+", "-0.68]", "1.06]", "Kxg4", "Nf3?", "Nxg3+", "N8d7", "Bxg5+", "Nxd4+", "Bf7+", "Rxb7+", "Rff8", "e5+", "-0.74]", "Qxg8+", "1.08]", "Bg5?!", "Nde2", "d3+", "e5?", "Kxd5", "Ncd5", "Bxb2+", "Kxg5", "O-O?!", "-0.57]", "Qxh1+", "Kxc5", "Qa2+", "b2", "-0.72]", "dxc7", "Qxg1+", "Bf3+", "1.1]", "Bb3+", "Rcc2", "Nbxd5", "-0.59]", "Raa8", "Rcc8", "Rxg4+", "Rhb8", "Nfg5", "h6?!", "Kxd4", "Nxb3+", "Nef3", "Nxa2+", "1.15]", "Bxd3+", "gxf7+", "Rxg5+", "Rad1+", "Rcf8", "0.95]", "Rxf3+", "Ncd2", "Re4+", "Nfxd5", "Reb8", "Rcc7", "e3?!", "d4+", "-0.75]", "Rfe1+", "Kxc4", "Rd5+", "1.17]", "Kxc1", "Nh8", "Re5+", "Rxd3+", "Ncd4", "Rh3+", "Qxa7+", "Qxa2+", "Nxg2+", "1.12]", "0.97]", "Rf5+", "Raa1", "Rgf8", "Ba5+", "Rcc1", "hxg7", "-0.61]", "b3?!", "Rf4+", "-0.81]", "d4?", "Bxg4+", "d5+", "hxg6+", "-0.77]", "Nbxd4", "e4+", "hxg2", "b7", "Rc3+", "Qxb8+", "Qxb1+", "h6+", "Bg4?!", "exf3+", "Bd3?!", "a6?!", "Rah8", "Nexd4", "-0.84]", "Rbb8", "Bxe2+", "1.02]", "-0.87]", "gxh7+", "Rcf1", "0.99]", "Rd4+", "Ned2", "f3+", "-0.79]", "Qe2?!", "-0.66]", "Rc6+", "Rxa8+", "dxc2", "Rxc3+", "Rah1", "Bf2+", "b5?!", "Qxg1", "1.24]", "Nxg4+", "Be3?!", "Rxd5+", "-0.64]", "Rxh3+", "N1d2", "Rge1", "1.27]", "Rxd4+", "h3?!", "Ndb4", "1.04]", "Rbf8", "Rbb1", "f6?", "Kxh1", "Rxc6+", "exd5+", "Nfg4", "Rbf1", "1.2]", "Nxg5+", "1.07]", "g4?!", "Nexd5", "Rhb1", "Nxb6+", "Qe7?!", "1.18]", "-0.69]", "Ng7+", "Rxf5+", "1.22]", "h4+", "-0.86]", "Nh1", "hxg3+", "Red2", "Ncxd4", "Rh6+", "Ng5?!", "R1e2", "N6d7", "Na8", "Ngxe2", "Rgf1", "b5+", "R1d2", "h3+", "f5?", "d5?", "-0.73]", "e3+", "Qxb6+", "R8d7", "Rxh8+", "fxe7", "Rxa1+", "Nxd7+", "fxg6+", "N7b6", "-0.71]", "-0.93]", "Rge8", "Qxa6+", "h5+", "Nxf1+", "exd7", "b4+", "Nc3?", "Rxf4+", "Rfe8+", "g3+", "1.16]", "Nf6?", "1.09]", "a3?!", "1.11]", "Qxa3+", "-0.82]", "1.31]", "-0.89]", "Rxh6+", "Rff7", "Kxa2", "Kxb6", "Ng2+", "Be2?!", "Qh5?!", "Rde2", "-0.94]", "Kxa7", "Be7?!", "Kxb3", "Nhf4", "Rff2", "Rdb8", "1.21]", "d3?", "-0.91]", "1.14]", "gxf6+", "h7", "Rc4+", "Rxa2+", "Rcb1", "1.25]", "fxg3+", "Nhf5", "Nxd2+", "Bf4?!", "Nxf8+", "Rh4+", "f7", "Rc5+", "Rh5+", "Nc6?", "gxh2+", "Rdb1", "dxe2", "Qxb3+", "-0.96]", "g6+", "Nxc4+", "gxf2+", "-0.85]", "Rxa7+", "Bxh6+", "Bd6?!", "Ngxe7", "Nfxe5", "Rxh1+", "Red7", "exd6+", "Kxb5", "1.19]", "Rxc4+", "Kxh4", "Nxc5+", "Nef5", "N5f6", "-0.8]", "Rcb8", "Bb7+", "1.34]", "-0.78]", "Ncb4", "dxc3+", "1.29]", "Rad8+", "R8e7", "Nxe1+", "Nef4", "Nxe8+", "Rde7", "R1f2", "Kxh5", "f3?", "Rb6+", "Bxf7+?", "Nxh7+", "Ndc4", "Ncb5", "Nfe7", "Rgd1", "Kxb4", "dxc6+", "f2", "N1c3", "-0.76]", "fxe5+", "-0.83]", "Bb5?!", "R8f7", "-0.98]", "-1.0]", "Bxh4+", "dxe6+", "1.32]", "Nde7", "fxe4+", "hxg5+", "Ndc5", "-0.92]", "Rgd8", "Nxd8+", "Nxh2+", "Qxa4+", "Ra3+", "Rb3+", "-1.06]", "g7", "Rac1+", "Nac3", "Bf5?!", "-1.01]", "bxc2", "1.28]", "Ne5?!", "h2", "Qf3?", "Nac6", "-1.03]", "1.36]", "Rhe1+", "1.23]", "1.26]", "Na1", "Nfxe4", "-0.88]", "Na4+", "Na5+", "O-O?", "N4f3", "Rfg8", "Nh3?!", "Nac5", "Bd2?!", "h2+", "Rea1", "Rxc5+", "Ndc6", "Rbb7", "Nxc8+", "Bc5?", "exd4+", "1.39]", "a5+", "h7+", "Rae1+", "Bxh3+", "d6?", "N1e2", "Nxd4?!", "-1.05]", "Nac4", "-0.9]", "Rfe7", "1.37]", "dxe5+", "Ra6+", "Nxd1+", "exf5+", "Bd7?!", "exf4+", "Nd4?!", "Bb2+", "hxg4+", "fxe6+", "N1h2", "g6?", "Rbb2", "Rfd2", "exf7", "-1.1]", "h4?!", "Rac8+", "Bg7+", "Ne8+", "Ne1+", "dxe5?!", "d7+", "h5?!", "Be7+", "e4?", "-1.08]", "gxf5+", "axb2", "N3d2", "g4?", "1.41]", "Rxb3+", "c4?", "g5?!", "N8e7", "Bc7+", "Bd2+", "bxa2", "1.35]", "N2b3", "gxf3+", "Rxb6+", "a4+", "Rfe2", "Rcd2", "-0.99]", "Be2+", "Rfg1", "1.43]", "Ncxd5", "c3?", "Rb4+", "f7+", "N2g3", "Bxc7+", "Rxh4+", "axb7", "Qxa5+", "Bc4?", "-0.97]", "-1.15]", "Bxc2+", "Bxh5+", "Nh7+", "Nec4", "e6?", "Ree3", "Reg1", "Bxa3+", "1.48]", "1.3]", "Rxh5+", "Nxd5?!", "g2", "-1.12]", "Rb5+", "Nxh5+", "Ndf5", "Nh2+", "Bd7+", "c5?", "Bxa6+", "Rae8+", "f4?", "Ndf8", "Nxc1+", "fxe2", "Na2+", "Bc2+", "Ndc3", "Bg4?", "a4?!", "Bg2+", "dxe4+", "exd7+", "Kxb8", "Na3+", "b3+", "Rdc2", "-1.02]", "Na7+", "1.46]", "N7c6", "Nxe5?", "N7g6", "Ndf4", "-1.13]", "Raa7", "Rfd1+", "1.44]", "Ne4?!", "-1.18]", "R8c7", "gxf4+", "1.56]", "Nh6?!", "Nec5", "R3e2", "Ref2", "Rcg8", "-0.95]", "Be6?!", "Rhg1+", "bxa7", "1.51]", "c6+", "Nxh4+", "1.53]", "Ndf1", "Reg8", "Nxh8+", "Bb4?!", "Rfd7", "Rea8", "Ne2?!", "1.5]", "cxd7", "Nfe2", "Kxa8", "cxd5+", "cxd4+", "Rhh1", "Rexd1", "e7+", "1.33]", "Rgg8", "1.38]", "Rdd3", "Rhh8", "Rgg1", "1.58]", "Rcd7", "N5c3", "R1c2", "Rfe3", "-1.11]", "e2+", "R3f2", "-1.2]", "bxc7", "Rhe8+", "fxg4+", "exf2", "Nxb7+", "cxb7+", "Bg5?", "-1.04]", "dxc5?!", "b6+", "Nxb2+", "fxg5+", "Rbg8", "Kxa6", "exd3+", "cxb2+", "g5?", "Nd8+", "Nxf7?", "h6?", "Ngxf6", "f2+", "N2c3", "fxg7+", "Nxe5?!", "Ne7?!", "Rcg1", "c3+", "1.55]", "Be3?", "N4c6", "Rhg8+", "Na6+", "Rdc7", "R6f7", "exd2", "Bd3?", "1.65]", "Rec2", "Ref7", "Red3", "Nf8+", "Raa2", "Rdf7", "R1e3", "Nxb5+", "Nb7+", "Rdf2", "exd5?!", "Kxb1", "Ndxf6", "-1.09]", "Ncxe7", "dxc5+", "Be6?", "-1.07]", "1.4]", "Rec7", "Nxd5?", "Qxg2#", "-1.25]", "a3+", "-1.17]", "1.42]", "Ng4?!", "Neg6", "b3?", "h3?", "dxe3+", "Nce3", "R3d2", "Kxa3", "Ngf5", "Qf6?", "Rff3", "1.6]", "Rde3", "Bb5+?!", "-1.24]", "Rhxf8", "Kxa5", "Rcxd8", "bxc6+", "c1=Q", "b6?", "Qb6?!", "Ndxc4", "Qh4?!", "Rbxc8", "Be2?", "d2+", "Nhg4", "Kxa4", "g3?", "1.63]", "-1.22]", "1.67]", "Bg7?!", "Rce7", "Rce2", "gxh7", "Nxb4+", "Nf1+", "Ree6", "Nfxd7", "Bb5?", "dxe4?!", "-1.31]", "Nf3??", "-1.14]", "-1.29]", "Rhxf1", "Rdd6", "gxh6+", "1.52]", "Ndxb5", "bxc3+", "Nac7", "dxc4+", "Qb3?!", "a1=Q", "Bg5??", "fxg2+", "a5?!", "bxc5+", "Rbd7", "Bg4??", "Ng5?", "Rxb4+", "1.62]", "Rha8", "R1d3", "cxd2", "Rexd8", "Ncd6", "fxe3+", "Raxb8", "1.49]", "Nb2+", "R8f6", "R1f3", "cxd6+", "Nfg6", "Raxb1", "Qd2?!", "cxd7+", "hxg2+", "gxh2", "-1.27]", "gxf7", "Qe2?", "cxd2+", "Nbc4", "Rfxf2", "a6+", "Qxd5?!", "Rbc7", "1.45]", "Bxb6+", "-1.43]", "Kxa1", "Rha1", "Nd5?!", "Rfd3", "Rfxe8", "a3?", "N8c6", "Nxe4?", "Ncd3", "Ndxf3", "Rfd8+", "Qe7?", "Rfe6", "Bxf6?!", "1.54]", "cxd3+", "Ra4+", "Rca8", "N3h2", "Rde1+", "Nab5", "Qg2#", "Red6", "axb3+", "N5b6", "exd2+", "Rda1", "N8h7", "e3?", "Rcd3", "d8=Q", "Neg3", "Qa5+?!", "Rgh1", "R6d7", "Rgg2", "bxc4+", "N5c6", "Rxb5+", "Rab8+", "1.66]", "Rfxc1", "N4b3", "Nd4?", "Nfd3", "Rgh8", "dxc4?!", "Nhg5", "Ncxe2", "Nfxd2", "Be7?", "Bxf3?!", "Bxc6?!", "Ngxf7", "c6?", "Rab7", "Rgc8", "d1=Q", "Ndb6", "b4?", "Nd1+", "Bxb3+", "Nde3", "Rcxd1", "Ned6", "Bxa2+", "Nxe4?!", "Rff6", "Nfg3", "Rgf3", "N6d5", "axb2+", "Nce6", "Rfxc8", "1.77]", "1.7]", "1.47]", "hxg7+", "-1.21]", "Ndxe2", "Rac7", "N3h4", "Nbc5", "Bc4??", "Rcc3", "-1.32]", "Ndb8", "a8=Q", "-1.26]", "1.68]", "Bxa7+", "exf8=Q+", "Rde8+", "-1.16]", "-1.28]", "Rfxe1", "Rab1+", "Ncb6", "-1.34]", "Rae7", "Qc7?!", "Rba8", "Raxe8", "e8=Q+", "R1b2", "b5?", "Nge6", "Nge3", "Ref3", "Rfc2", "Nbd3", "Rcf7", "Nc1+", "Rbxc1", "R8g7", "1.74]", "O-O+", "Ra5+", "Ngf4", "-1.37]", "axb6+", "d8=Q+", "Nbxc3", "Bb4+?!", "R8e6", "R1g2", "Rbg1", "Nb5?!", "Nxh1+", "R6e7", "Nf6??", "Qxd4?!", "cxb3+", "Rgc1", "Nab4", "R8b7", "gxh3+", "exd4?!", "Nc3??", "Nexg5", "Rgf6", "Rfc7", "-1.3]", "Ba4?!", "Ncb8", "-1.56]", "c8=Q", "Ndxe7", "e8=Q", "Nexg4", "Rca1", "Ned3", "Nde6", "Bb3?!", "-1.19]", "R8d6", "Na3?!", "cxd4?!", "a6?", "Rxa6+", "Nbd2?!", "Ref6", "axb5+", "N4g3", "1.75]", "1.72]", "-1.33]", "Bd6?", "gxh4+", "Nh3?", "Ndxc5", "1.57]", "cxb5+", "Rbc2", "Red5", "Ne5?", "Rdg8+", "d1=Q+", "-1.51]", "Nbxc6", "Rfxf7", "-1.41]", "1.61]", "gxf2", "exf1=Q+", "N6h5", "Rexe7", "Rda8", "Rfg7", "Rbxd1", "R5e2", "Rbd2", "Bxf2+?", "Rhf8+", "Rxa3+", "Raxe1", "Rbxd8", "Bxf8+", "Qh5?", "1.79]", "Bf5?", "Nfxg4", "Rae2", "Rbe2", "Rcf2", "Raf2", "Nce8", "Ngxf3", "Nc8+", "Nh6?", "Nxd4?", "-1.62]", "Rdd4", "-1.48]", "Qd3?!", "Rad7", "Rdxd7", "Nb4?!", "cxb6+", "axb4+", "exf6?!", "b1=Q", "Rhh7", "1.81]", "Nxa3+", "N5e4", "Bb7?!", "Bxa4+", "-1.23]", "dxe5?", "Rhf1+", "Rhg3", "Bxf1+", "1.69]", "N5g6", "Qa4+?!", "Nexd2", "Nbd7?!", "Ba6?!", "1.91]", "Rbxb7", "Nge7?!", "Rdg1+", "Qd5?!", "Rac2", "R4f2", "Ndb3", "Ng5??", "Na5?!", "cxd5?!", "Rde4", "R5f7", "Ng4?", "Nba6", "-1.36]", "Nfe6", "R8c6", "cxb4+", "Neg1", "Nexd7", "f6??", "Rfh8", "Nbd6", "Rhg6", "Bf1+", "N5a3", "Qb3?", "-1.39]", "Rcd6", "e1=Q+", "-1.44]", "R5e3", "-1.46]", "-1.5]", "Rhg7", "Rbe7", "1.73]", "Rde6", "Bxc6+?!", "Qd7?!", "Bf4?", "Rba1", "Nd5?", "d4??", "N1f3", "Bf8+", "Ref5", "Nxf2?", "1.87]", "Rch8", "Rce6", "R2d3", "Nb4?", "Qd6?!", "Rge3", "R1d4", "Rcc6", "Ngf8", "Nd7?!", "-1.49]", "Qc2?!", "Rdf6", "1.64]", "-1.68]", "Rhg2", "1.93]", "Nxa6+", "Rff5", "Raf7", "1.8]", "Rfg3", "Qh5+?!", "Rhf3", "Nfe3", "Rad2", "1.84]", "-1.72]", "Rec6", "Nxg8+", "Rgg7", "Rgf7", "R1d5", "1.59]", "Ncxb5", "R4d2", "gxf1=Q+", "Nd2?!", "Ba7+", "Rdd5", "Bg2?!", "-1.45]", "Rfh1", "-1.55]", "Rfe4", "1.82]", "Ng1?!", "N3e4", "R1e4", "Bd2?", "R8d5", "Reh1", "Rab2", "R4e2", "Bg1+", "fxe5?", "Rdc3", "Nfd6", "N6e5", "Red4", "Nac2", "Rab3", "N4d5", "Nexf4", "-1.87]", "-1.77]", "Neg8", "R5d7", "fxe5?!", "Ng3?!", "b8=Q", "Ncb3", "Ndb1", "exf5?!", "Nfxg5", "Nb5?", "Ne4?", "h8=Q", "f3??", "-1.38]", "-2.58]", "a7+", "-1.63]", "Nxa8+", "dxe8=Q+", "1.85]", "Rdf3", "axb7+", "1.94]", "c1=Q+", "Nhxf5", "-1.6]", "Qh4+?!", "Nab6", "Rhh2", "Rcd5", "c7+", "R8e3", "R8c3", "dxc7+", "Rde5", "2.17]", "Qe2+?!", "Rfd6", "1.76]", "bxc7+", "Bb5+?", "Bb2?!", "-1.53]", "N4a6", "R5e7", "Ree4", "-2.25]", "Bc1+", "Bxd8+", "a2+", "R7d6", "R8d4", "Rce3", "a1=Q+", "Naxc4", "Rexd4", "Nge2?!", "Bxe1+", "R4e3", "R1e6", "R4f7", "Bxc3+?!", "-1.89]", "Be8+", "-1.35]", "-1.42]", "Ndxb4", "R5d2", "1.71]", "1.89]", "bxa2+", "-1.65]", "f8=Q+", "e6??", "N3e2", "-1.79]", "R4c7", "Ngh3", "O-O??", "Bd1+", "Nhf7", "Rfc1+", "-1.96]", "e1=Q", "-1.47]", "2.01]", "R6d3", "d5??", "2.08]", "Rcxc7", "Bh4?!", "2.32]", "R1d6", "R1c3", "2.15]", "Reg3", "d6??", "Ngxe6", "Na6?!", "R6c7", "Raxa2", "R3g2", "Bd3??", "Nfh5", "Rgf2", "Be1+", "Nexc4", "Nxa1+", "Qa5?!", "N5f3", "dxe7+", "Raa3", "-1.84]", "bxc2+", "N4e5", "Nfh4", "-1.4]", "Reb2", "Bb4?", "Bxe8+", "dxe6?!", "Rcd4", "Rcb2", "R1e5", "R4f3", "2.72]", "Nxg1+", "Rcb7", "Bb4+?", "Nexc5", "2.31]", "gxf8=Q+", "R5f6", "Ref4", "Nca6", "Nce1", "Rdxd2", "-1.82]", "-2.24]", "-3.22]", "Ndxf7", "-2.1]", "N5d4", "Nc6??", "R5f2", "1.78]", "R6d2", "Bd7?", "-1.81]", "fxe5??", "g2+", "-1.7]", "Rec3", "Ncxb4", "1.96]", "N3d4", "Bxa5+", "-1.54]", "Bg8+", "-3.13]", "Rgh6", "Nhf1", "fxe4?!", "exd8=Q", "N4c3", "Rfe5", "c3??", "-1.86]", "g7+", "Nexc6", "-1.67]", "-2.15]", "Bg7?", "N7xf6", "Nfe8", "c8=Q+", "R2e3", "Nfg8", "N8f6", "Nhf8", "Bc8+", "2.1]", "c2+", "Re1#", "N6e7", "Qf2#", "Nexc3", "R1d7+", "d3??", "Rac6", "Neg5+", "Rexe5", "2.18]", "Bh5?!", "Ng1+", "-3.25]", "2.03]", "Bd8+", "Qf3??", "Bxc4?!", "Bc5??", "Ba5?!", "2.13]", "Nhxf6", "-1.76]", "Qh1#", "N2e4", "Rfd5", "Rch1", "Qh2#", "Qg5?!", "1.86]", "Rdg7", "-3.15]", "-1.74]", "R8h2+", "a4?", "Rfg2", "Naxc5", "Ng8+", "-3.12]", "R8d3", "Rhxg8", "R4e6", "-2.01]", "Qd1?!", "N4f6", "Rdc6", "-2.0]", "-3.01]", "Rhd2", "Rfb7", "1.9]", "Bxd5?!", "-1.58]", "g6??", "Rgb1", "2.46]", "-2.68]", "Nexf5", "-2.05]", "gxh5+", "Rbxb2", "Rfh3", "Ree5", "Rbh8", "Nec7", "Rh1#", "exd6?!", "-2.37]", "Rbf7", "R3c2", "Qg4?!", "Nexf6", "R2c3", "Nfe1", "1.95]", "Rec5", "Rbh1", "2.0]", "R7e6", "R4d3", "-2.18]", "R5d6", "R8d2+", "Rdxd6", "Rdb7", "Rexd5", "-1.75]", "Bxd1+", "Rdh2", "-3.06]", "R1c6", "Rgb8", "Rfg6", "h4?", "2.87]", "Ncxe6", "Rfc8+", "Rexe6", "Nab1", "R5e6", "2.29]", "Ngf1", "exd8=Q+", "-2.36]", "Nab3", "R2e4", "R8c4", "h1=Q", "-2.12]", "Rbc3", "-1.88]", "2.02]", "-2.06]", "-2.56]", "2.2]", "dxc3?!", "Rff4", "2.43]", "1.92]", "R5c2", "-1.66]", "Nxa5+", "Rgf5", "Ngxf2", "Rgf4", "exd5?", "-1.9]", "Rhg5", "Ncxd7", "-3.08]", "Reh8", "2.34]", "Ngf7", "N7e5", "-1.85]", "dxe2+", "R1e7+", "1.98]", "-1.98]", "Ne7?", "2.12]", "Qb6?", "-2.89]", "1.88]", "2.6]", "R5d3", "Rfd4", "R7d5", "R8g6", "Ngh7", "Rgh3", "R5e4", "-1.94]", "Qa4?!", "Nba3", "3.36]", "R4e7", "R7e5", "-1.69]", "Be2??", "Qd3?", "Rdf4", "Nbc2", "Red1+", "R1a2", "Rdc5", "Rhf5", "Ngh6", "-2.55]", "R1b3", "-2.44]", "2.68]", "Re1?!", "Rcxc3", "-1.59]", "Rhe3", "2.77]", "Bb3?", "Ba4?", "R5f4", "cxd8=Q+", "Qg6?!", "Reb7", "R7e2", "Rdxe5", "Bg3?!", "N6h7", "dxe1=Q+", "R5f3", "-2.53]", "2.27]", "cxd1=Q+", "Rhf6", "Nhxf4", "h8=Q+", "R7c6", "R8h7", "Nxc6?!", "Ba2+", "2.11]", "2.7]", "Rdb2", "dxc4?", "fxe7+", "e5??", "-3.32]", "g3??", "R6g7", "Rhg4", "R1g3", "Nhf2", "R1e7", "Bxg8+", "Nfg1", "3.46]", "Nec8", "R4f6", "dxc8=Q", "2.41]", "Rac4", "Ndc7", "Rhe2", "-1.71]", "2.69]", "-3.03]", "-1.64]", "b3??", "dxc2+", "Nhg6", "3.37]", "Bf3?!", "Ncxe3", "2.67]", "Kf1?!", "R6d4", "2.24]", "-2.45]", "Bg2?", "Rbf2", "Rgxg7", "Rdxe2", "Rhf7", "Ke2?", "Na5?", "R6e2", "Ndf2", "Rexe4", "Rexe2", "Rdg3", "-2.91]", "Bb6?!", "R4d7", "dxc6?!", "b1=Q+", "2.79]", "Rcc4", "fxe8=Q+", "-1.93]", "Nfxe6", "Ng4??", "-2.65]", "Nbxd6", "-3.0]", "-3.27]", "R8a7", "Rdg2", "Rbd6", "f1=Q+", "R1d6+", "R4d5", "exd1=Q+", "Rbb3", "2.39]", "Rdf8+", "1.99]", "Rfxe6", "2.06]", "-2.03]", "R4f5", "Rab6", "Rcc5", "2.81]", "2.38]", "2.5]", "Qh4?", "Nhxg5", "Rdh7", "Rgg3", "Qxf3?!", "-1.91]", "2.25]", "-2.2]", "-2.31]", "-2.17]", "-2.81]", "R7e4", "2.04]", "#1]", "2.22]", "Rhf4", "Bb5??", "-2.86]", "2.53]", "Nxf7?!", "-1.73]", "-2.41]", "h1=Q+", "Bb8+", "Rgd3", "R1c5", "bxa7+", "Raxf8", "-1.92]", "-2.08]", "-2.29]", "-2.67]", "fxe1=Q+", "R8e4", "2.26]", "2.86]", "Qxh2#", "Bxc3?!", "-2.11]", "Rge6", "Reg7", "Rbd3", "2.07]", "Nca3", "Rge5", "R8f5", "Nexf3", "Nd4??", "Nbxc4", "3.43]", "Qd8?!", "f1=Q", "Nxb8+", "bxa3+", "f4??", "-2.59]", "bxa5+", "2.75]", "2.16]", "R8e7+", "2.37]", "Rba7", "-1.78]", "Rxa5+", "2.63]", "f5??", "N7d5", "-3.11]", "-2.33]", "Rcxc6", "Rbc6", "R6e3", "-2.04]", "Nhg3", "-3.18]", "R8d2", "Rfb2", "Ne2?", "2.51]", "2.48]", "-2.62]", "Ba3?!", "3.13]", "-2.22]", "3.75]", "Rdxe7", "Bb4??", "Be7??", "Rdc4", "Rcxc2", "R1h7+", "Rhh3", "b8=Q+", "exd1=Q", "Nfe5+", "-2.34]", "R5d4", "2.36]", "2.05]", "R5c7", "Ngh4", "-2.95]", "Bxf7+?!", "3.03]", "-2.43]", "Nde7+", "Rhf2", "-2.96]", "3.86]", "-3.34]", "-2.51]", "-2.74]", "R5c6", "g8=Q", "2.94]", "Rca7", "R1h2", "Qxf1#", "-2.7]", "-1.57]", "-2.3]", "Rgh4", "Rdxe6", "3.84]", "Nd2?", "R2c4", "-3.31]", "R3b2", "3.48]", "Rdxd3", "Rdxd4", "Rf1#", "R8e5", "Ncb1", "Ng6?!", "-2.32]", "Rexe3", "R3d4", "Rc1#", "-1.52]", "-2.93]", "R6f3", "-2.77]", "Nd7?", "Ngxf4", "Nexf2", "b2+", "Rexd7", "Qc3??", "Rhe4", "2.65]", "Rxa4+", "Rfg5", "h6??", "-3.65]", "-3.5]", "-3.91]", "-3.36]", "Rgd7", "Rgh7", "Rce5", "f8=Q", "Rcxd5", "Rhxh7", "Nde2+", "Ndxf4", "Rcb6", "Rdxd5", "-2.23]", "-3.2]", "R7f2", "-3.29]", "-3.05]", "Naxc6", "Ndf7", "-1.61]", "dxc1=Q", "Bxb8?!", "dxc5?", "R8d3+", "Ngxe3", "Rac3", "2.98]", "Reg2", "Nfd2?!", "2.58]", "3.18]", "Rdxf1", "Nxe5??", "Ke7?", "Bd2??", "Nexg6", "-3.24]", "Bh3?!", "3.2]", "Nxa4+", "Bf4??", "-3.67]", "R8a3", "R1d7", "-3.55]", "2.56]", "bxa6+", "2.19]", "-2.46]", "Rgd6", "2.55]", "-3.17]", "R8c5", "Bg7??", "3.74]", "Rad6", "-2.87]", "Nac1", "3.79]", "Qg5?", "cxb1=Q", "3.22]", "cxb8=Q", "-2.78]", "Ngh2", "Nfd7?!", "Qh5+?", "a8=Q+", "3.15]", "2.4]", "Nh4?", "e3??", "R6f2", "R4g7", "Rdxc8", "-2.19]", "Rcf3", "Rgxg2", "2.62]", "Rd1#", "3.55]", "Reg6", "Raa6", "-3.19]", "3.31]", "R4c6", "R6d5", "Bh6??", "Rae3", "dxe4?", "Ngh5", "Rdg6", "Nfd7?", "Nab8", "Rxe1#", "-2.99]", "gxh8=Q", "R3e7", "Nhxf3", "Nhxg4", "bxa8=Q", "2.09]", "hxg8=Q+", "Rdh3", "Bf5??", "Rfxf6", "a3??", "Rfh4", "3.11]", "3.62]", "R4c3", "-3.7]", "Ne5??", "3.24]", "Rgh2", "-2.94]", "3.27]", "-2.13]", "-2.6]", "-2.82]", "R8d7+", "N2xf3", "-3.48]", "R7e3", "h5?", "Rge1+", "Rbb6", "-2.98]", "Rhe7", "Rbd4", "3.8]", "Nef7", "Nef3+", "Rhh6", "-2.48]", "Qxf2#", "3.01]", "1.97]", "h3??", "Rcb3", "2.52]", "Rga8", "R6e4", "Nfg5+", "Rfh6", "N4xe5", "Nca4", "Rag8+", "Rdxe4", "R6f5", "3.72]", "2.49]", "-2.83]", "Rhd8+", "3.32]", "2.54]", "Rca6", "Nexf7", "3.51]", "-3.1]", "2.3]", "Bd5?!", "Nexd6", "R4g2", "Rdxf7", "-2.39]", "c6??", "-1.95]", "fxe4?", "-2.26]", "2.89]", "3.67]", "Qd2?", "Rad3", "Ndxf5", "Raxa7", "R3f4", "Rgd2", "Rge7", "Rexd3", "Raxa4", "Na4?!", "-2.21]", "Rhg2+", "Nac8", "Ndxe3", "2.14]", "Qe7??", "-3.39]", "Rcb5", "1.83]", "Nbxc5", "Rbd8+", "Qe2#", "-2.5]", "-2.97]", "2.74]", "2.47]", "N2d4", "R8c2", "Ng8?!", "Rgg6", "Rbe3", "-1.8]", "2.91]", "Qe6+?!", "Rexd2", "-3.21]", "-2.52]", "-3.51]", "Nfd5+", "R6c5", "Raxd7", "R3f6", "Nfh6", "2.88]", "-2.63]", "2.64]", "Rfc3", "R7f6", "2.71]", "-2.14]", "-2.61]", "Reg5", "2.42]", "R3f5", "Qf1#", "-2.27]", "2.66]", "Nh8+", "Rhd7", "N4b5", "-3.16]", "Rfxf7+", "g8=Q+", "Nc5?!", "3.41]", "-2.75]", "Rbc1+", "Nhf3+", "Nba4", "Ne4??", "bxa4+", "Rcxd6", "e4??", "Nhf6+", "3.44]", "R3d7", "cxd5?", "Nef6+", "R2b7", "Qf4?!", "Bxd5?", "Rhd1+", "g1=Q", "Nf4?!", "Nbc1", "Nce4+", "Qh3#", "Rfxd7", "R8e2+", "Rec4", "R1c4", "a5?", "Nb1+", "Nh5?", "Nce7?", "Rdxe1", "Qe4+?!", "3.05]", "Qd7?", "Be3??", "-2.79]", "Qc3?!", "Rdxc6", "Rab4", "-2.71]", "Nxd4??", "R1e2+", "N5h4", "Rdxe8", "2.28]", "3.81]", "R1a3", "R1h6", "N2c4", "2.96]", "Ndxc6", "exf4?!", "Rfh5", "Rbb4", "N3e5", "N6f5", "R5g6", "Rhg7+", "-2.09]", "Nxf7??", "Rfxc2", "3.56]", "3.0]", "-3.23]", "Ncd1", "Ngxf5", "Bb1+", "Rfxe7", "3.7]", "3.6]", "-3.07]", "Nh4??", "Na6?", "Red8+", "3.06]", "Qe1#", "Neg4+", "Qf4?", "R8xd7", "2.82]", "2.93]", "Rhe6", "3.77]", "R1f7+", "-3.41]", "Bxe5?", "-3.14]", "Ncd5+", "3.5]", "Nce2?!", "Rbe4", "R8e3+", "N7c5", "-1.83]", "Rbc8+", "Nb8+", "R1f4", "R8b6", "Rge4", "R8e2", "R3f7", "Rfg4", "Rba4", "Rdf1+", "Bxb1?!", "Rdb6", "-2.02]", "-2.07]", "Raxb2", "Rbb5", "Nfh2", "R4d6", "R7d3", "Qc6??", "Rexf7", "Naxb4", "exf3?!", "-3.37]", "R5g7", "N3a4", "Qe3?!", "3.34]", "R3e4", "Qe5+?!", "-3.81]", "3.16]", "fxe2+", "R7d2", "Rea2", "Qc2#", "Bxb7??", "Rhe5", "Qb4+?!", "Rdxc4", "R8b3", "Rfxe2", "3.39]", "Rexc1", "Raf3", "R1h3", "Reg4", "R2d5", "Raxa3", "-3.57]", "Nhg8", "R3c4", "Qg3?!", "Ncd4+", "Nhg1", "Rbxe8", "#-1]", "-3.72]", "Nbc7", "Bb2??", "Ndxc3", "Ndc2", "R3d5", "Qe5?!", "Rbxc7", "R1xe4", "Rcxc8", "Rdxf8", "Rga1", "-3.02]", "Nexd3", "R1f5", "2.76]", "R5b7", "-2.16]", "-3.58]", "-2.8]", "Rba3", "3.21]", "Nbd2?", "R4e5", "b7+", "Ndf3+", "R2f6", "Ngf3+", "Rexc8", "Rhxd1", "Bd6??", "Bd7??", "Rcxd4", "exd3?!", "Bh6?!", "-2.47]", "Qa4+?", "Rhxh2", "-4.15]", "bxa1=Q", "Nf5?!", "Rfxb1", "Rhh5", "Rhxc8", "N6a5", "-2.84]", "Rfxe3", "R3d6", "dxe4??", "R4c2", "Qb2#", "R2f3", "Rxf1#", "-2.57]", "3.08]", "Bxg1+", "R1e6+", "-2.54]", "R8f4", "R1d2+", "3.29]", "R3c7", "-3.53]", "-3.6]", "R8h6", "Qe2??", "3.76]", "2.84]", "3.89]", "3.82]", "Rhd3", "Ne2??", "Rfxf3", "2.21]", "3.65]", "R1xd5", "R6f4", "Qg4?", "gxf3?!", "Qc2?", "-3.84]", "Na4?", "Nh4?!", "Rcxd2", "Nge5+", "Be4?!", "R5c3", "Qxe1#", "R2d7", "Rfb3", "N5h3", "Ncd3+", "Nce5+", "R1xd4", "Nec2", "fxg8=Q", "Nfd4+", "R6b7", "fxe4??", "3.1]", "Nfxe3", "Rfxd6", "4.05]", "Rdf5", "Rdxc3", "cxd6?!", "Rexf8", "-2.64]", "Qg1#", "Rcb4", "Nfxd6", "N4xd5", "-2.76]", "Rab5", "3.96]", "Rgxg2+", "Rdxf2", "Rge8+", "3.93]", "2.97]", "N8a6", "Nbc8", "Kf8+", "Kf1+", "Rbc5", "Rfxf5", "Rae4", "-3.77]", "2.61]", "Rea7", "Nge6+", "g4??", "3.07]", "a6??", "Be5?!", "-1.99]", "R6e5", "3.35]", "-2.73]", "Nce7?!", "Na3?", "Nba5", "c5??", "R7c5", "Bxd4?!", "3.94]", "cxd4?", "Ngf6+", "2.45]", "N5g4", "7.63]", "Nec1", "Bxb4??", "R1b5", "Rdb3", "b6??", "g5??", "Qa5+?", "R7xe6", "N6e4", "Rgh5", "2.23]", "Rcd1+", "2.35]", "-1.97]", "Rge2", "2.57]", "-2.66]", "N6xe5", "3.58]", "3.91]", "Raxb7", "Ngf2", "-3.69]", "R7g2", "g1=Q+", "Bxf6?", "R5g4", "Rexf5", "-3.47]", "-3.26]", "-2.72]", "N5f4", "R2xd3", "R8xc5", "R6c4", "2.44]", "R7d4", "Nc4?", "R5g3", "R8f2+", "Rcf6", "3.17]", "Naxb5", "-2.42]", "N8e6", "Rdxc5", "R1a7", "Rdxc2", "Nbd6+", "Rba2", "Nef2", "Rexf1", "-3.59]", "Ncxd2", "R5xe4", "R2f4", "Raxa6", "N3xd4", "c4??", "-3.79]", "Qe4?!", "-2.92]", "Rfb8+", "Rce4", "3.98]", "Qf5?!", "Rfxb8", "N7f5", "Ned6+", "-3.66]", "R4g5", "R7b6", "Qf5?", "Qd5?", "Rexf2", "2.8]", "Qc1#", "b5??", "-3.74]", "Qxd1#", "R2b3", "-3.28]", "3.57]", "N3xe4", "Raxf1", "-2.35]", "Nd5??", "R7c2", "3.02]", "-3.44]", "-3.09]", "Nbxc2", "Ncxd3", "Ncd8", "Bg6?!", "R4c5", "Bh3??", "N7e6", "Ndxe6", "Ndxf2", "Nce3+", "R2xe3", "N3g4", "Nbxd3", "Rbd1+", "exf6?", "Rgxg7+", "Rdh5", "Rdxe3", "Nb6?!", "Bxc1+", "Qg4#", "R7e6+", "R7c4", "Rgd4", "Rcxd3", "Bf1?!", "3.64]", "Rhxe8", "4.0]", "-3.63]", "R1f2+", "Rfh7", "3.87]", "Rec1+", "R5c4", "Rdg5", "Qh5??", "Nfxg6", "Rbd5", "Rexe2+", "-3.45]", "-3.68]", "Rcxd7", "Reh4", "Ke7+", "Bxh6?!", "hxg1=Q+", "Bxe4?", "-2.28]", "N5xf6", "Rbc4", "Rhxd2", "Rca4", "Ng3?", "2.59]", "Ndf7+", "Nge2?", "Rexf4", "Rgxf4", "R8a6", "R8b2", "N6b5", "Ndf6+", "N4f5", "Rhxg1", "R8f3", "R7f5", "Rad4", "Rbe8+", "Qc6?!", "4.03]", "Ng8?", "Rdxc1", "Ke8?!", "Rcxc4", "Qd4?!", "Reb3", "N6c4", "Rda4", "Be6??", "-4.44]", "Rfa7", "3.25]", "4.51]", "R4b5", "R3a2", "3.63]", "N5c4", "-3.62]", "Raa4", "-3.94]", "Nbd7?", "-2.9]", "Qf4??", "Ngf7+", "Qg3?", "Raxa5", "Rfxe5", "Na8+", "R3b4", "Rcxc5", "R1b6", "Rcxe4", "exd5??", "4.01]", "Rdh4", "R3e5", "3.23]", "Rg1#", "Ncxe4+", "N4h5", "3.47]", "Rgf1+", "4.4]", "Rfxf2+", "Rae6", "Rgxg6", "Nfxe7", "Rexe8", "Rfxe4", "3.04]", "3.09]", "N3c4", "4.27]", "R8xc7", "R8c3+", "N8c7", "cxb5?", "-3.86]", "Ncd6+", "Nfxg3", "R8c2+", "-3.61]", "3.3]", "4.17]", "R2e6", "-3.96]", "-2.85]", "-3.04]", "R8a4", "Nh1+", "2.83]", "N2xg3", "Nab7", "Qxb2#", "Nh3??", "3.49]", "Nb3?!", "3.12]", "Nh5?!", "-3.56]", "Rfa2", "N3f4", "Nh5??", "Nfh3", "R8g5", "3.42]", "R8xd4", "-2.4]", "Nca5", "R2e5", "Rgf7+", "Bb7?", "R8xd5", "R6c2", "dxc8=Q+", "Rdb4", "R2d4", "Nfd6+", "-3.75]", "R2b4", "Nge7?", "Rfxd3", "Rac5", "Nexf3+", "Bxc8+", "R1c7+", "fxe6?!", "Qb4?!", "R2d6", "Ng5+?!", "Rcxf2", "Nxb1+", "-3.38]", "N4c5", "Qd2??", "-4.17]", "N7xc6", "R8xd6", "Raf2+", "Nfh7", "-3.52]", "Qg4??", "Rcxb7", "Rdh6", "Nac6+", "R8h3+", "Bxh3?!", "Ndc7+", "Rbf6", "Qe6?!", "cxb5?!", "Nef8", "Rec8+", "R5g2", "R1g4", "exd6?", "2.99]", "Rhxd8", "R8h3", "Rhxe1", "Bg6?", "Rfh2", "R1c7", "-4.08]", "bxc1=Q+", "3.19]", "R4xe5", "N8g6", "Rcd8+", "-3.76]", "R1a7+", "3.52]", "Nexf6+", "Ba6?", "cxd8=Q", "Rgg5", "Naxc3", "R4g3", "Rfxf4", "Rxd1#", "-3.35]", "Nfe7+", "Ngf6?!", "Rfxd2", "3.9]", "R8h7+", "R8e4+", "Ba3??", "Kf6+", "4.15]", "cxd1=Q", "Bb5+??", "Ng1?", "Raxb6", "Rbe1+", "2.9]", "3.59]", "Nge4+", "Nexg3", "R7d6+", "Rba6", "R1xf2", "Bc3?!", "Rb8?!", "Rdxa6", "R2xd5", "R2e7", "Bxc6?", "fxe8=Q", "4.35]", "R7xd6", "Rgxf1", "R8f3+", "Rcxe8", "R1a6", "dxe8=Q", "3.68]", "Rce8+", "Rag1+", "Bh5?", "3.14]", "4.34]", "3.53]", "Nfd2?", "-2.69]", "-3.87]", "-3.46]", "Nde8", "Qxd4?", "Bxf7+??", "Rhh4", "R3xd4", "R8xf7", "-4.2]", "Rbxc6", "R1h6+", "N4g5", "R8xe5", "gxf3?", "Rfb6", "Rh2#", "N1a3", "R8b4", "R1h7", "Rhc8+", "R5h7", "3.66]", "Nhg4+", "Qg3#", "Rb1#", "R4a3", "R8h4", "Rcxe6", "Rcxc2+", "4.73]", "Rea4", "Nhf4+", "R1xe3", "Qc1?!", "Nc4?!", "2.33]", "Rexf6", "R1b4", "dxc6?", "Nxc3?!", "Rbxa3", "2.85]", "Bb7??", "Qc4?!", "R2f5", "Qxd5?", "Nb4??", "Qf3+?", "Nfxd3", "Nf7?", "Rhxe4", "Rbxa7", "Ba5?", "Ncxd6", "-3.99]", "4.2]", "3.83]", "Nb8?!", "Nd2??", "R7g6", "2.73]", "Rfc6", "cxb8=Q+", "Nhxg6", "Rgxg3", "Nf7??", "7.65]", "-3.82]", "N3g5", "Rbf4", "Qe3??", "3.4]", "Raxd6", "-4.22]", "Nhg7", "Nhxg3", "7.36]", "-3.93]", "N5xd4", "Nde1", "R1b7", "4.43]", "Re1?", "R4h7", "Rgf2+", "Rcxb4", "-3.73]", "Ncxe5+", "Bxe5?!", "Bxf4?!", "4.02]", "4.31]", "Bd5?", "Nxe4??", "R6h2", "R2f7", "3.33]", "R8xf6", "Rfxd4", "Qc5?!", "N2f4", "Rda7", "R4b2", "R1g6", "4.14]", "-2.88]", "Rbxb5", "Rfb1+", "Rad5", "R8xe4", "4.13]", "4.24]", "Rgxf8", "Rexb7", "Qd1?", "Nbd3+", "Reh5", "-4.27]", "Rcg2+", "Qxc5?!", "Rgc3", "4.12]", "3.54]", "Rdxd2+", "Rgxg4", "4.69]", "R3e6", "Rcxe3", "R7b3", "Nfe4+", "Nfe3+", "Qf5??", "R8xc3", "-4.48]", "-4.04]", "Rdg4", "Qe7+?!", "Ned3+", "Rda3", "-3.71]", "R1xd3", "5.21]", "4.26]", "Rdxc7", "Rhd4", "R2c5", "exf8=Q", "N2b4", "Kd7+", "Rhd5", "R8xd3", "Bxc6+?", "Rae5", "Nef1", "Ngf4+", "Rbxb7+", "Bf6?!", "dxe5??", "-4.23]", "R2g4", "R1xf5", "-4.31]", "7.61]", "Qa5?", "Rcxc7+", "-3.78]", "N2e3", "Rhxg4", "-6.41]", "Ke1?!", "Rbxc2", "7.58]", "4.55]", "bxc6?!", "Rexc2", "N1xd2", "Bxg8?!", "Nec4+", "Nfg6+", "Nhf5+", "Qd8?", "R8a2+", "exf5?", "gxh8=Q+", "-3.42]", "R8b2+", "Rea3", "-4.11]", "Rcxc1", "R1e5+", "Qg6?", "-3.43]", "bxc3?!", "Ncxb6", "Rcxf7", "R7c3", "fxg8=Q+", "Qf6??", "-4.01]", "4.16]", "Rca3", "Qxd4??", "Rdxd8", "R8g3", "Ncxd3+", "Bxd7+?!", "Kg8+", "Qc7?", "gxh1=Q", "-3.83]", "N1h3", "R2c7", "Bxb2??", "Nd7??", "Rhxf6", "Rhc1+", "Rhc5", "Qf3+?!", "R1xc2", "Qh3?", "Bxe4?!", "3.71]", "Nbxc7", "axb8=Q", "R5b2", "7.24]", "6.94]", "4.29]", "Qd2#", "R1xe2", "Nfe6+", "Rbxc4", "Nhxg2", "R7f3", "-3.33]", "Rxh2#", "R8f7+", "R8xe3", "Rbg2+", "4.72]", "4.89]", "R1f7", "Bxg5?", "3.61]", "Bb6?", "Qxh3#", "R5xd4", "R1h4", "Rde2+", "R8h5", "R6a7", "3.26]", "4.67]", "Rea6", "-2.49]", "R7xf5", "Nef5+", "Qg5??", "Nbxa3", "4.06]", "R6c3", "Rdxf5", "Raxc2", "N8xd7", "Rh3#", "Ned4+", "7.31]", "dxe1=Q", "Kd6+", "2.95]", "2.92]", "Qh4??", "Reh2", "R7f4", "Qd1#", "Rxh3#", "Ngf2+", "Qxf6?!", "4.37]", "-3.98]", "N8xe7", "Nd6?!", "Ndb5+", "Rbxd2", "Nfd3+", "Qa1#", "Rexc4", "R2h3", "4.09]", "3.69]", "-3.4]", "Rce1+", "Nc5?", "Raa5", "-4.29]", "Nhxf6+", "Bg2??", "Rhxc1", "4.11]", "R8b5", "N3d5", "Rfc4", "-4.53]", "Ndxb6", "R5b3", "Ndf5+", "-4.03]", "R6xe5", "R6xd5", "Reb1+", "Na1+", "Qxd6?!", "Bxf3?", "Rbxe2", "Raxc7", "-3.8]", "Rdxa7", "Rhxh5", "R4a2", "Qf3#", "Ndc2+", "Rhxg2", "Ncxd8", "N6xf5", "R7g4", "3.78]", "3.85]", "Rf2#", "R7xf6", "Rbf3", "Ndxf8", "Ndf4+", "Kf7?!", "R6a5", "Rbxb3", "N7b5", "Rexf3", "5.03]", "4.79]", "4.86]", "Nbc3?!", "Bb2?", "Rhxf3", "Ng6?", "Rgxe5", "Raxb4", "Bc6?!", "Bd4?!", "Rdxd4+", "-6.15]", "Rcxb3", "Rdxd7+", "Rba5", "Qc6?", "5.1]", "Qxf3?", "R2h6", "R7a2", "Rcf7+", "Rhxg6", "Qc8?!", "N2g4", "Ke6+", "-4.09]", "4.93]", "4.38]", "Raxf2", "Rcg3", "3.28]", "bxa8=Q+", "Nfd8", "Rgc4", "Kf2?!", "N1g3", "-4.13]", "N2d3", "-6.19]", "Ke7?!", "7.34]", "-3.97]", "Ngf5+", "Rda5", "Rexc5", "Bxe6?", "Nxc6?", "R5a2", "Rgxe8", "Bxc5?!", "Neg7", "Ba3?", "Bxh8+", "Ndxc7", "Raxc3", "7.35]", "axb8=Q+", "Qxf7+??", "-3.85]", "Nab2", "N3c5", "Rexc3", "3.97]", "Nhg2", "Qd4?", "R6e5+", "axb1=Q", "Rbxc3", "fxg1=Q", "-4.07]", "-4.6]", "R2xc3", "Rbxd7", "Raxg8", "R8g2+", "Raxf7", "4.18]", "R3c5", "4.58]", "Rgxe7", "R2e3+", "Raxc6", "-4.5]", "5.16]", "Kf8?!", "7.94]", "Rcxa7", "5.42]", "Nfd1", "N7xd5", "Rgxf2", "Rhd6", "4.49]", "Qxc2#", "Reh7", "R1xf4", "Qd6?", "4.22]", "Rbxa2", "Rhc7", "Nce7+", "Rdxf4", "R5h2", "R2d3+", "4.04]", "4.07]", "3.92]", "Nc5??", "N1xe2", "Bf2+??", "Ncxd6+", "R8g4", "4.08]", "R5b6", "Ne7??", "-4.1]", "Rbxa5", "6.75]", "Rcxb5", "Rfxf1", "Bh4?", "R1xd6", "R2b5", "6.81]", "N6b4", "5.36]", "R1a5", "Ra1#", "Qxc1#", "R4b6", "4.1]", "R1a4", "6.69]", "dxc1=Q+", "Nfe2+", "Rfa3", "N4a5", "2.78]", "Rda2", "-4.05]", "Nexg5+", "-4.47]", "Rbxd6", "5.0]", "Reb4", "Rg1?!", "8.05]", "Rdxb7", "3.95]", "Rhxd4", "R3g5", "gxf6?", "Rcg7", "R1h5", "-4.46]", "Neg3+", "Ned5+", "R4b3", "R1h2+", "Raxe7", "8.06]", "7.95]", "Qh3?!", "Ndb2", "Rdc1+", "R6xd4", "Rh5#", "exd4??", "7.08]", "7.81]", "8.0]", "Rhxf4", "-4.56]", "exd4?", "Bc3?", "7.41]", "Rch2", "4.56]", "5.57]", "N4h6", "4.77]", "Ne1?!", "R5a4", "N7g5", "R6xb5", "N6xd5", "Rexb1", "R6h7", "Qe3?", "R3g4", "R1xd2", "Nfxe4+", "Bg3?", "R8f2", "N4xb5", "Qh4+??", "Qh3??", "3.99]", "R3h4", "-4.81]", "Rcxe1", "Rhxe6", "Nbxd6+", "Rcf5", "R3g6", "Qd3??", "N5xe4", "Nce6+", "R2xf3", "4.7]", "Bb4+??", "Ndb5?!", "Qxe5?!", "R6b2", "Ngxh7", "-4.65]", "-3.9]", "4.59]", "Bxc4?", "-4.0]", "Rbxd3", "R3xc5", "Ngxf6+", "Rgxd8", "Rcxa6", "Rdb5", "R2g3", "Kd2?", "bxc5?!", "N7e5+", "Qxc7?!", "Bh6?", "Rbe5", "N2xb3", "-4.67]", "Bxf3#", "-3.95]", "R4h6", "3.45]", "7.84]", "7.4]", "-3.3]", "N6c5", "Bxc5??", "Nde5+", "Qxe2#", "Rbxf2", "Nhxf7", "R8xe6", "R3h2", "h4??", "bxa1=Q+", "Rb1?!", "Rgxf3", "N4g6", "Rcxf6", "Nb3?", "Bxf2+??", "Kf7?", "Qb3#", "Bxh6?", "Rdxb2", "Rexc7", "R1f6", "Qxd5??", "Ke2?!", "Kf1?", "Nbc7+", "Nde3+", "Bh3?", "-4.06]", "N6f5+", "Rcxe5", "R7a6", "R6a2", "-6.77]", "Rbxe6", "Qh4+?", "fxe6?", "-10.79]", "3.38]", "4.25]", "R4a5", "Ncxb3", "N1a2", "Rgxf7", "Reg7+", "-6.43]", "Raxe5", "N8a7", "Raxb3", "R2xb3", "8.07]", "5.24]", "Qh4#", "N5b4", "R8xg7", "Rfxc7", "bxc4?!", "R7f6+", "Reb5", "Rea5", "Rag7", "Rfxf3+", "Rhxh6", "-3.54]", "N7a6", "6.96]", "Rcxe7", "Ngxe6+", "4.84]", "7.89]", "R1xe6", "Qxd3#", "Kc7+", "-4.93]", "7.68]", "Rcg2", "Rgxh6", "R6g3", "gxf6?!", "R1xc5", "Qe6?", "R1c6+", "R8d4+", "Bc2?!", "-3.49]", "Ndxc2", "Rca2", "Raxb5", "Rgxf5", "Ke3+", "Nfxd6+", "R1b7+", "7.73]", "Na3??", "7.62]", "-5.0]", "5.29]", "4.63]", "3.88]", "-4.77]", "Rcg7+", "Qc4#", "Rxc1#", "-4.25]", "Nf5?", "Ke7??", "Qh6#", "Qb4#", "-4.43]", "-4.34]", "-4.33]", "Neg2", "Kg7+", "Bxf2+?!", "Rbe6", "Kd2+", "Qh5#", "Ng5+?", "Nfg2", "Rdf2+", "Nf2??", "Rg1?", "Rbxd4", "exf1=Q", "Ncxd5+", "Bxf4?", "R2c6", "Kf3+", "Bxb4?!", "Nfxg4+", "-6.17]", "Qxb4?!", "5.39]", "Ndxf7+", "6.78]", "O-O-O?!", "7.6]", "R8c7+", "bxc3?", "Rbxb4", "Nfxh4", "Rgxd4", "-6.82]", "-7.01]", "-3.89]", "R4h3", "-6.2]", "Bxd4?", "exf3?", "Qb5+?!", "Nbd8", "exf5??", "R7xd4", "Nec6+", "Nd6??", "R6b3", "-5.14]", "-4.52]", "Ke2+", "R4xd3", "R8xf5", "Rfxf8", "R1a2+", "R2h3+", "cxd6?", "Rdxf3", "Rfb4", "Rag2+", "Kd3+", "Bxf6??", "4.68]", "N5d6", "Qxb2?!", "R1a6+", "7.09]", "Rdg2+", "-4.18]", "R7h4", "Rbxb2+", "Qd7??", "Rhxe5", "Rca5", "6.59]", "Raxe6", "R5xe6", "5.43]", "Rdxg8", "-7.09]", "R3b7", "Rexd6", "Nxg4?", "Rhxg7", "cxb4?!", "-3.64]", "Rbg7+", "R7a3", "N7xe5", "R6b5", "Qb1#", "R7h3", "5.82]", "Qd5??", "R3xe4", "R2xc5", "bxc1=Q", "Nbd2??", "Rg2#", "b4??", "N1d3", "Rexg7", "6.31]", "Rdf7+", "Bxb1+", "N8h6", "bxc8=Q+", "Rfxf4+", "R3xc4", "Bxd5??", "Rcxd2+", "Bf8?!", "Rgxd1", "Rgxd6", "5.22]", "R7h6", "Ndc4+", "Raxd3", "Rfxc3", "Nce2?", "-4.14]", "6.72]", "Bxg4?!", "Qb3??", "Rcxe2", "Rh8#", "Qa4?", "Rdc8+", "#-3]", "Ndxb1", "Ke4+", "R5a6", "7.01]", "Bxd4??", "7.46]", "7.47]", "Ba6??", "Nhxf5+", "Ngxf8", "R6h5", "R7h2", "N2a3", "-6.13]", "Ngxh2", "Rcxc3+", "Rah2", "Raxc5", "Rch3", "7.17]", "Ned1", "R5xd3", "Bxf5?!", "N3b4", "Rgxg5", "Nbxc7+", "Nh2?!", "R5h4", "Qxf6?", "4.5]", "Nbxd4+", "Rbf5", "R5xe3", "Ke1+", "Rb1?", "R1g7+", "Rgxd5", "-8.82]", "-3.88]", "Rfc5", "Raxc4", "Qc3#", "Nfxe5+", "Nexd6+", "R2c3+", "Bxc3+?", "R8xc6", "N5e6", "-5.15]", "-5.63]", "Rexc6", "N3xh4", "Rcf4", "Nxd8?!", "-6.86]", "-6.84]", "R3c6", "9.74]", "Qc4?", "5.23]", "Kxf3+", "Rgg4", "Nef4+", "Rfa6", "dxe3?!", "-4.63]", "-4.55]", "-4.79]", "R1xe5", "Rag7+", "-5.29]", "N3xf4", "-4.02]", "7.86]", "Kf7+", "Rh6#", "5.56]", "5.55]", "-6.89]", "Rcf8+", "R4xd6", "4.48]", "Qxe5+??", "Rbf7+", "R2a4", "Qe2+?", "Rexe7+", "Re2#", "Nge3+", "4.19]", "N1xc3", "Qc3?", "-3.92]", "Rbxa6", "-5.21]", "N4xf3", "Reh6", "N6d4", "Rcxf1", "-7.84]", "Nxb5?", "Bxb8+", "Nxg5?!", "Rfe7+", "Rab2+", "N6xd4", "5.62]", "Qxb1#", "Qf4#", "Rcf2+", "Rcxa2", "Ra3?", "Rg8?", "-6.56]", "-6.25]", "Ngxh4", "Ba4??", "Nxd7?!", "Rexb2", "N6xd7", "4.82]", "Kd8?", "Qd6??", "Ndxf3+", "Rfa4", "7.37]", "Kg1+", "Nxd5??", "Bxc5?", "N3f5", "Ba2?", "7.51]", "N4xb3", "6.8]", "7.82]", "Rcg2#", "Nbc2+", "5.7]", "Rbxb8", "R3e4+", "R4g6", "N6g5", "Rhxd6", "Nfxd4+", "Bc5+?", "Bxe4??", "10.41]", "Nc4??", "R3b5", "Ra6?!", "N2xc3", "R5h6", "4.46]", "Nhxf3+", "-2.38]", "6.67]", "6.62]", "Rda6", "4.83]", "Bf3??", "R2a3", "R7xc6", "Nbxa6", "dxe6?", "Nexc8", "-4.4]", "Qb5?!", "Raxd2", "Ndxb8", "-5.16]", "R8a5", "Nde4+", "-4.76]", "-6.79]", "Nbxa4", "Rhxf7", "Rexe5+", "Ke5+", "N4xh5", "-4.3]", "Nd3?!", "-4.61]", "5.6]", "R1xg2", "6.56]", "R8b3+", "R1xf6", "exf4??", "Rch4", "R7b5", "7.42]", "7.43]", "7.7]", "7.39]", "7.06]", "Nfxh2", "4.32]", "5.04]", "4.23]", "4.36]", "R3b6", "Rdxf6", "Rgxe4", "Rbh3", "-6.45]", "Ndb7", "5.5]", "Red7+", "fxe1=Q", "Ngxe4+", "N6f4", "Na5??", "6.6]", "N6c7", "Rbxb6", "Bxe6?!", "5.11]", "-4.88]", "R2h5", "-5.19]", "4.98]", "5.58]", "Rcxa4", "Rexe6+", "-6.88]", "Rfxb2", "N7xb6", "4.3]", "R8xf4", "R1xc3", "5.06]", "6.79]", "Rg8?!", "-5.91]", "Nec2+", "Ndc8", "R8h2", "-4.35]", "R3a6", "Bxe2?!", "Qd3#", "dxc3?", "Nxc3?", "bxc4?", "R7a4", "Naxc2", "R3xe5", "7.54]", "-8.46]", "-5.41]", "Qa5#", "Ngxe4?", "7.25]", "7.79]", "Nexg6+", "Rxb1#", "-4.58]", "7.44]", "Ncb5+", "R7xg6", "8.94]", "9.06]", "9.0]", "Rfc7+", "N8f7", "Rhxg5", "Qe4#", "Rhc2", "Qxc4?", "-5.5]", "Ndxf2+", "Rgc2", "Kf2?", "Raf1+", "R4a6", "N2f4+", "Bxg5?!", "R8xh3", "R3a5", "R8xf3", "gxh1=Q+", "Rbxe7", "Raf6", "Kc4+", "5.69]", "R7g3", "N5xc6", "Rhf7+", "10.82]", "Rdf6+", "Qe1?!", "Rhc3", "4.54]", "N6xf4", "Ndxf1", "Ngxh6", "Re8?", "Rhxc3", "R6g5", "5.79]", "Nfxe7+", "R8a3+", "Rdxh7", "Nhxf4+", "R6g2", "-4.89]", "Kd1+", "Qxb7?", "Nhf7+", "Ne6?!", "Qe5#", "8.17]", "N2xe4", "-4.62]", "R5xc4", "R1d5+", "-4.85]", "6.58]", "Rgxe3", "4.75]", "N7d5+", "4.28]", "-9.23]", "-4.41]", "-8.54]", "Rhxe7", "Neg5?!", "Rdxb6", "Bh4+?!", "Qxc4?!", "Nac7+", "N6xh5", "Rbg4", "Ndf6?!", "Ne3?", "-4.12]", "7.05]", "-6.21]", "7.12]", "exd3?", "7.77]", "Bxg8??", "-5.12]", "Nac3+", "6.42]", "Bd4?", "Rdxd3+", "Qe3#", "Rexb8", "R4xf6", "R1xc4", "Nexg8", "Ngf3?!", "Kf5+", "N6xe7", "bxc5?", "Nb8?", "Bxd3??", "R5xf4", "-4.32]", "Nf2#", "Ngxh5", "Nfxd3+", "8.19]", "7.48]", "N8b6", "Qf6+?!", "cxd3?!", "N7xg6", "Rfxg5", "Nfxd5+", "-6.62]", "Rbxf4", "Rhxe2", "N5xf4", "bxa3?!", "4.81]", "R8e6+", "R1f6+", "Qxh4#", "Rbxe4", "-6.64]", "Raxd5", "Qxg1#", "Rcg6", "Ncxd4+", "6.2]", "Rdxd5+", "Nhxf1", "4.96]", "4.92]", "Rgxe1", "Rbxf2+", "Qg6#", "R6g4", "Rgxd3", "Ref8+", "Rbg3", "Nexc2", "Rgc5", "Ncb4+", "Rfg8+", "-10.33]", "-4.8]", "-9.28]", "Qc5?", "Rfxe1+", "R2xd6", "Nhg6+", "Nbxa7", "exf4?", "N5g4+", "8.12]", "9.34]", "Rxg4#", "-7.22]", "5.98]", "7.97]", "Rdxe3+", "-7.08]", "-5.18]", "Raxe2", "Bxf3??", "Ra5#", "R4xd5", "N4f5+", "Bxd6?!", "Nh3#", "Rbxf7", "Ncxb2", "6.65]", "7.21]", "R7xe4", "Rgxf6", "Nfxg5+", "6.27]", "R2xc4", "Rh3?!", "R7b4", "-8.65]", "Bxe7??", "Nfxe8", "R1d3+", "Nfxe2", "Bxf5?", "Kd8+", "Rdxe7+", "cxb1=Q+", "-7.91]", "Rbxd5", "Ned8", "Rh4#", "Nec3+", "Raxa8", "Rexa7", "R7c6+", "Rbc2+", "5.45]", "Rcg5", "Qg5#", "3.73]", "Be4?", "N1e3", "N5xb6", "5.01]", "Nge2??", "-7.25]", "Naxb3", "N3xe5", "Nhg5+", "Ng3#", "Qd4#", "Kd8??", "Rfxg2", "N2h3", "-10.58]", "Bxb5?!", "Ndxe2+", "N1f2", "Nab5+", "N8d6", "R3xd2", "5.34]", "Rbh7", "Rbxc5", "Rcxc6+", "-5.08]", "Rbxa4", "R6xc4", "Rbe2+", "N4e3", "-4.92]", "R8xe7", "Naxb6", "4.42]", "R8a7+", "Qxe3#", "5.75]", "Qxg3#", "R8xa4", "6.54]", "R2a7", "7.13]", "-4.68]", "R1xf3", "4.57]", "-4.99]", "Rfxf6+", "N4h5+", "Kd2?!", "Nd3?", "-5.39]", "-5.35]", "-5.2]", "Rag3", "fxe3?!", "a5??", "-4.7]", "N5a6", "R4xf3", "Qe5?", "Raxd1+", "-6.63]", "-6.9]", "Rfxd5", "Rfb5", "10.43]", "Ng5+??", "Rdxg2", "Nfg4+", "Rab7+", "Ngxe5+", "6.74]", "N3h4+", "R2f3+", "Ne1?", "Rgxh7", "Nba2", "Raxd8+", "Ncb7", "R2a3+", "N5a4", "7.32]", "Raxg1", "Ndxb2", "N6a7", "Nexg2", "Rexe1", "Ndxe3+", "5.53]", "N4xg5", "fxg6?", "Nbc4+", "N6g4", "Ra2#", "-6.09]", "Rbg2#", "4.21]", "Nxd6+?", "-4.74]", "R7g5", "6.61]", "Ndxb7", "Qxd2#", "N2xd4", "-5.87]", "Rbxf3", "6.63]", "Nhxf8", "Nfxh6", "Nbd4+", "Nf7?!", "Nbxa5", "-9.19]", "R6xh5", "Qxf4#", "-6.4]", "5.54]", "Bc3??", "5.25]", "Rfxc7+", "-5.33]", "Qb5??", "7.16]", "Qxf2+??", "Rhb3", "-4.37]", "Rhb2", "R1c2+", "5.9]", "R4xc3", "Rgd5", "-5.7]", "7.85]", "Nge8", "N6f7", "g6#", "7.18]", "-6.8]", "5.33]", "Rh3?", "5.92]", "Nhf2+", "R1xb2", "cxd4??", "Nb5??", "4.47]", "cxd5??", "Rbxb3+", "5.84]", "gxf8=Q", "-4.86]", "R3f2+", "Rah4", "4.91]", "-4.95]", "-4.24]", "Qxb7?!", "11.48]", "Qxa2#", "-8.26]", "Rhxd5", "Ngxh6+", "-8.39]", "N3xc5", "Nce2+", "Rcxf8", "R6xe4", "Ndxb4+", "Kd1??", "5.31]", "Rxg2#", "Ndb4?", "Ndc3+", "Reb6", "N5xa4", "-5.32]", "-4.57]", "7.69]", "hxg5?", "Nb1?!", "-4.51]", "-5.99]", "N5e3", "4.33]", "-5.48]", "N4xf5", "Rfxc6", "R6xd3", "Nge7+", "Bd5??", "-8.81]", "R7xb6", "Ng6??", "Nh6??", "6.38]", "Rgxh5", "5.18]", "Qg6??", "O-O-O?", "R1g2+", "4.61]", "Reb8+", "5.26]", "#7]", "Rdxf2+", "7.55]", "Nf2?", "Bxa6?!", "Rah3", "Qa4??", "Naxb3+", "Ndxe1", "#5]", "-7.77]", "R5xe2", "#6]", "R1xc6", "Ra2?!", "-5.8]", "4.45]", "-6.24]", "-4.78]", "Bf3?", "N6xg5", "c7?", "R1xa3", "R4xb6", "7.57]", "-8.5]", "-8.03]", "-8.18]", "R6xe3", "R8xb5", "R4xf2", "Rgxc7+", "Ngf3?", "Nbxc8", "-6.66]", "-7.51]", "N1xh3", "Nexf4+", "5.97]", "-5.1]", "Bxc6+??", "Bxd3?", "Rhxf5", "-5.73]", "N4d3", "7.22]", "8.97]", "Nbxa2", "Nexd4+", "-6.38]", "4.64]", "Nfxh7", "Rcxf4", "-4.36]", "Qxc3??", "Ngxf1", "N7xf5", "Qh6?", "Raf8+", "R2f7+", "dxe6??", "-7.05]", "-7.03]", "N2xc4", "Rag2", "R7xa5", "Bxd7+??", "10.84]", "N4g5+", "Naxc6+", "Ndb4+", "N4e5+", "Ndxe7+", "Nde6+", "gxh3?!", "Rdg6+", "5.96]", "6.25]", "Rhc4", "Nxb5?!", "8.45]", "N3g5+", "Rbf1+", "8.1]", "Rde3+", "-14.94]", "R1xb4", "R1e4+", "Nf5??", "6.51]", "8.37]", "Ke3?", "-4.71]", "Nfxh3+", "5.52]", "Qxe4+?!", "Bxc6??", "Rbxe3", "Rdxd1", "Qxh1#", "N3f4+", "5.74]", "R4xf5", "-6.08]", "-6.78]", "R6a4", "Raxd7+", "R6b4", "Bb3??", "Rxh4?!", "Qa3?", "Nfxe2+", "Raxf6", "Nhxf7+", "-6.36]", "Rfe6+", "N5d4+", "R6c5+", "Ngf6?", "e8=N+", "#-4]", "R1b6+", "Rfxg5+", "Bxc4??", "Qa2#", "R1xa5", "Rexg6", "R1g6+", "Rgxd2", "Rgxb2", "4.52]", "N1c2", "Ncxe8", "Rce2+", "7.3]", "R5h3", "7.45]", "N5xb4", "Rde7+", "N3e4+", "-5.45]", "Nbc6?!", "N1b2", "Qdd5+", "-9.3]", "-9.41]", "-9.48]", "-7.7]", "-7.71]", "10.78]", "6.98]", "-6.11]", "Qe3+?", "R7xa6", "R3h7+", "4.78]", "N2a4", "Rhxg3", "Qc4??", "-9.43]", "-9.51]", "-9.49]", "-9.61]", "Qxe4+??", "Ndxe6+", "R3xd7", "Rxa2#", "Ngxf4+", "Rh2?", "R2a5", "N5xg6", "Rad2+", "-8.37]", "-8.36]", "10.67]", "10.63]", "10.45]", "10.23]", "cxb3?!", "6.28]", "Rexb6", "Rcd7+", "6.09]", "Bxd7+?", "-6.68]", "-7.0]", "-7.02]", "-7.53]", "8.81]", "4.71]", "fxg5?", "Nb3#", "R3xf5", "N7f6+", "R7e5+", "Bxe7?", "4.6]", "R2xe4", "-5.36]", "N7g6+", "Qxf4?!", "Qd7+??", "Qf5#", "Bc3#", "-9.81]", "-9.78]", "-10.26]", "Ned2+", "R2g7", "-5.72]", "-8.7]", "-6.94]", "R6e3+", "Rhxe3", "4.39]", "Ref1+", "5.35]", "-10.68]", "Rexa5", "Qb3+?", "11.06]", "Nxb4?", "Raxb7+", "Kd2??", "Rhc7+", "R6xg4", "7.91]", "R6f5+", "Bxa3?", "Qbb5", "Rfxc4", "Rcb1+", "Qe6??", "Rga7", "Reg2+", "R6xf4", "gxf1=Q", "Ke8??", "Raxc3+", "8.49]", "8.35]", "8.01]", "Nfxh5", "Rdxg7", "Rfxg7+", "Qxf3??", "-9.1]", "Kh2+", "10.75]", "11.83]", "N6xb5", "Ndc1", "R2xf5", "6.92]", "12.53]", "12.29]", "10.98]", "-7.4]", "-4.49]", "-4.9]", "Kg6+", "Rf1?", "4.44]", "-6.27]", "-6.1]", "Qe5??", "Rfxc5", "Rbg7", "Rfxc2+", "R5xc2", "Rfxh3+", "Qxf3#", "R8g4+", "gxf5?!", "Qh6?!", "9.18]", "9.05]", "R3h7", "11.72]", "Nxc6??", "Rxf3#", "Qb4??", "-7.96]", "Nhxg7", "Nf4??", "Rdxa2", "Qd5#", "N7d6+", "Nxd2?!", "Rgxg6+", "Rgxe6", "Rgc1+", "Bh5??", "N5xh3", "Ncxa4", "Rexb3", "Qb5+?", "8.13]", "Ndc5+", "Rhxc7+", "6.0]", "7.88]", "R2xc6", "Rgb2+", "R1xa6", "R5d6+", "Rfa5", "R8a2", "-6.92]", "Bxc7??", "Rcxd4+", "Rfxg3", "Rch6", "Rfxd7+", "R4xb5", "bxc8=Q", "h5??", "-11.47]", "R6xd7", "-4.19]", "-7.58]", "Nbd2+", "Rad7+", "6.08]", "R2g3+", "-11.56]", "7.2]", "N2f3+", "R4f3+", "Qd8??", "Ba2?!", "R2xa4", "8.18]", "8.03]", "7.15]", "Rfb2+", "Rfb7+", "R2xa3", "R5xb6", "Qxd6?", "Rdxe5+", "Bxh3?", "7.67]", "7.66]", "-9.35]", "-11.92]", "-4.82]", "Ncb6+", "Ndxc1", "4.9]", "Kf4+", "R3c4+", "Kc6+", "5.73]", "-7.33]", "Nbxc1", "Rae2+", "R7xc5", "cxb6?!", "Rgxe7+", "6.9]", "Qe4??", "bxa6?!", "-9.94]", "Nd6+??", "Nbd5+", "Rhe7+", "Nc7?!", "Nfg7", "Bxd2+?!", "Ncxb6+", "Rdxg4", "R3g7", "9.66]", "R7xc4", "Ndxb3", "-5.51]", "-4.21]", "Rbg2", 