{"vocab": ["<PAD>", "<UNK>", "{", "[%eval", "}", "O-O", "Nf3", "e4", "Nf6", "d4", "e5", "d5", "Nc3", "Nc6", "e6", "c5", "c4", "d6", "c6", "Be7", "c3", "g6", "f4", "h3", "a6", "h6", "Bd3", "exd5", "b5", "Bc4", "d3", "Bg5", "f5", "Be3", "e3", "Ne5", "a3", "b4", "cxd4", "Be2", "g3", "Bg4", "Ne4", "Nxe5", "Nxd4", "b6", "Bg7", "dxe5", "Nd5", "Bd6", "b3", "Re1", "a4", "O-O-O", "a5", "f6", "g4", "Nxe4", "Bd7", "cxd5", "g5", "h4", "Nd7", "h5", "Bb7", "Bf4", "Be6", "f3", "Qe2", "Re8", "Nd4", "Nxd5", "exd4", "Bc5", "Bd2", "Bxf6", "Qc7", "Qe7", "Qd2", "Nd2", "Bf5", "Bxf3", "dxe4", "Ne7", "Bb5", "Bg2", "Qf3", "Qd7", "Ng5", "1...", "2...", "3...", "4...", "5...", "Qc2", "Bb4", "Bb2", "Ne2", "Rc8", "Nbd7", "Qf6", "Qb6", "Nf5", "Kh1", "Ng4", "Qxd5", "Bxe5", "Rc1", "Qd3", "Qxd4", "Nbd2", "Nc5", "Rd8", "Kh8", "Nc4", "Rd1", "Bxe4", "Rb8", "fxe5", "Nf4", "bxc3", "Bb3", "bxc6", "Qb3", "Bxd5", "dxc4", "Bxc6", "Rad1", "Qd6", "Rb1", "Ke7", "Bxc3", "Kg7", "Bxd4", "Nb5", "dxc5", "Kf8", "Bxc4", "Bf6", "Qg4", "Ng6", "Qxf3", "Qh5", "Ng3", "Nh5", "Nb6", "Nxc6", "Nb4", "Kf7", "Rad8", "Rf8", "Kg2", "Qg3", "Qe3", "Kf1", "exf5", "Qa5", "Bg3", "Qg5", "fxe4", "Rf1", "Qxf6", "Bh4", "Kf2", "Bf3", "Qh4", "Ke2", "Kd7", "Nh4", "Bxc5", "Bh6", "Bg6", "exf4", "Nxc3", "Rfe1", "Qd8", "Rg8", "Bxf4", "axb5", "Na5", "Qg6", "Qxe5", "Bh5", "Bxf5", "Be4", "Nb3", "Bc6", "Bd4", "gxf6", "Kh2", "Ba6", "Bb6", "gxf3", "fxe6", "Kh7", "Bd5", "Kg8", "Qxe4", "Qxd6", "Rfe8", "Rg1", "Ne3", "Bb5+", "Be5", "Qf4", "axb4", "Rac1", "Qxd3", "Rd7", "Rd2", "Bxd6", "Qe6", "Rac8", "Bxe6", "Qd5", "Na4", "exf6", "Kd2", "bxc4", "Bc2", "Ne6", "Bxe7", "Rxd8", "Qc6", "Re2", "Rae1", "Nd6", "Qd1", "hxg5", "Qf5", "Bxg5", "Nh6", "Bc3", "hxg6", "Kb1", "bxc5", "Qa4", "Nxc4", "Qd4", "Kg1", "Rxd1", "Kb8", "Qc3", "Re7", "Nd3", "Na6", "hxg4", "Bxd3", "Rfd1", "Qe4", "Bb4+", "Kd8", "Nxf6", "Na3", "Qxe7", "Rf7", "Rae8", "Bh3", "Ba3", "Rfd8", "Qe5", "dxc6", "Qxb2", "Nxd7", "Rf2", "Nge7", "Nxc5", "fxe3", "Nxf6+", "Ba4", "Rxe5", "Qf2", "exd6", "Bxg4", "Qxc3", "gxf5", "Nxe6", "Kc7", "Nxe3", "Rc7", "Bxe2", "Qb4", "Bxh6", "Ke8", "Nxf3+", "Qc5", "Nh3", "Bxe3", "fxg6", "Qxc4", "Qxb7", "0.18]", "Qxg5", "Qxd7", "Bxg7", "cxb5", "Qc4", "0.17]", "Qe8", "Nge2", "Qh3", "Qf7", "Rxe4", "Rc2", "Nxf4", "Qe1", "Re3", "Bxc3+", "0.2]", "Rf3", "Nxg5", "dxc3", "Qxc6", "0.22]", "Bxb5", "Rxd4", "0.25]", "Qb5", "Nxf3", "Rxd5", "0.15]", "Nxf5", "Kxf7", "Qxc5", "Rab1", "Nxg4", "Ra8", "Qxe2", "Qxg4", "0.24]", "hxg3", "Qc8", "Kd1", "Nc7", "Qh6", "Qxf4", "Bxc6+", "Rxe8", "Rd3", "axb3", "Bf8", "Qh5+", "0.27]", "cxd6", "cxb4", "Bc7", "Rab8", "Rxf7", "Kxg7", "gxf4", "Bxb4", "Nxd3", "Ra1", "Rxf6", "Kc2", "Re6", "Nxf7", "Nxd2", "0.29]", "Rxe1", "cxd3", "Bc8", "Kf6", "Bxh3", "Qxf5", "Rd6", "Qxd2", "dxe6", "0.0]", "Bxb2", "Qb7", "Rxf3", "0.13]", "Rxd6", "Ba5", "Rf6", "axb6", "Nh2", "Nxb5", "Nxd6", "Rxc1", "Qxe3", "Nc2", "fxg3", "Bxf7+", "Ke6", "Qc1", "Qa5+", "Rxe6", "Bxd7+", "Rxb2", "Rxb7", "Ke3", "exf3", "Bxb7", "Kg6", "Qxe6", "Ke1", "fxg5", "Rxf2", "Rh8", "0.12]", "Nxg6", "Bxg2", "Rxe7", "Rxc8", "0.31]", "Rxf5", "Ngf6", "Rxd3", "Qh4+", "Rxd7", "Rxe3", "Kf3", "Rxf4", "Qa4+", "Bf2", "Ra7", "Kd6", "Qxc2", "Kg3", "0.21]", "0.32]", "0.16]", "0.19]", "Bf1", "Bxa6", "Qb2", "Rg3", "Ne8", "Re5", "Nh7", "gxh6", "Bc1", "Re4", "Rxc3", "Kc8", "Nxb4", "Nf7", "fxg4", "Ba2", "Bxg6", "0.23]", "Qg7", "Rd4", "Bxd7", "0.26]", "Rd5", "Rh1", "Rxd2", "Bxf8", "Re1+", "Rfc8", "0.1]", "Kxd8", "Nxe7", "Rxc6", "Qxd8+", "Qxc7", "Rxf8", "Qxa2", "0.28]", "Rxc2", "0.14]", "Qa3", "Nf8", "Ra2", "Rg6", "0.34]", "Nxg3", "Rxc7", "Kxf2", "Nf1", "Kxg2", "Qxa7", "Rxa7", "Qxb5", "Qxb4", "Rfc1", "Rf5", "Rxe8+", "Qg2", "Rxf1", "Rf4", "Kd3", "Qa6", "Rxe1+", "Rxd8+", "Rxe2", "Rb7", "Nfd7", "Rxc4", "Bxf1", "Rxa1", "Rxd1+", "Rc6", "Qe6+", "Rxa8", "Bxd2", "Kb7", "Rc3", "Rxa2", "0.3]", "Rhe1", "gxh3", "Qxd1+", "0.08]", "Re8+", "Nf6+", "Rb2", "Bxd2+", "Qxd8", "Nxf2", "Rc4", "Ngf3", "Qxh6", "Rh3", "Qxh5", "Nxb3", "Bxg3", "Kc6", "Qxh4", "Qb8", "gxh5", "Nf2", "Qxg7", "Bxa8", "Rxc5", "Nb8", "0.36]", "Bxd8", "Bf7", "Qxe5+", "Bxf2+", "Bxa1", "Kxd1", "Bxa3", "Qe5+", "Qxd1", "Kc1", "cxb3", "Nd6+", "0.05]", "Rc5", "Qg5+", "Qxb6", "Rb3", "Qg4+", "0.11]", "Rd1+", "Nxe2", "Qxe6+", "Rhe8", "Ne1", "Qd4+", "Rb6", "Bxd1", "Qxb3", "Rxf1+", "Bc5+", "cxb6", "Qxa8", "0.06]", "0.37]", "Qxf7", "Qxe4+", "Qxh3", "Rxf8+", "Kb2", "Bb1", "Rg7", "Nxb6", "Qxg2", "Bxc7", "Qe4+", "Qxg6", "Qe3+", "bxa4", "Bxc2", "Nf3+", "Qf8", "Kh6", "Rg4", "Rxa6", "bxa5", "0.03]", "Kxf8", "Qxf7+", "0.33]", "Rh6", "Rh7", "Bxb6", "Bxh4", "Qb1", "Kxf1", "Raf1", "Ra3", "Qxa1", "0.39]", "Qd5+", "0.07]", "dxe3", "Nxe7+", "Nxf8", "0.01]", "Rg2", "Rh4", "Ng8", "exd3", "Qc5+", "Bd8", "Nxh4", "Rg5", "Ne2+", "Nxa8", "Be8", "Nbc6", "Qb5+", "0.35]", "Rd8+", "Nb1", "Bxb3", "Raf8", "Nxd8", "Qb6+", "Nxc2", "Ra6", "Rh5", "0.41]", "Rb4", "Kc3", "Bh2", "gxh4", "Qxg3", "bxa6", "Rde1", "Qb4+", "bxa3", "Nxh5", "Ne7+", "Qf1", "Kb6", "Kxd7", "Nxc7", "Qxf2", "Nxd1", "0.09]", "Qxa6", "Qf4+", "Qxa5", "Qxa4", "Rhg8", "Qxf2+", "Qf5+", "-0.03]", "Ba7", "Bxh5", "Rxb1", "Rh2", "Qe2+", "Nxb2", "Qxe3+", "Qxa3", "Bd1", "Nxb7", "Bxa7", "Rxb8", "Rxa5", "Ra4", "Rxa4", "Rxg7", "Nxf1", "0.43]", "Bxf7", "Rhf8", "Qf3+", "Kh3", "Ra5", "Rxa3", "Rhg1", "-0.01]", "Rb5", "0.44]", "Kxe7", "Qc4+", "Nxa1", "Nce7", "Nd3+", "Nxd3+", "Qxd4+", "Nd1", "-0.05]", "Qa7", "Nxd6+", "Bc4+", "Rde8", "0.46]", "Nd8", "Qe7+", "0.38]", "Nce2", "0.48]", "Nbc3", "Nxe2+", "Nfd2", "Qxh7", "0.53]", "Rxb5", "0.51]", "Qg6+", "Ne5+", "Ng5+", "Rhf1", "-0.06]", "Bxa4", "Rxg2", "Qxf8", "Ndf3", "Qg3+", "Rxh6", "-0.08]", "Nxh8", "Qf6+", "Ng1", "Bxa2", "0.5]", "Red1", "Rhd8", "Bxh8", "Bxh7+", "Bxc1", "Rxh7", "Rhd1", "Rxh5", "Be1", "Rxb4", "Kxd2", "Rxh8", "Bg5+", "0.04]", "0.02]", "Qxe2+", "Kxe2", "Qxe7+", "Rxh4", "Bxf2", "Qxe8", "Kf5", "Qxd5+", "Nc8", "Qxh8", "Kb3", "Bh7", "Rxh3", "-0.1]", "Qf7+", "Bxe6+", "Rxg5", "0.55]", "Ndf6", "0.4]", "Ng7", "Nxa4", "Bxc8", "Qxc6+", "Rfb1", "Qb3+", "Kg5", "Kxh7", "Qxe1", "0.58]", "Nxc8", "Qa2", "Qxg6+", "0.56]", "Rfb8", "Nc7+", "Qh6+", "Qxc3+", "Kf4", "Rxg4", "Ne4+", "-0.12]", "Rxb3", "Qc6+", "Nxa6", "Rxh1", "-0.02]", "Bd4+", "Na7", "Qxh2", "Rxb6", "Qxc8", "Nxc7+", "0.6]", "Rxh2", "Bxa5", "0.62]", "Nb7", "0.42]", "Bxh2+", "Rcd1", "Nxg7", "-0.13]", "Kg4", "Nf7+", "Bxh1", "Nd5+", "Nf2+", "Rcd8", "Ka8", "-0.04]", "Qh7", "Nxa5", "Qh2", "Nc1", "Bxd4+", "Qxd7+", "Qxf1", "0.45]", "Nxe1", "Nf4+", "Qc3+", "Bb8", "Qxc1", "-0.15]", "Rxg8", "Bg4+", "Ng4+", "-0.07]", "-0.18]", "Nxc2+", "Bxe3+", "Qxd2+", "Nxc1", "Rc1+", "Kc5", "Nd4+", "Red8", "-0.17]", "0.49]", "Ke5", "Nf5+", "Qd6+", "Nxe8", "Ke4", "0.63]", "Bxe1", "Nxh7", "Ne6+", "Qh3+", "0.47]", "Ka1", "Nb2", "Qxg3+", "Rdg1", "Rdf1", "Kxh2", "Ka7", "Nxh6", "Rxg6", "Qa1+", "Kxf6", "Bf4+", "0.65]", "Qxh1", "0.52]", "Nxa3", "Rf8+", "Be6+", "Rf1+", "Qh7+", "Qd3+", "Bxb8", "Rc8+", "0.54]", "Nxa7", "-0.2]", "Rdf8", "Qxg5+", "Na2", "Qf2+", "Ng2", "Qa8+", "Rdg8", "Rd7+", "Bd5+", "Be3+", "Rxc1+", "Rxg3", "Qxf6+", "Qe1+", "Nxg2", "Bxe8", "Qc1+", "Nc2+", "Rxc8+", "-0.22]", "Qh1+", "Bxd5+", "Qxg4+", "0.68]", "Kd4", "Rxg7+", "-0.24]", "-0.25]", "Qe8+", "Kd5", "Rxg2+", "Bh4+", "0.57]", "Ne3+", "Bxf6+", "Qh8+", "Nxh2", "-0.09]", "Bf5+", "Nxh1", "0.61]", "Qxh7+", "Qxe1+", "Kc4", "Rbc8", "Rg1+", "Nce5", "Nce4", "Bxb1", "Nxa2", "Kxf3", "Kh5", "Qxg2#", "Qxf3+", "Rg8+", "Ng6+", "Rxg1", "Re7+", "Rd2+", "-0.27]", "Rxf7+", "Qd1+", "Rxe7+", "0.67]", "Qxe8+", "Rbd1", "Qc8+", "Qa8", "Qd8+", "0.59]", "Ka2", "-0.11]", "Rbd8", "e5?!", "Bxh7", "Nxh3", "Kxe6", "Qc7+", "Kxe8", "Rbc1", "Qxf7#", "Bxf3+", "Kh4", "-0.16]", "-0.14]", "Qxg7+", "Bxg8", "Qh2+", "Qg8", "Qxh2+", "Qxf8+", "Qxf4+", "Nbd5", "-0.29]", "Ng3+", "Re2+", "-0.32]", "Bh5+", "Qc2+", "Qxh7#", "Qxa8+", "Qa1", "O-O-O+", "Bxb5+", "f4?!", "Nh6+", "Ka6", "Nxe5+", "Kb5", "Qxa1+", "Qxg2+", "Rxf2+", "Qxc5+", "Qxg7#", "Kxd6", "0.64]", "exf7+", "d7", "Kxe3", "Nh3+", "Rf7+", "Qd7+", "Qxb8", "0.72]", "Kxe1", "Bh6+", "0.7]", "-0.31]", "Nxe6+", "-0.19]", "Kxc7", "Rb1+", "Nc5+", "-0.21]", "Ba8", "Nxf7+", "Qb1+", "Ra8+", "Qb8+", "Rec1", "Rce1", "Ra1+", "Raxd1", "Rh1+", "Qd2+", "-0.34]", "Ncxe5", "Be5+", "Raxd8", "Rh8+", "Qg1", "Bg6+", "Bxh2", "Kb4", "Qxb1", "Rce8", "Nc4+", "Qxc1+", "Bh8", "-0.37]", "cxb2", "-0.23]", "Rc7+", "Rb8+", "Nfd5", "Qxf5+", "-0.26]", "Nc6+", "d2", "Rc2+", "0.74]", "-0.28]", "-0.36]", "Rxe5+", "Rag8", "Nxh3+", "Rxe6+", "fxg7", "0.75]", "Qg7#", "Qxc4+", "Qa6+", "Kxb7", "Bh3+", "Qa3+", "Qf7#", "-0.41]", "Ngxe5", "Qxd6+", "Bd6+", "Qxc7+", "Qb7+", "-0.39]", "Qg7+", "Qxb5+", "0.66]", "Bxg6+", "Kxb2", "Qxf1+", "Bxb4+", "Rag1", "Ba6+", "Rxe2+", "Kxd3", "Nge5", "Ncxe4", "Nge4", "Ka3", "0.69]", "Nc3+", "0.77]", "d5?!", "e7", "Rec8", "Rf2+", "Qb2+", "Qxh3+", "Neg5", "Qxc2+", "-0.3]", "Nxf2+", "Qxh6+", "Qxh8+", "Bxc5+", "Kxc2", "-0.43]", "Qxh2#", "Ka5", "Nbd4", "Qf1+", "Nfd4", "Qf8+", "Nxh6+", "Rbe1", "Bc4?!", "Be4+", "exf6+", "Nec6", "Qg8+", "-0.44]", "Qxb7+", "Nbxd2", "g6?!", "Qh7#", "Rbe8", "Nxb8", "Qg2#", "Ndb5", "Qg2+", "Kxg6", "Rg3+", "-0.33]", "Ba3+", "Rxd7+", "Bc6+", "Nd7+", "Kxc6", "Qxb2+", "Bh7+", "0.79]", "Nde5", "Qxb4+", "Bxg2+", "Nxg7+", "Nxe4+", "Ba1", "Rg2+", "Nxb1", "Rhc8", "Nxe3+", "Kxg3", "Rhc1", "Nc3?!", "Qg1+", "Rd6+", "Bd3+", "-0.48]", "e2", "Ndxe5", "Rxe4+", "Bc3+", "Nb5+", "Qxh5+", "c2", "0.71]", "Ba4+", "Qxg8", "Nbxd7", "Bxg1", "-0.35]", "0.81]", "Qxf2#", "Rdc8", "Nf3?!", "cxb7", "Nde4", "Rh7+", "Rfa8", "Bh2+", "Nc6?!", "Qxc8+", "Nfxd4", "c7", "-0.46]", "Nb6+", "Rdd7", "Rg7+", "Kxe5", "Bxg3+", "Qxh4+", "0.87]", "Qh8", "Rdh1", "Nd2+", "Rxc7+", "Bg1", "Rxc2+", "fxg2", "0.86]", "Qxh1+", "Qxg8+", "c4+", "Rdc1", "a7", "Neg4", "Nh5+", "Bxg7+", "Nhf6", "Bxe5+", "Nxc6+", "Nf6?!", "Bf7+", "-0.38]", "Nxg8", "Rxg3+", "Rh2+", "Nxg6+", "0.73]", "dxe7", "-0.53]", "-0.5]", "Rfa1", "Rxd2+", "0.82]", "0.84]", "Bg3+", "d3?!", "Nh4+", "Ree1", "Bh1", "Rb7+", "-0.51]", "Bxf4+", "Ka4", "Bxg5+", "-0.45]", "Nxc3+", "Qxd3+", "d6?!", "exf2+", "Bf6+", "Rxh7+", "dxc7", "0.76]", "Kxg8", "Qh2#", "Nxa7+", "Nxg3+", "Rxg8+", "Nb3+", "Raxc8", "-0.4]", "d6+", "Rxe3+", "Kxh6", "Qxb1+", "Bxf5+", "Nxf4+", "Ngxe4", "N7f6", "Bg8", "f3?!", "Rxg1+", "Rdh8", "f6?!", "-0.55]", "e6+", "Bxd6+", "Nxd5+", "Re3+", "Qf3?!", "Rdd1", "Bxe7+", "Re6+", "Nxf5+", "Bxe4+", "Rg6+", "Rxg6+", "Rxb1+", "Bb6+", "Kxc3", "f5+", "Kxe4", "Rxf6+", "Nde2", "0.89]", "Qf2#", "0.8]", "Rg4+", "d4?!", "Ned5", "Raxc1", "-0.42]", "Rxb2+", "Nxg1", "Nb4+", "Nfg5", "Qxg1+", "Nec3", "Bxc4+", "a2", "Qa7+", "Rdd8", "d3+", "Rd3+", "Rb2+", "c5?!", "c5+", "g4+", "0.91]", "Nfe5", "Rfe1+", "Bf3+", "Nxg2+", "Rxh2+", "N8d7", "Bxb7+", "Rdd2", "Ndxe4", "Ncd7", "Qxb8+", "g5+", "Nef6", "Ned4", "N2f3", "Ref1", "Nxa2+", "Nxd4+", "Ree7", "Rfxd8", "c3?!", "Rxb8+", "0.83]", "-0.58]", "0.78]", "Rg5+", "Kxh8", "0.93]", "Qh1", "Kxh3", "Bf2+", "Rxb7+", "-0.6]", "e5+", "Kxf4", "Ree2", "-0.49]", "b2", "gxf7+", "Kxd5", "Ref8", "Bxb2+", "Ned7", "Rf3+", "Bxd3+", "Kxg5", "f6+", "Ree8", "Qh8#", "-0.47]", "f4+", "-0.56]", "Ncd5", "-0.62]", "0.94]", "Bb3+", "Kxg4", "Nfe4", "Bxg4+", "Kxg1", "e4?!", "Qxa7+", "Nbxd5", "g3?!", "Qa2+", "0.85]", "Reb1", "Nxb3+", "Nfxd5", "Nxb6+", "Rff1", "Kxc8", "Rad1+", "0.98]", "Rf6+", "Qh1#", "f5?!", "Rxg4+", "Ra7+", "Ba5+", "Rxc6+", "-0.52]", "Rxf3+", "Rcc7", "Rfxd1", "Nef3", "Bxe2+", "-0.54]", "e6?!", "hxg7", "-0.63]", "Rxd6+", "Kxc5", "Rff8", "Ncd4", "Ncd2", "Qxa2+", "Bc5?!", "Nexd4", "Nxg4+", "Ncxd4", "Rxg5+", "exf3+", "Ra2+", "1.0]", "Qf6?!", "c6?!", "hxg2", "Nfg4", "Rxd3+", "Rh3+", "0.96]", "Rxd4+", "b7", "d4+", "0.92]", "Reb8", "Re4+", "Nxg5+", "0.88]", "Rxc3+", "b4?!", "Kxd4", "Rah8", "Ned2", "exd6+", "-0.67]", "Kxc1", "Raa8", "Kxh1", "Qxg1", "1.01]", "Nexd5", "Kxf5", "exd5+", "-0.65]", "Nbxd4", "c4?!", "b4+", "Rhb8", "Nhf3", "Rfe8+", "Qxa6+", "h6+", "dxc2", "Qxb6+", "d5+", "Ndb4", "Rxf4+", "N1d2", "Rf4+", "-0.57]", "h5+", "Nh8", "gxh7+", "Re5+", "Rxh3+", "e4+", "Rxd5+", "Nf3?", "Rcc1", "Rxa8+", "1.05]", "hxg6+", "Nxd7+", "1.03]", "f3+", "Rah1", "b6?!", "-0.68]", "Kxc4", "fxe7", "Rgf8", "Rcf8", "1.06]", "Rcc2", "Rcc8", "-0.74]", "Rxh8+", "Nxf8+", "Ng2+", "e3+", "Ngxe2", "-0.81]", "e3?!", "N6d7", "h4+", "exd7", "Rcf1", "1.13]", "Rh6+", "0.9]", "Nfxe4", "-0.7]", "1.08]", "Bg4?!", "-0.72]", "Rd5+", "Rbb8", "e5?", "Rad8+", "Ng7+", "Rge1", "Kxa7", "1.17]", "b5+", "O-O?!", "Bg5?!", "Rc3+", "dxe2", "Rf5+", "Rd4+", "dxc3+", "gxh2+", "0.97]", "1.15]", "h6?!", "Rxh6+", "Rbb1", "h3+", "dxc6+", "Kxb6", "Rhb1", "N7b6", "Rge8", "Rff2", "Qd8#", "Rbf8", "Rac1+", "Rxf5+", "Nh1", "Nxd2+", "b3?!", "Nef5", "Rh5+", "1.12]", "Raa1", "R1d2", "Ngxe7", "fxg6+", "Qxa3+", "Rc6+", "Nxe8+", "0.99]", "-0.61]", "Qxf8#", "Nhf5", "Qxf1#", "Bxh6+", "Kxh5", "Na8", "Re8#", "Ne8+", "g6+", "Be3?!", "Nxf1+", "g3+", "-0.59]", "Nfxe5", "gxf2+", "-0.77]", "N1c3", "Ncb5", "d4?", "h7", "Rd8#", "Rdb8", "Qe1#", "Qe2?!", "-0.64]", "fxe5+", "-0.87]", "Bd3?!", "-0.75]", "Rxa7+", "1.1]", "Rbf1", "Qxe1#", "0.95]", "Nxc8+", "1.24]", "f7", "Nhf4", "Nxd8+", "-0.86]", "Rxa2+", "Rxh1+", "-0.71]", "Rgf1", "Be7+", "Re1#", "g4?!", "-0.79]", "Ncb4", "fxe6+", "Nxh7+", "fxg3+", "Qc7#", "R1e2", "Qe8#", "-0.66]", "exd4+", "1.22]", "f6?", "-0.84]", "Rh4+", "Bb7+", "Rxa1+", "Nef4", "Qxb3+", "hxg3+", "Bxh4+", "Ncxd5", "N5f6", "Nxh8+", "Nxe1+", "b5?!", "R8d7", "Red2", "Nfe7", "Bxc7+", "a4+", "Kxb3", "Rd1#", "f5?", "a6?!", "cxb7+", "N4f3", "h3?!", "Rcb8", "Nxc4+", "exd7+", "Rff7", "Rhe1+", "h2", "Bxh5+", "Kxh4", "-0.69]", "Bc7+", "Ndc4", "Ng5?!", "1.34]", "Rde2", "Rb6+", "Kxb5", "1.18]", "Qxe7#", "Rac8+", "-0.82]", "Nde7", "-0.73]", "N1e2", "f2", "Kxa2", "dxe6+", "Qxa4+", "Qxb2#", "1.07]", "Rc5+", "Na1", "Nxd1+", "Rae1+", "1.02]", "Rc4+", "Red7", "Nc3?", "g7", "Ndc5", "-0.89]", "Rdb1", "exf7", "-0.91]", "1.04]", "Qe2#", "dxe5+", "Qb2#", "-0.78]", "Kxb4", "Nac3", "1.16]", "Bg7+", "Rh1#", "Qxe8#", "Qxb7#", "1.2]", "Bb2+", "1.32]", "Rxb6+", "f7+", "1.19]", "exf4+", "Bd2+", "Rhe8+", "Bxh3+", "R8f7", "Bd7+", "Nxc5+", "Na4+", "R8e7", "h2+", "Bf4?!", "c3+", "fxe4+", "1.09]", "Rb3+", "axb2", "Rxc4+", "Nxh2+", "Rxf1#", "Rde7", "Nac5", "Qf8#", "Bxf7+?", "Nc6?", "Rgd1", "-0.85]", "1.27]", "Rcb1", "Rxh4+", "Be7?!", "d5?", "d7+", "Rgd8", "Nf6?", "Qe7#", "Nxh5+", "R1f2", "N1h2", "fxg4+", "Qxc7#", "1.21]", "Qa8#", "Be2+", "bxc2", "Rxh5+", "Rh8#", "gxf6+", "gxf3+", "-0.93]", "Ra3+", "Qxa5+", "e7+", "dxe3+", "d3?", "Nxb7+", "h7+", "Rfe7", "-0.94]", "cxb2+", "a3?!", "Qxd7#", "Qxd8#", "Qh5?!", "Qd1#", "bxc7", "hxg5+", "axb7", "b3+", "Bg2+", "N8e7", "Nfe2", "a5+", "1.37]", "f3?", "-0.83]", "Be2?!", "Rbb7", "Rxf8#", "Bxc2+", "-0.8]", "1.25]", "Nxc1+", "fxe2", "1.31]", "Ndc3", "Qe7?!", "Qf1#", "Nac4", "Na5+", "Bxa3+", "Rxe8#", "1.14]", "Rb5+", "Na7+", "Rae8+", "Nh7+", "Nec5", "Bd6?!", "Kxa8", "Bc2+", "Rfg8", "-1.03]", "exf5+", "Qf3?", "Qxe2#", "Rcd2", "-1.08]", "-1.0]", "1.11]", "h5?!", "Rxe1#", "Qb7#", "Bf5?!", "1.23]", "Qa1#", "N7c6", "Ncxe7", "Nec4", "Rxc5+", "Rfd1+", "1.36]", "cxd7+", "Qg8#", "Qd7#", "Rfe2", "fxg7+", "exd3+", "-1.06]", "Ndc6", "1.39]", "cxd4+", "Rea1", "Ne1+", "N2g3", "Reg1", "Ref2", "a3+", "Nxd4?!", "1.26]", "N5c3", "Rb4+", "Nd4?!", "N2b3", "Ndf5", "-0.96]", "Ndxc4", "bxa7", "Ndf8", "Na2+", "-0.92]", "N7g6", "hxg4+", "-1.1]", "Ndf4", "gxh7", "Qe6#", "Raa7", "b6+", "dxe4+", "N3d2", "Rfg1", "Nac6", "Rfd2", "Kxb8", "Na3+", "Ngxf6", "c3?", "Qxc2#", "Ne5?!", "N4c6", "bxa2", "cxd7", "Ra6+", "Rxb3+", "f2+", "Rbb2", "gxf5+", "Nxb5+", "O-O?", "Rhg1+", "Rdc2", "Rf8#", "Qd2#", "Nxh1+", "g2", "-0.97]", "1.29]", "Qh4#", "Nh2+", "Bg5?", "Rhg8+", "-0.9]", "fxg5+", "Ree3", "dxe5?!", "g6?", "1.28]", "cxd2+", "-0.98]", "c6+", "c4?", "gxh2", "Nh3?!", "-1.01]", "dxc5+", "d6?", "Qxd1#", "R1c2", "Bb5?!", "Kxa4", "Bc5?", "Ndxf6", "cxd2", "Rexd1", "Rhh1", "Nxh4+", "Ndxe7", "Ndxb5", "R8c7", "-1.05]", "Rxd8#", "Bxa6+", "f4?", "e2+", "e4?", "bxc6+", "exd2+", "O-O+", "Nd8+", "Nce3", "Ngf5", "Bxb6+", "exd2", "Qg1#", "-1.12]", "Qxg6#", "g5?!", "Bd2?!", "dxc4+", "Rbxc8", "N2c3", "h4?!", "Kxb1", "Reg8", "Bc4?", "Qh5#", "Rff3", "-0.76]", "Nhg5", "Na6+", "R3f2", "Ree6", "cxd5+", "gxf4+", "Ncxe2", "Rcg1", "d2+", "Raa2", "Ref7", "Nxd5?!", "cxd6+", "Rce2", "Rxd1#", "R3e2", "Rec2", "Qg5#", "-0.99]", "-1.18]", "Qh6#", "-1.17]", "Be6?!", "R1e3", "Bd3?", "Qxh3#", "Nfxd2", "-1.2]", "bxc3+", "Nb2+", "Nfxd7", "Nbc5", "-0.88]", "-1.09]", "Rab8+", "Rfe3", "Nf1+", "Rfd8+", "N5b6", "exf8=Q+", "Rdd3", "1.48]", "Rcxd1", "g4?", "Rde3", "Raxb8", "Nxb2+", "e8=Q+", "Qh3#", "exf2", "Qc2#", "Ndxc5", "Kxa6", "Bg4?", "1.46]", "gxh6+", "hxg7+", "Kxa1", "Nexg4", "cxd3+", "Ndxf3", "hxg2+", "Nxe5?", "-1.13]", "Bg1+", "1.56]", "Ra1#", "Ne7?!", "Rhh8", "N3h4", "1.41]", "Rf1#", "Neg6", "Qc8#", "Rdf7", "Nfxg5", "-1.15]", "Rgg8", "1.51]", "Qd6#", "-1.02]", "Nf7#", "gxf7", "Nf8+", "Nd1+", "1.5]", "a8=Q", "Rcg8", "Rdg1+", "Ndxe2", "Qxh6#", "Nac7", "g5?", "Rhxf8", "Qf6#", "1.52]", "Nde3", "-1.24]", "dxc5?!", "-0.95]", "Rea8", "1.3]", "h6?", "Ra4+", "N5c6", "Rbg8", "bxc5+", "a4?!", "e3?", "Rce7", "a6+", "Rbc7", "Rcd3", "Red3", "Nce6", "R3d2", "Rfxc1", "Rfxc8", "Be2?", "Nf2#", "Qc1#", "Rxh7#", "Rgg1", "Ra8#", "Nexd7", "Rxb4+", "Nexg5", "e6?", "Kxa3", "Rcxd8", "Nhg4", "Nge6", "Rfxe8", "Qg3#", "Bd7?!", "Nh6?!", "1.53]", "Rec7", "Rbd7", "Nb7+", "Rgc8", "Nab4", "d1=Q", "R6f7", "Rdf2", "Bxf8+", "Raxb1", "c6?", "Ned3", "Nbxc6", "Qxd2#", "Nab5", "Ndf1", "1.35]", "Rde8+", "c5?", "Rfd7", "Nf3#", "Rxb5+", "Bxf1+", "a3?", "Bxf2+?", "Qg6#", "Rgh8", "Ncxb5", "Nce8", "gxh3+", "fxg2+", "Qb5#", "Bb4?!", "Rha1", "Nbxc3", "Qg4#", "N6h5", "fxe3+", "Ncd6", "Rha8", "Rdd6", "Bxa7+", "Be3?", "b3?", "Qxg8#", "Nxb4+", "Qb3?!", "Ne4?!", "c1=Q", "Nfd3", "Qe3#", "Neg3", "Rfc7", "-1.07]", "R6d7", "Rca1", "Bg6#", "1.43]", "N8c6", "Ndb8", "exd5?!", "bxc4+", "Rab1+", "N4c3", "-1.11]", "1.4]", "Nd5?!", "bxa8=Q", "axb2+", "R6e7", "Qe5#", "1.44]", "Qf3#", "d8=Q+", "Qxe6#", "1.33]", "Bxa2+", "N6d5", "b6?", "-1.04]", "Ncd3", "Nxe4?", "Ngxf7", "Bb5+?!", "Rdc7", "-1.31]", "Qb6?!", "-1.14]", "Ndb6", "1.65]", "Rfg3", "Qxc1#", "Neg5+", "1.42]", "Nxe5?!", "1.67]", "axb5+", "Rhxf1", "Rcd6", "cxb3+", "Nge3", "Qd2?!", "Rde6", "-1.27]", "Ned6", "Rbxd1", "a1=Q", "Rxh2#", "-1.22]", "Bd1+", "Kxa5", "Rxa6+", "dxc7+", "Nbc4", "Bxf3?!", "Rae2", "Nf6#", "Rbxc1", "Neg1", "Ra5+", "Raxe8", "d8=Q", "axb3+", "Ngf4", "Rad7", "Rcd7", "c2+", "1.38]", "c7+", "Qb4#", "1.55]", "N5e4", "Ne2?!", "Rbc2", "gxf2", "Rgh1", "Nd4?", "-1.43]", "-1.56]", "Rg8#", "Nba6", "N1f3", "Rfd3", "gxh4+", "1.6]", "R8f6", "N3h2", "-1.29]", "R5f7", "Nxf7?", "R6d2", "R8g7", "Rfe6", "h3?", "Qxd4?!", "R1f3", "a5?!", "Qa5+?!", "Bb5?", "R8b7", "Bg4??", "N4b3", "Rac7", "Rfxf2", "-1.21]", "Nxe4?!", "Rhf1+", "Bxf7#", "gxf1=Q+", "Rfxf7", "N4a6", "dxe4?!", "Rgg2", "Nfxg4", "R1g2", "Qxc8#", "R8d6", "Rexd8", "Ngxf3", "Ne5?", "Rexe7", "1.68]", "g3?", "Bc8+", "Rxc8#", "Bg8+", "Bxd8+", "d1=Q+", "R1e6", "g2+", "Bd8+", "g7+", "Nexf4", "Ba4?!", "f8=Q+", "Be6?", "R8e6", "Nfe6", "e1=Q+", "Bxb3+", "Rff6", "exd4?!", "N4g3", "Rba8", "Bxa4+", "Qb8#", "dxe8=Q+", "Qxf3#", "Rde1+", "1.47]", "Ncb6", "Rgc1", "Bf5?", "Bg5??", "Ref3", "-1.34]", "Nfg6", "Nxa6+", "Qf4#", "Qd5#", "Rcc3", "Qe2?", "Bg7?!", "Nb5?!", "1.66]", "Nh6?", "Rgf3", "R4e2", "Nb4?", "Ncb8", "Nexd2", "Ref6", "-1.28]", "Rfc2", "1.49]", "Nfg3", "-1.25]", "Rdg8+", "Qd3?!", "cxd8=Q+", "Ng6#", "Qxh8#", "1.7]", "cxb6+", "R1b2", "N5g6", "Rbg1", "N4d5", "cxb5+", "Nxf2#", "Nfe8", "Rhg2", "1.72]", "Rce6", "Nac2", "Rda8", "N7xf6", "R5e2", "Qd3#", "-1.32]", "dxe7+", "R4f2", "Qc7?!", "h8=Q", "Ree4", "Rb1#", "dxc4?!", "Nf3??", "Qh4+?!", "-1.6]", "-1.84]", "b5?", "R8d3", "Nd6#", "Rdf3", "Bf1+", "Rb8#", "Rba1", "Nxa3+", "1.59]", "Qe7?", "Qh4?!", "Rhh7", "-1.4]", "Qxf6#", "dxc2+", "Ng5?", "Rcb7", "Qf6?", "Rab7", "Nde6", "Bxa5+", "Ng3#", "-1.46]", "bxa1=Q", "gxh8=Q", "b8=Q", "Red5", "Qh5?", "Nh6#", "Rgg7", "Nf6??", "Nxg8+", "Qb1#", "1.63]", "Bb4+?!", "Qd4#", "Qd6?!", "Nxb8+", "-1.33]", "-1.36]", "Rda1", "Rac2", "gxf8=Q+", "Bh6#", "-2.1]", "Nexc5", "-2.44]", "Qe4#", "Nfg8", "Rh2#", "N5a3", "Rcf2", "Nxc6?!", "Rad2", "exf1=Q+", "Nfe1", "Rh4#", "c1=Q+", "Ba6?!", "R6c7", "Ncb3", "-1.48]", "Nhf7", "-1.53]", "Nbd3", "Naxc4", "1.86]", "N6e7", "Ngxe6", "Red6", "Bxf6?!", "Nxa8+", "R5d2", "Red4", "Nc8+", "Rh7#", "Bxc6?!", "-1.37]", "Rae7", "Nd3#", "Bb3?!", "Raf2", "Neg8", "Rbd2", "Bb7?!", "Ndxb4", "axb4+", "-1.23]", "R5e3", "Rbxd8", "Ncxe6", "Rcc6", "1.98]", "Rca8", "Rc1#", "Nfh5", "Ng4?!", "1.78]", "1.82]", "Qxc6#", "h1=Q", "Be1+", "R2d3", "Rde4", "Nd5#", "Nge7?!", "-1.26]", "-1.47]", "Nexf5", "Rexd4", "1.64]", "Rhf8+", "c8=Q", "1.45]", "bxc7+", "R5e7", "Raxe1", "N3e4", "Raxa7", "Nxd5?", "Rfc8+", "-3.01]", "Rge3", "Ngf8", "Qxg3#", "a6?", "N2e4", "Rg1#", "Nd7?!", "Bf8+", "Rdc3", "Rfxe1", "b1=Q+", "Bg5#", "-1.16]", "Ngh3", "Rxc1#", "Qf5#", "Bc1+", "Reg3", "Ngh6", "axb6+", "Bf7#", "Qxd5?!", "Nb4?!", "R8c4", "Rdxd7", "Rgf7", "Qxa7#", "-1.55]", "Rbc3", "Qxg1#", "R7d6", "R8c3", "Nc7#", "Raf7", "Rch1", "Bb2?!", "-1.38]", "Qd5?!", "Be7?", "Rfg7", "-1.41]", "exd8=Q+", "-2.25]", "Rde5", "bxc2+", "-1.39]", "Bf6#", "2.2]", "N3d4", "1.54]", "Rfg6", "a7+", "Ne7#", "Bh4?!", "Rbe2", "Rhg3", "exf6?!", "R1d3", "Bc4??", "gxh5+", "-1.82]", "Nfe3", "Rcc4", "R4f7", "exd1=Q+", "f1=Q+", "Bxe1+", "Qd1?!", "2.17]", "1.84]", "Rfh3", "1.58]", "Bxd1+", "N5f3", "R4d2", "Rcxc2", "Qa4+?!", "Qd7?!", "Rcf7", "2.12]", "Nbd7?!", "Red1+", "Ngxf2", "Rab3", "1.77]", "1.71]", "Ngf7", "Reh1", "Rgf6", "Nh3?", "Rxa3+", "1.81]", "Nexf7", "Nexf6", "1.74]", "d4??", "Rhe3", "N8h7", "c8=Q+", "Qa6#", "Rec3", "Rge6", "Bxf2#", "Rdd5", "Qc2?!", "b4?", "Bb4?", "Rge5", "R1d4", "Rab2", "Qxa2#", "R5e6", "cxb4+", "h8=Q+", "Rff5", "Rhd2", "Rhg7", "R1d5", "Qxg5#", "Rfd6", "d6??", "Ndc7", "g4#", "Rfb7", "Bxc6+?!", "Ng8+", "Qxe3#", "1.91]", "Qxd3#", "Nexc3", "Rxf7#", "Ref5", "Rdc6", "Nc3??", "Ba7+", "-1.5]", "Bxc4?!", "fxe4?!", "Nec8", "Rc8#", "N8f6", "R5d3", "-2.05]", "Be8+", "Rdf6", "Ba2+", "Ncxe3", "Bb5+?", "Rcb2", "R1c5", "Nbd6", "Rcxc7", "cxd4?!", "Rdxd2", "Rfh1", "Nxa1+", "-1.51]", "Ng1?!", "Ndb1", "N4f6", "Rdxe5", "-3.12]", "Rh3#", "Rxh4#", "Reg5", "R5f3", "Nc1+", "R5d7", "Be6#", "Bxf3#", "dxe5?", "Ng5??", "Neg4+", "dxc4?", "N4e5", "Bxg8+", "Ngh2", "Ndxf7", "-1.19]", "b1=Q", "1.62]", "fxe5??", "R1d7+", "1.69]", "Rec6", "bxa7+", "R3c2", "R8c6", "Rfc1+", "Nca6", "Rgf2", "Ncxb4", "Rfh8", "Nhg6", "a2+", "1.96]", "-1.3]", "Nxd4?", "R7e6", "R7c6", "R4d7", "exd1=Q", "N6e5", "f3??", "-2.08]", "Bxc8+", "Qc4#", "-2.04]", "Nd2?!", "Nexc4", "Ng4?", "Raxa2", "axb7+", "Rhf6", "-1.62]", "Nbd2?!", "Ng1+", "Qa3#", "Nba3", "Na3?!", "Raxf8", "fxe5?!", "Rhf4", "exf5?!", "1.88]", "R4e6", "Reh8", "Rhh2", "R5f2", "bxa2+", "Bxe8+", "dxc1=Q", "-1.77]", "bxa3+", "Nxf7#", "Bf5#", "Bg4#", "1.75]", "Rfxe3", "Nxf2?", "Bd6?", "Nbxc4", "R4f6", "Ng3?!", "gxh1=Q", "Rgd7", "R1e4", "Ngf1", "b8=Q+", "1.97]", "R8c5", "R5e4", "-1.68]", "Rf7#", "-3.15]", "-3.39]", "-2.48]", "Raa3", "Rgb8", "R5f4", "Nfh4", "Qh5+?!", "d5??", "Rdxe7", "Ng8?!", "1.57]", "1.61]", "Bg2?!", "e8=Q", "Ba4?", "1.76]", "Nhxf3", "Rcc5", "Ne4?", "dxe1=Q+", "2.03]", "Rff4", "-1.67]", "Nexc6", "R1d6", "N5d4", "Ndxf2", "-1.81]", "Rcxd4", "-1.72]", "Bb5#", "Rbe7", "Nfe5+", "Rbb3", "Qe2+?!", "Qxh4#", "Qc3#", "Rch8", "e6??", "Qb3#", "Nhxg5", "Rcd5", "-2.86]", "1.73]", "Rce3", "Nxg1+", "Nxc7#", "-1.44]", "Qb3?", "Nd5?", "R8e3", "-2.15]", "-1.35]", "Rdxe6", "R8d5", "-2.22]", "Nhxg4", "R5c2", "Rbc6", "Ree5", "-1.45]", "Rhf3", "Re1?!", "Rxg8#", "Nce1", "Rxa7#", "Bxd5?!", "Na5?!", "Bd2?", "fxg8=Q", "Bc5#", "2.59]", "Rhg6", "a1=Q+", "R6d3", "Qa4?!", "Bxf6#", "2.51]", "N6a5", "Nhxf6", "Rac6", "exf3?!", "-1.99]", "1.85]", "Ba5?!", "-3.16]", "R1b3", "Nhxf4", "Ned6+", "Nfg1", "Rhxg8", "R1f7+", "Nhxf5", "2.0]", "Nhf8", "Ndxf4", "3.72]", "R4d3", "Reg6", "fxe5?", "R1e6+", "N3a4", "Rxh3#", "Nef6+", "1.83]", "Rbh8", "-2.18]", "-2.0]", "-1.9]", "Qxh5#", "Qa4#", "Rdd4", "Nh3#", "Rcd4", "dxc8=Q+", "3.24]", "Rhh3", "Nbxd6", "Rbc1+", "Qb6?", "Be7??", "Ngh4", "Ngxe3", "Bf4?", "Rgf2+", "1.87]", "Qa2#", "R3f4", "-2.98]", "dxc8=Q", "Bb8+", "Rbxb7", "Qxg4#", "dxc3?!", "fxe8=Q+", "Bf3#", "-3.1]", "-3.18]", "R6d4", "Rgxg7+", "Nge2?!", "-1.98]", "Naxc6", "Nef3+", "Rag1+", "R8d4", "Nhf1", "Qxb5#", "-1.75]", "-1.64]", "Rdxe8", "Nhf6+", "Rfc3", "R1g3", "3.06]", "Rgh3", "Rac4", "Qxf5#", "Nc6??", "Kf1+", "Nfd6", "-1.87]", "Ngh7", "Rfe5", "Rbxb2", "Qxb1#", "Rdc5", "Rf2#", "a8=Q+", "-2.58]", "1.94]", "2.63]", "Rbf2", "R7d5", "R7d2", "Nbc7", "R4d5", "Rdf8+", "Bf2#", "cxd1=Q+", "-2.03]", "-1.89]", "-1.63]", "Rxg1#", "a4?", "Rdxe2", "Rdxd3", "Rdxd4", "1.79]", "Qb6#", "1.93]", "-3.13]", "-2.23]", "R5d6", "R8h2+", "e1=Q", "-3.56]", "-2.81]", "R3b2", "Nb5?", "-3.55]", "Ndxe3", "1.9]", "Rfe4", "R6f3", "R1a2", "2.02]", "Rab6", "-1.76]", "Rdh2", "g8=Q+", "Nxa4+", "2.76]", "Rexe3", "Rfd5", "-1.49]", "Rbh1", "h1=Q+", "R4e7", "Rgxg7", "Rdxc3", "Bg7?", "Rxf2#", "Rhd3", "Rxa5+", "-1.88]", "Rge7", "Rec5", "3.36]", "-2.36]", "O-O??", "-1.54]", "Nxf3#", "Qa7#", "R5f6", "Rdb2", "Nd4#", "3.15]", "R8a7", "Rfh4", "Ndf7", "-2.3]", "-1.65]", "Bh3??", "N2xf3", "Bb1+", "Qxa1#", "R1d7", "Rdf4", "-2.46]", "Rdh4", "Qc6#", "Bd3??", "Nbd6+", "Rbd3", "-2.5]", "Ne4#", "exd6?!", "Nxf6#", "Rba7", "cxd5?!", "Re2#", "3.84]", "Reb2", "-1.58]", "Bb6?!", "Rdg4", "R1h2", "2.32]", "Ne5#", "Nfxe6", "Rhxh7", "-1.79]", "Rexe2", "R7e5", "Rfxe7", "Rhg7+", "Rfxf6", "Bd3#", "-1.7]", "Ncxd7", "2.37]", "R3g2", "Rdg2", "Qxb4#", "Rbc5", "2.06]", "-2.77]", "hxg8=Q+", "Rbf7", "h4?", "R1c6", "-3.22]", "-1.92]", "Bh3#", "-3.32]", "Rxh6#", "Qxa6#", "R3a2", "Nd5??", "g6??", "Rgh5", "Ndf3+", "Ngf6+", "Bxg6#", "R6d5", "e5??", "Nfg5+", "Bxe5?", "-3.2]", "Qa5?!", "N3e2", "Rexc1", "Bg3#", "R4g2", "Nh5??", "Nexf2", "Rfxf5", "-1.42]", "-2.74]", "Nc2#", "Rdh6", "2.68]", "Qc5#", "Rexd6", "Ndc7+", "R1e7+", "2.15]", "bxc8=Q+", "R4c5", "Rdxf7", "g1=Q+", "R4e3", "R5b7", "b3??", "R1c3", "2.05]", "Rdxd6", "1.8]", "R1e5", "Rce4", "Nxa5+", "2.54]", "-2.95]", "-3.03]", "exd8=Q", "Nfxe7", "f8=Q", "R8d3+", "Ref4", "Rfd4", "Rgh7", "R6f4", "Rexd5", "c3??", "-1.96]", "Nca3", "2.43]", "N7d5", "Bf4#", "-2.89]", "R4c7", "N4h5", "Rexe5", "Qe4+?!", "-1.66]", "2.34]", "Na6?!", "Nexf3", "-2.29]", "Raa6", "N8xd7", "bxa6+", "R2f3", "Ba6#", "Nbxc5", "Nfe4+", "bxa8=Q+", "-1.61]", "Na5?", "R2c4", "R5d4", "-1.94]", "N5h4", "Ne2#", "Ncb1", "g8=Q", "Bxc3+?!", "Rce5", "3.2]", "R3f5", "Rfxb1", "3.03]", "2.5]", "a5?", "-2.26]", "R4c3", "-2.61]", "R6e5", "Nh8+", "Nd7#", "-2.02]", "Rgb1", "-1.69]", "-3.17]", "Nfd2?", "Rcxd2", "Rfxd3", "Bf4??", "2.39]", "Nec7", "Nde7+", "R8e4", "-3.25]", "Qf3??", "Rgf4", "Rc7#", "Nfxd3", "Re7#", "Rxh5#", "Rexc8", "Ng4#", "-3.11]", "Rdxe4", "Kf8+", "2.09]", "2.81]", "Bxe6#", "Bxb4??", "Rdb7", "Rh5#", "-1.73]", "h5?", "3.46]", "fxe7+", "Bb4+?", "Nhg3", "-2.56]", "3.51]", "Nexg6", "2.93]", "R1h3", "3.94]", "-2.06]", "#1]", "2.25]", "Rexf1", "R8e7+", "Rdxe1", "Nfd7?!", "-1.85]", "Naxc5", "-2.41]", "-4.34]", "-4.29]", "Nxd4??", "Bxc3?!", "Qd4?!", "Rxg7#", "N3xe4", "dxe2+", "2.27]", "g3??", "Rh6#", "R8d2", "-2.51]", "3.82]", "2.18]", "R5c7", "Nb6?!", "Bb4??", "Nd2?", "Rexd3", "Nfh3", "Nbc2", "-3.48]", "Ne5??", "-3.19]", "Nhf2", "2.6]", "R4f5", "R1xe3", "-3.31]", "Ne2?", "Rcf3", "-2.72]", "Bd2??", "-3.7]", "-1.95]", "-3.06]", "Rfg2", "Rcd1+", "Rdb6", "1.99]", "-1.78]", "3.39]", "-3.62]", "-2.24]", "-2.14]", "Ncd8", "-2.01]", "Rge8+", "Nb8+", "Rad3", "Bh3?!", "2.21]", "2.48]", "Qg4?!", "-1.52]", "-2.33]", "3.43]", "Ne7?", "N5f4", "R6e3", "Rag8+", "Nexf6+", "Qxc3#", "-1.59]", "R8e2", "N4b5", "Qe5?!", "f6??", "Ngf3+", "Rdh3", "Bd5?!", "Rhe5", "Ndxc6", "R3d6", "2.65]", "Rfg5", "2.58]", "Rfh6", "Bd5#", "-4.31]", "Rdxf2", "-3.5]", "2.61]", "Rfxe6", "Rbxf2", "Bxb7??", "R2e4", "Nbd3+", "R8d2+", "Rhxd8", "R8g6", "Rec4", "Na8+", "3.7]", "Rdxd8", "Ndf2", "2.71]", "Bd6#", "N3e5", "Rca7", "Ngf2", "3.48]", "Be3#", "Nca4", "dxe4?", "Raxd7", "-2.7]", "2.24]", "R6f5", "Rac3", "-3.91]", "Rdg3", "Qxd5#", "Nxc2#", "Rhf7", "Rexd7", "2.26]", "2.3]", "2.45]", "d3??", "Qg3?!", "Raf1+", "Rfxd6", "-2.75]", "Nc6#", "Rhf5", "c6??", "R8b3", "R2c7", "Raxb2", "2.01]", "-3.14]", "-2.99]", "R3e4", "Ngh5", "-2.43]", "bxa5+", "-1.74]", "Qe5+?!", "2.79]", "Ndf6+", "-2.88]", "-3.24]", "Rdg5", "R8xd7", "Bd6??", "Nb6#", "2.07]", "R7c2", "3.89]", "R7c5", "Naxc3", "Rcf6", "R1d6+", "Ndc2", "R6e2", "R2c3", "Bd7?", "Rgd3", "R6b7", "Rdg6", "h3#", "Nde2+", "3.58]", "2.1]", "Rhd7", "3.17]", "-2.93]", "2.73]", "Nce4+", "Rhh6", "Raxa4", "2.72]", "Nec1", "dxe4??", "Bd7#", "3.56]", "-2.13]", "R3c7", "Nef7", "Rge2", "Kf1?!", "R1c4", "R1xe6", "Rhxh2", "R7e3", "R5a2", "-3.41]", "Nb4#", "Nhf3+", "Rg7#", "Rexd2", "N8xe7", "Raxb7", "Bxg1+", "-2.97]", "R1g6", "Qh4?", "dxc5?", "R8f5", "Qxe5#", "Rexe6", "Rhxd1", "Bg7#", "R8b6", "Rcd8+", "-3.09]", "R5g2", "Ndxe6", "Naxb5", "N5h3", "exf8=Q", "3.37]", "Rdxd5", "Rcxc3", "2.69]", "N6h7", "Nac8", "Rdxf1", "R8h4", "Rba3", "3.11]", "Rcxc2+", "R8e3+", "R1a7", "Rgd6", "-3.34]", "Nba4", "Nab8", "-2.83]", "g5#", "Rhe2", "-2.68]", "-3.0]", "Rhxe1", "Rba4", "Nfxe3", "R2d7", "R7e4", "Nbd2?", "fxe8=Q", "N1h3", "-3.94]", "Nfxg3", "fxe2+", "Nh4?", "-3.79]", "Rcxd6", "R1f6", "2.97]", "Nef8", "-3.6]", "R8f4", "Qxa3#", "3.55]", "2.49]", "N7e6", "4.03]", "Ncxd6", "R1h7+", "R5c6", "R1b5", "Rbb5", "Nfxd6", "Qxf4#", "R1f4", "-2.84]", "Bxh8+", "Bb5??", "bxa4+", "Rbc2+", "-3.08]", "Rhg4", "Be4?!", "2.04]", "Be2??", "Raxf1", "Rbc4", "Nf4#", "Rfb3", "2.11]", "-3.36]", "Rhf2", "2.7]", "2.55]", "Bg3?!", "R8e5", "-2.54]", "7.6]", "N7b5", "Rbe1+", "Rdb4", "Rf6#", "-3.77]", "Raxa3", "-2.12]", "Rexf6", "dxe6?!", "-2.2]", "Nbc8", "N4f5", "Ndxf5", "Rhg2+", "Bc5??", "R8h7", "Rda3", "Bxb8?!", "Rcxb7", "2.33]", "Rgh6", "Rcxc6", "Rba2", "2.31]", "4.01]", "-2.67]", "4.89]", "Rda4", "3.75]", "-2.32]", "-3.49]", "2.53]", "R1e7", "Reg2", "3.29]", "#-1]", "Rgh4", "Naxb4", "R5g7", "R4c2", "Raxa6", "3.9]", "3.13]", "2.75]", "2.41]", "-3.52]", "R2e3", "Rhc1+", "Qd2?", "R1a7+", "R2f4", "Be4#", "-3.71]", "-3.76]", "exf6?", "-2.07]", "Rd4#", "Qc3?!", "Rbxc7", "Rcb6", "2.08]", "fxe1=Q+", "Rge4", "Rexf7", "dxc6?!", "Nfxd6+", "-2.66]", "Nc5#", "R8xf6", "Rhg5", "Rde2+", "h5#", "Qc3??", "2.52]", "2.78]", "2.91]", "Raa4", "cxd1=Q", "3.96]", "N2d3", "3.38]", "-2.65]", "N2f4", "R1e2+", "Bg2?", "3.25]", "Ng5#", "2.64]", "Bg7??", "Nfh6", "Rhh4", "3.31]", "-6.89]", "3.59]", "3.57]", "R8f7+", "2.77]", "Rf3#", "Rcxf2", "Rgg3", "Rhc8+", "Na4?!", "N6f5", "Rdxc7", "Rhd1+", "Ncxd2", "dxc1=Q+", "R1xd5", "2.66]", "R8g5", "Rdc4", "2.22]", "Bc6#", "R7d3", "Nab6", "Be3??", "2.88]", "Rfxf7+", "3.5]", "N4xe5", "3.22]", "axb8=Q", "-3.28]", "-4.15]", "Nde5+", "Nab2", "Nfg4+", "R8h7+", "Qc6??", "Ngxf4", "Bf5??", "4.56]", "a3??", "-3.97]", "3.32]", "Bxb1?!", "Ba3?!", "Reg4", "Ndf7+", "Rbd1+", "3.21]", "4.18]", "f1=Q", "Rae6", "Bxh6?!", "Qg5?!", "Rbg2+", "R3f7", "Nexd3", "-1.86]", "cxd4??", "Rxe7#", "Rexc5", "Nhg1", "R4f3", "Nac6+", "Rdg7", "-2.37]", "-2.82]", "Rg2#", "-2.11]", "Bh5?!", "Rdh5", "-3.07]", "Rbg7#", "Rexe7+", "Qxe4#", "R2e7", "Rad4", "Rbd6", "bxc1=Q", "Rca5", "Reb3", "Qa4+?", "Nhg4+", "2.9]", "2.82]", "bxc1=Q+", "Rfa2", "Rae3", "4.53]", "2.99]", "Rdf1+", "Rgd2", "R3d4", "Rcxf6", "R8a4", "R1xf4", "2.16]", "Rcxa3", "Rg5#", "Bh5?", "Ncd1", "Rgg6", "3.0]", "c4??", "2.28]", "-2.4]", "-2.31]", "Bb3?", "Nba5", "Neg7", "Rdh7", "b4#", "Nxd6#", "Ne7??", "hxg1=Q+", "Rgf5", "-3.42]", "Nab1", "R7e2", "R8c2", "Ke2?", "Nhg8", "7.52]", "Rcxd5", "-2.28]", "cxb8=Q", "Ncd6+", "Rexe2+", "Nxg6#", "3.95]", "3.98]", "Rfxf4", "Rcxb4", "Rgxf1", "Ne4??", "R2f6", "2.62]", "-2.96]", "R8a3", "Qg4??", "Ng6?!", "Bxf3?", "Rba6", "Rbxc6", "Bh6??", "-2.53]", "Bxf6?", "-2.71]", "Nfh7", "Bxg2#", "Rfb2", "Rbb4", "cxb8=Q+", "Be7#", "4.17]", "cxb1=Q", "Ncb7", "Nb3#", "Qxc5#", "R8f3", "Nhg7", "2.36]", "Kd7+", "f5??", "Nd4??", "R6a7", "Nbc2+", "Rfh7", "Bxc1+", "Rbxb5", "Nbxc7+", "R8e2+", "N7e5", "Nc3#", "R7g2", "-2.19]", "Nfd2?!", "Bxf7+?!", "R7f6", "2.94]", "R5g4", "Qxh1#", "Nge4+", "Rxh8#", "2.46]", "cxd4?", "N2c4", "Rbd5", "Rab4", "3.27]", "Rexf2", "Rfxe2", "Qxb8#", "2.47]", "Rcxd3", "Nab3", "Ba6?", "3.35]", "R2d5", "b7+", "-1.91]", "Nce5+", "R1d2+", "R4d6", "3.19]", "Bb6?", "R1xe2", "3.08]", "2.19]", "Rhe6", "3.18]", "3.02]", "Rcf5", "R8xd6", "Qxf3?!", "Rcg7+", "R3e7", "N1c2", "Nxh3#", "Rdg7+", "R1h4", "R8xc6", "h6??", "2.98]", "Ra4#", "-3.59]", "-3.67]", "-3.66]", "-2.09]", "Qd6?", "4.22]", "R8b5", "Bxh7#", "R6c5", "Rhxg1", "6.81]", "Nh4??", "N1xd2", "Rgxg2+", "-2.55]", "Rxa4+", "-2.63]", "-3.63]", "-3.29]", "-3.46]", "R8e2#", "Qa5+?", "4.67]", "R6c4", "R1d7#", "Bxd4?!", "-2.73]", "Nef4+", "-2.9]", "Bg2#", "Ncxa5", "N3c4", "N6c5", "R6f2", "bxa1=Q+", "N2g4", "Be2#", "Raxc3", "R8xe3", "Reb4", "-6.88]", "R8a6", "Nce3+", "Rfxe4", "R8b4", "Ncd3+", "Rcxe8", "Nfd5+", "-2.62]", "Ngxe6+", "-2.45]", "Ke1+", "Nf5#", "R7xf6", "Rgh2", "Ra5#", "Nxa7#", "Rd2#", "R1c7", "3.62]", "Ncxd3", "-2.21]", "Bc3?!", "2.29]", "Rga1", "Rxb7#", "-2.34]", "Nec6+", "Rb8?!", "N2xc3", "Bxh3?!", "3.12]", "Red7+", "-4.37]", "N6g5", "Raxa5", "3.83]", "Ncxd6+", "Rfc4", "Rxa8#", "c6#", "N8a6", "exf4?!", "Nef2+", "Rbb6", "Rexf8", "3.91]", "Rgg5", "Rad6", "Rgc3", "7.43]", "Nxg3#", "-6.82]", "gxf3?", "4.05]", "4.15]", "3.14]", "Rdxc2", "R7e6+", "gxh8=Q+", "cxd8=Q", "Rfxb2", "Nfxh4", "Nexd6", "Rdxc8", "axb8=Q+", "Nde8", "Nbxd3", "Rcg7", "Ndb5+", "Rgd4", "-2.16]", "Be5?!", "Nfd4+", "Be5#", "Rfb8+", "R2d3+", "Rhxg4", "R8c3+", "Nde4+", "R4g7", "R1xd6", "-2.27]", "Nbxc2", "Qc6?!", "R4g6", "N4h6", "-4.44]", "Nbxd3+", "Bxe4?!", "Bxg5#", "Rbe8+", "2.96]", "Qa5?", "-3.86]", "e3??", "fxg1=Q", "Nhxf6+", "Reh4", "-1.83]", "-2.39]", "3.8]", "Ncd4+", "Rbxd2", "Na6?", "Rcxc4", "R1f2+", "Rca2", "Kf6+", "Bc3#", "Rfxe5", "Nce7?", "Qf4??", "Nxe4??", "-2.35]", "Rfh5", "Rgxf2", "Ncb5+", "Rcg7#", "Nbc1", "Rhd4", "Nfd6+", "3.1]", "Rd6#", "Bf3?!", "R8h3", "Rbxb4", "R5c3", "Nfd3+", "Ngf2+", "R1h6#", "g6#", "Bd5?", "Nbc7+", "2.89]", "Rdxf8", "-2.69]", "cxb1=Q+", "Rxb8#", "e8=Q#", "Ke7+", "Rd5#", "Qe3?!", "Kg8+", "R1g4", "Rxb1#", "Bxb1+", "R8xd4", "Ngf7+", "Nfd8", "7.58]", "Rea2", "-3.61]", "R3c5", "Raxe5", "Bg3?", "R8b2+", "R2b3", "-3.58]", "Rhxc8", "Raxb6", "Nfd7?", "Nbxc7", "Rgxe7", "Ke2+", "Qe7+?!", "Rexe4", "Rexe6+", "Qg5?", "Rbxc2", "Nfh2", "N2d4", "Kxf3+", "Qb4?!", "Rhd6", "N6e4", "Rdxa6", "Bxg7#", "Rgxg2", "R1xd2", "-3.33]", "Nce7+", "Rcxe6", "R7xd6", "3.77]", "Rfe2+", "N7f5", "Ndf4+", "Nh7#", "R8a2+", "Kf7?!", "3.74]", "3.6]", "R8xd5", "gxf6?!", "Bg2??", "Rag7", "Qxb6#", "R4xf3", "Rdxd2+", "Rch4", "Rgxd8", "f4??", "Bxb4#", "R8f2+", "-3.51]", "f4#", "R3g5", "Nb8?!", "R3h2", "R6xe4", "Bxd5?", "Rhxf4", "Nh4?!", "Rg6#", "Qd8?!", "Qd6??", "Bxc3#", "5.36]", "Nh5#", "Qd3?", "Rcb3", "gxf8=Q", "R2c6", "-4.05]", "Rbe3", "N8c7", "R2g3", "3.63]", "Ned3+", "Bf1#", "2.44]", "Nxe5#", "Nxe5??", "Rfa7", "Rdc1+", "Qh5+?", "3.01]", "Na7#", "Rxg2#", "R3c4", "Rhxc1", "Nfxg6", "-2.85]", "Nh2#", "-2.78]", "Rexf5", "R1c7+", "-3.23]", "Rbf6", "Qxa8#", "-1.71]", "Re3#", "Bxe4#", "Qxd6#", "N7xe5", "N3xe5", "h6#", "N1a3", "Nb5#", "-4.11]", "Rxe2#", "fxg8=Q+", "2.56]", "Rbe4", "Rxg5#", "Nd7?", "Qf4?!", "exd5?", "Nhg6+", "4.34]", "R7g6", "Rdf2+", "-4.1]", "R6b2", "6.56]", "3.49]", "Rexc7", "Red8+", "3.81]", "Rbxb2+", "Bxd4#", "R4h2", "R7b3", "Raxc7", "Rgxf5", "Rbxe6", "Nexd6+", "Nf5?!", "Ndxf6+", "Bg6?", "8.35]", "Rcb4", "Rdxe3", "-3.02]", "Nfxe4+", "R1a6", "Rbxb6", "R1b7", "-2.76]", "N5e6", "Nhxg2", "Rfxf8", "-3.96]", "dxe5??", "-4.0]", "Qd8?", "4.61]", "Bh6?!", "Rfxc2", "Rae5", "R3b4", "3.67]", "3.47]", "Kf7?", "f7#", "Raa5", "Nh1+", "Bxe5?!", "R1a3", "Nxd8?!", "a6??", "Nfxe6+", "Qe2??", "Bxe4?", "Rec8+", "Na1+", "3.16]", "3.42]", "N7xc6", "Ngxh7", "Rag7#", "Rbxa7", "Rgxd5", "3.4]", "Nef1", "Ndxf8", "R2d4", "Rad5", "Rbxe7", "Na3?", "Qh3?", "Kf7+", "c5#", "Rcxc7+", "Bh5#", "Qxd4#", "Bb4#", "R6e4", "-6.41]", "2.95]", "Raxf2", "Nef2", "Bxd3#", "Bxe3#", "Nfe2+", "b2+", "Nb1+", "N4xd5", "5.51]", "Nce2?!", "Ngxh4", "Kc2+", "Ne3#", "-3.84]", "Rbxe4", "Rxf6#", "Nac3+", "R7b2", "N8g6", "Rcg6", "4.12]", "R6c2", "-3.9]", "Qxc4#", "Raxd6", "Rcxd2+", "Rhe7", "gxh1=Q+", "N2xe4", "-3.65]", "e4??", "3.54]", "Qxg7?", "R4b3", "4.11]", "4.2]", "Nh3??", "b8=Q#", "R3e4+", "Rxb4#", "N6xe5", "R5xc4", "Ra3#", "-2.8]", "R5xe4", "-2.94]", "Rxa1#", "Rbf4", "Nec2", "R8g2+", "Rdxf4", "Raxe7", "R8c2+", "-3.21]", "b3#", "Nbc3?!", "Ke3+", "N4c5", "Bb5+??", "R6xd7", "Rcxc8", "N3f4", "R2xd3", "Rfc6", "Rbg7", "Ndb3", "Ndxe6+", "Bxc6?", "Rgxf8", "N7xd5", "R2b4", "R8b2", "-4.41]", "dxe6?", "R7a6", "-3.89]", "g4??", "-5.0]", "R8h4+", "Rdxd4+", "R2xe3", "R2f7", "4.46]", "N6xc5", "R4h3", "Qc5?!", "2.13]", "Nd6?!", "R7xe6", "Rfxd4", "R8xe4", "-7.08]", "N5g4", "Nfxd5+", "Nge7?", "2.23]", "Bxf2+??", "Rdb3", "Raxc4", "N4xb3", "Ng4??", "Ncd5+", "dxe8=Q#", "R3xc5", "cxd8=Q#", "Qe6+?!", "Rfxf1", "-3.37]", "R1xf5", "a1=Q#", "hxg5#", "R1xc2", "Qf4?", "Raxf7", "Qd7??", "Rdxc5", "R8g4", "R4b2", "Bxe2#", "Rgxf4", "R3d5", "R8f2", "R7b6", "3.41]", "dxe8=Q", "N5xf6", "Bxd6#", "Ngf4+", "N3g4", "g5??", "Rea5", "R5a4", "Rdxd1", "N5xd4", "N6c4", "Rab2+", "Rd7#", "Qc2?", "Rbd4", "exf1=Q#", "Ngf5+", "-2.6]", "Ne6?!", "Rga8", "N6a7", "Qg6?!", "-3.43]", "-2.52]", "Nb3?!", "7.62]", "Nfxe7+", "fxe4?", "Rcxd7", "Nhf5+", "R4e5", "R2e5", "Rbxb8", "-1.57]", "Rhxe8", "Raxg1", "Bxf7+??", "Bc4#", "R2e3+", "Nxb3#", "-3.53]", "3.09]", "Nxe7#", "Rgxe4", "Rgxg3", "Be6??", "Ngxf5", "-3.26]", "-3.35]", "R1xc6", "Bxd5??", "-3.54]", "-2.57]", "R2d6", "R5b2", "R1h6", "Rbxd4", "-3.81]", "-3.72]", "Nh6??", "4.27]", "Raf3", "R1h7", "Rhe4", "Nge3+", "Ra6#", "Rdxb2", "Ke2?!", "Nbxd6+", "Rca6", "7.59]", "-2.49]", "-2.38]", "Rdxe7+", "Reb1+", "#-2]", "Nh4#", "3.66]", "Nfe3+", "-3.4]", "Nhf4+", "N7xg6", "R6xe5", "Nfe6+", "N6xh5", "Nbd7?", "6.75]", "3.64]", "4.26]", "Rca3", "Nexc7", "3.79]", "Nbd2??", "Kf1?", "R8h3+", "N6xd4", "N3d5+", "Bxc6+??", "-6.2]", "-3.04]", "Ncxe5+", "Nef7+", "Re6#", "Rfxf3", "Rf5#", "3.65]", "Ndf5+", "R4b5", "-5.64]", "Rdxd7+", "N2e3", "1.89]", "3.52]", "Ndxb6", "Rcxe7", "Ng6?", "Ngxh2", "Kf2?!", "4.51]", "4.32]", "c5??", "Rdf5", "N3xf4", "Rg3#", "4.96]", "b5#", "Rcxc1", "Ndc2+", "R6h3", "Qe6?", "3.44]", "Rhd5", "-3.68]", "Rce1+", "R2c5", "R6xd5", "3.86]", "Nac1", "R5xe3", "Bxc4?", "Bxh2#", "N3xc4", "Bxc6#", "-2.59]", "R8xe7", "Rxg6#", "Reh2", "Rfa3", "Bb7#", "Rexc4", "a4#", "exf8=R+", "-1.97]", "a5#", "N6b4", "f5#", "Ndxc2", "3.26]", "Bf1?!", "Rexb2", "Qf5?", "Rcxa2", "Rxc2#", "2.67]", "7.65]", "Nc5?!", "Rbxd6", "R3f2+", "Qxb3#", "Ng8?", "R6h7", "Nf7?", "Bb2??", "2.74]", "Nca5", "Ndxc3", "4.14]", "Ba3#", "R2h6", "R4h7", "Nexd4+", "2.57]", "R1g2+", "R8d4+", "R2e6", "2.42]", "Bb2?", "Nhxf1", "bxc4?!", "Ncxd4+", "4.29]", "Rbd8+", "Rxd6#", "2.38]", "Nfe7+", "N7e5+", "Nxc3#", "R1a5", "Nfxd3+", "R1xf2", "-2.17]", "Rhh5", "-2.64]", "2.35]", "R3f6", "fxe1=Q", "-2.91]", "Rc2#", "Raxg8", "Na4?", "Qa5#", "Rbxe8", "Rxa3#", "Qc3?", "9.74]", "R4xd3", "Na2#", "4.57]", "Qe7??", "Ne6#", "Rea7", "1.92]", "Rac5", "Rcxf8", "Rfh2", "Rexb7", "R8g3+", "Nh5?", "3.07]", "gxf3?!", "Nd6??", "R5h2", "R5h4", "R3e5", "Bxe7??", "Bh6?", "N6xd5", "Ra6?!", "3.23]", "R4a3", "e4#", "R5g6", "3.61]", "exf5?", "-3.45]", "Bc7#", "Rbxf7", "Bxg4?!", "3.97]", "4.02]", "R7g4", "7.95]", "cxd6?!", "R7h6+", "Nbd8", "-3.44]", "Nxb1+", "Nexg5+", "Bg6?!", "-4.3]", "R7f6+", "h3??", "Ng1?", "Ba2?", "Rdxc1", "Qxf6?!", "Qxd4?", "R8b3+", "5.11]", "R4xe5", "4.1]", "N2xg3", "Qxa5#", "R6e5+", "-3.78]", "Nfxd4+", "-1.93]", "Rfb1+", "R6xd4", "4.19]", "Rexb3", "Rhxe4", "6.79]", "6.72]", "6.77]", "R3g6", "R8xe6", "R1xd3", "R7xd4", "Qxb4?!", "-7.06]", "-6.86]", "Kd2?", "-9.43]", "Qb4+?", "Qg3?", "2.86]", "2.83]", "Ngxh3", "Nexc8", "R8f3+", "Rfxf1+", "Rb2#", "-4.17]", "5.06]", "5.28]", "Ncxe6+", "Kf3+", "-3.73]", "Bxg3#", "R8h5", "Ba2?!", "7.15]", "8.84]", "8.51]", "N7g5", "R8f3#", "Rda2", "Qee8", "10.63]", "Kh7+", "Rag2", "R8d7+", "4.69]", "5.53]", "Nxf7?!", "R1xd4", "R1c5+", "Rxd5#", "Rb3#", "Rgxf6", "R3c6", "R1xg5", "Nxc5#", "3.45]", "R7h4", "Rbf7+", "Rab7+", "3.88]", "Ra3?", "Kb1+", "Qe3??", "Qxc5??", "-6.81]", "R1g6+", "Ng7#", "Rgxg6+", "Kg7+", "Rbxd3", "Rfxb8", "-4.48]", "Qf5??", "Rcxc6+", "Nhxf7", "c2#", "Nxc6??", "3.53]", "Nbxa7", "Raxb4", "Rfb7+", "N5xh4", "R5h6", "Rexa5", "4.5]", "R7f5", "Ra7#", "-2.47]", "Qxd6?", "Rdxe8#", "Rdc7+", "-3.8]", "-3.69]", "Rcxa6", "-4.6]", "R7f3", "4.47]", "N3g5", "Rhxh4", "Rexe8+", "Rgxh7", "Ndc4+", "-3.87]", "Rf4#", "7.36]", "Bxb5?!", "-6.83]", "Nb6?", "Rdxb7", "4.13]", "Kxd6+", "Nec3+", "R1h6+", "R1f5", "Ng3?", "Rbh4", "R8xc7", "Rexc3", "R6b5", "Rfxf3+", "R2xf7", "R8b7+", "-3.05]", "d1=Q#", "-6.13]", "g1=Q#", "Rhxd2", "Raf8+", "Rcg2", "R5xe6", "Rh7?!", "R8xe5", "Kd2+", "Ndxb7", "Ngxf6+", "7.85]", "Bxe5#", "N6xf5", "a6#", "Nab7", "cxd5??", "f6#", "-4.53]", "-4.57]", "Qc4??", "Rxa4#", "Rdc8+", "Bxc7#", "Reh5", "Qb5??", "-6.43]", "gxf6?", "Rbxb7+", "Rg4#", "Rgd7+", "Rhxe6", "Qf3+?", "Nxg2#", "-6.94]", "Nxa2#", "Kh1+", "3.92]", "R3xe4", "Qh5??", "Rexe8", "R2xb4", "R4xd6", "b1=Q#", "dxe1=Q", "Rgxh6", "-7.91]", "d2#", "Rdxf6", "R8c7+", "R2b6", "Reh3", "-4.2]", "Rhxh7#", "R2xd6", "Rbxc4", "R1c6+", "Rhxh3", "3.04]", "Raxb3", "R4a5", "Rfxe7+", "Ncxb6", "N8a7", "4.21]", "gxf3??", "-4.67]", "Ncxb2", "Rbxa4", "R1xf3", "Bd4#", "4.93]", "Rgc2", "Nba7", "Rgd2+", "Rhxf3", "N2xe4+", "7.55]", "7.51]", "7.11]", "-1.8]", "-2.79]", "Nbc6+", "Rc3#", "Qb3+?", "Rcxa7", "Rgxg5", "3.87]", "R5b6", "5.9]", "Rbxa2", "Rb5#", "N3c2", "Rcb2+", "Ncxd3+", "Raxa2+", "Nfxh7", "9.05]", "Rcxc5", "R8h2#", "R8xh5", "Reg7", "Ncxe8", "Naxb6", "-3.75]", "h4??", "Nd2??", "Ba4#", "-4.81]", "Rbxa6", "R6xe3", "Nf4?!", "Nxe6??", "Rdxa2", "Bxg8?!", "Rbxb3+", "3.85]", "R7xc6", "Rdg7#", "7.56]", "7.63]", "Rch3", "Rbxd7", "Rfxf8+", "Ngxf7+", "Qh4??", "Ned1", "Bxc2#", "R7xa5", "-6.08]", "N3b5", "5.21]", "Nfxe8", "R2h7", "Bxb7#", "N3h4+", "R7f4", "5.79]", "N3xh4", "N4g5+", "R8xh7", "N6xf4", "Nxd3#", "Rbc7+", "Ndc6+", "Nc5??", "Nbc3?", "Ref2+", "g7#", "Rcxe1", "Rdxc4", "4.54]", "4.45]", "4.43]", "4.42]", "R2g7", "-8.82]", "-4.7]", "Bxc3+?", "-3.74]", "-4.43]", "Rbg3", "Qb4+?!", "Rcxf4", "Rxd3#", "Rfxg2", "-8.11]", "R1b4", "5.25]", "-6.45]", "R8xf4", "Rag7+", "Rhd8+", "Naxb3", "2.8]", "R4xf5", "3.93]", "N3xd4", "Rhxb1", "-6.72]", "Rgb3", "Ngxe4+", "Nexc3+", "R1a4", "R2h3", "Ngf6?!", "Qxf6?", "3.68]", "b4??", "-2.87]", "Qe4+?", "R1b7+", "Rbxe5", "N4d5+", "Ra2#", "Rexg7+", "Rhe7+", "e5#", "h4#", "R7c3", "7.78]", "Nhxf3+", "Rcg2+", "Nbd4+", "Rcf2+", "-10.18]", "Rexe2#", "3.71]", "4.71]", "4.77]", "Rexc6", "Bb6#", "Bb3#", "Qxc6?", "N6h5+", "Rgf7+", "R4g3", "R6f5+", "N2xd4", "R2xc3", "3.33]", "Nef5+", "10.57]", "5.16]", "#-3]", "Rab5", "Qg5??", "Re5#", "R8a7+", "R1xb4", "Nxg6?", "g3#", "R3d7", "Bb2#", "b6#", "axb4#", "axb6#", "R5h7", "Nh8#", "Rfxb7", "Qf5?!", "Rxd7#", "Rae2+", "Rah5", "Qc7?", "3.76]", "-8.64]", "Ke7??", "R1d4+", "Rbf1+", "-5.2]", "Ned5+", "Ndf6?", "-3.57]", "Nexf3+", "Nxg5?!", "Nc5?", "Nde6+", "8.18]", "R8xc5", "6.61]", "Rgxf3", "R7xc3", "Rdxa7", "Nfd1", "7.35]", "4.68]", "Reb7", "R8e4+", "N4xf5", "Bxh6#", "-4.47]", "Qxd6?!", "Ndxc7", "Bxb8+", "Rfg4", "Qf3+?!", "Nfg2", "Qxb7?", "R7c6+", "N4xb5", "Rbg7+", "N6d4", "3.34]", "cxb7#", "Bxd5#", "Raxa8", "Rxd2#", "R5xd4", "Ke7?!", "8.07]", "6.95]", "R5xh4", "Rexb8", "Nb5??", "Rdb5", "Bc2??", "Qg4?", "Rgxh3", "Nxd7#", "Ndxe5+", "N4f5+", "Kc1+", "Nexc2", "Rfg8+", "9.78]", "Rgxd1", "Nexg3", "Rxd4#", "4.4]", "hxg2#", "Rbe2+", "Nd3?", "-3.82]", "Qbb5", "Rbf3", "Rexa6", "4.74]", "b5??", "Rfb5", "R3b5", "g1=Q", "-5.84]", "Bc2#", "Rad1#", "Nce2+", "Qe2+?", "Rexe5+", "Bc2?!", "Rfa6", "N3c5", "Bxg5?", "Rgxg6", "h2#", "Rgg4", "Rg1?!", "Rcxf5", "Rh3?", "Nde1", "Qxc5?!", "Kf2+", "Rcxe4", "Bc3??", "5.23]", "-3.27]", "Nhg5+", "Rxc7#", "Ndxb2", "Rhe8#", "Bf6?!", "4.36]", "gxf5#", "Nxc7+?", "Bf6?", "Qxd4??", "Qc8?!", "g2#", "Qd1?", "Ncxe3+", "Rfb4", "Rcxd8+", "Rbe5", "Rc5#", "N1a2", "-5.7]", "-6.02]", "Rfxf6+", "2.87]", "Bxf4??", "Kf5+", "Rca4", "N6c7", "Nb3?", "Bxc5??", "cxb5?", "Rxe6#", "-4.22]", "4.6]", "Bh7#", "-4.25]", "Rxe5#", "R4b7", "-4.51]", "N5xf4", "Nxc6#", "7.27]", "7.18]", "R1h2+", "-4.01]", "Raxd4", "R4c6", "7.37]", "Qxc7?", "exf1=Q", "Raxb5", "R5xb6", "Rdxg2", "Bc5+?", "R7d6+", "Rcxf7", "Qxf3?", "Kd1??", "Naxc6+", "Rfxd2", "Ne1?!", "Ba5#", "Ncxe4+", "Qe4?!", "R5c4", "Rbxg2", "-4.13]", "Ngxe4?", "exd4?", "8.06]", "Rdg2+", "Nxh7#", "Rexg2+", "N7xh5", "7.3]", "N4g6", "Rhxf5", "Nxe6#", "-6.77]", "N1xe2", "Ng5+?!", "Bxa8+", "Rh3?!", "-3.99]", "Rcg2#", "N1xc3", "R8xf7", "Rea4", "Neg5?!", "Raf2+", "Raxd2", "7.46]", "7.31]", "7.7]", "7.96]", "N1d3", "Ned4+", "Qxb7?!", "-4.23]", "Ncxd5+", "Ba5?", "Ng5+?", "4.08]", "-2.92]", "4.31]", "4.04]", "Rbc8+", "Rxg4#", "6.44]", "Bxe7#", "Qa4??", "Ndxc2+", "Rcf4", "Rexf3", "Qxe5?!", "Rbf5", "N2a4", "R3e6", "4.35]", "Rfc2#", "Reg2+", "Rexf4", "-6.19]", "Bf3??", "R1d6#", "Rfxf2+", "Raxc2", "N4g5", "Bxe4??", "Nbxa4", "-9.05]", "R7xb3", "1.95]", "Bxf5#", "Qb5+?!", "Rexc2", "#-11]", "Ndxb4+", "R8g3", "-8.54]", "-10.58]", "Rhxf7", "Qg6??", "5.92]", "6.1]", "exf3?", "5.3]", "Bd2#", "N3e5+", "Qc1?!", "fxe6?!", "bxa4?", "2.4]", "4.7]", "Na4#", "hxg5?", "Rbg2#", "Nxb7#", "Bd7??", "fxe4??", "5.18]", "6.58]", "5.42]", "Nge5+", "Rdxc6", "Kf4+", "Bb7??", "Kg3??", "Rxa2#", "R7xd5", "-10.06]", "Ke1?", "exf5??", "Nxh2#", "-2.42]", "Rb7#", "-8.39]", "Nbd7??", "Rcb5", "R7h2", "N1f2", "-3.93]", "R1f7", "5.6]", "5.69]", "5.66]", "R1f6+", "Qf6+?!", "R6c3", "Bd4?!", "6.31]", "5.98]", "6.14]", "Qff2+", "Qgf3+", "Qfb4#", "N5g3", "fxe8=Q#", "Rgxg8", "Rcxa4", "Nxg7+?", "Rcxa5", "Qd5?", "8.49]", "Rfxd7+", "Rfb8#", "N5c4", "exd8=R", "Rexg8", "R8g5+", "Kd2?!", "N8xc6", "R8xg4", "-6.16]", "-6.17]", "R4xd2", "Rcxc4+", "Qxf3??", "8.2]", "8.13]", "Rxc3#", "R3xe2", "bxa6?!", "cxb3?!", "Rbxe1", "10.41]", "10.28]", "Nxc2+??", "Nbxa2", "Qd2??", "Nxb5#", "Kh4+", "7.07]", "8.76]", "8.97]", "8.72]", "Ncb4+", "R6xf5", "R3b6", "Q1xc3+", "Qac3#", "Qcxd7", "-6.84]", "-7.22]", "-7.01]", "-8.49]", "-6.93]", "10.67]", "10.61]", "10.45]", "10.23]", "10.16]", "R8xe7+", "Rfd7#", "Qb5?!", "Raxd1+", "Nxd7?!", "Rc8?!", "Ncxa4", "5.01]", "5.05]", "R5xf2", "Bf3?", "R7a2", "R3xd2", "R2xb3", "Ndxe7+", "N6xg4", "Qea5", "Qcd2", "h5??", "Rb1?", "Rxf3#", "R7xc5", "Nfxg4+", "Rcxb2+", "Rdf7+", "R6xc4", "-9.94]", "Qde3+", "Nxc5?!", "Bxg4?", "Rb8?", "Rfc5", "R8c6+", "Rxb5#", "Rexd7+", "R3h5", "Qxd5??", "8.73]", "8.81]", "-4.82]", "-4.58]", "Rfxg8", "Rfxc4", "Rah4", "Q6h3", "Q3g2", "Qhxg1", "Qgxe3", "Qexd2+", "Bxg7?!", "Bxe7?", "-5.11]", "Qxd3??", "11.23]", "R4xa3", "Qdxd2+", "R5xc2", "5.55]", "R2a3+", "Bxf2+?!", "R4h6+", "6.59]", "6.55]", "6.69]", "Reb8#", "4.38]", "Rhxh6+", "hxg8=Q#", "Rfxc7+", "Rbb3+", "-4.02]", "N8d7?!", "Kxd1?!", "N2f3+", "4.86]", "Rfd2+", "Rhg8#", "fxg1=N+", "c8=R", "Bxc6+?", "Naxb7", "Qeh6+", "Qh6??", "7.45]", "Bxc5?!", "Qda4#", "Rcxc5+", "-8.08]", "gxh8=R+", "4.25]", "Nge6+", "Rch5", "-3.38]", "Ref7+", "Rfg7+", "Rag2+", "8.47]", "8.37]", "8.42]", "8.38]", "R6g3", "Rdxh4", "R2a4", "R4a6", "fxg1=Q+", "-4.64]", "Kh8+", "Nf7??", "R1xf2+", "Ncxa7", "Neg2", "gxh1=N+", "R8d6+", "-5.1]", "-4.99]", "Reg7+", "Reb1#", "Bd1#", "Raxc6", "R2xc5", "Rd3#", "Rda6", "Reg7#", "R3xe7", "b7#", "Q2xe6+", "Be5??", "Qdxd4", "Qhf6+", "Nexg4+", "O-O-O?!", "Qxf6??", "-7.07]", "-7.03]", "-7.6]", "Rdxb6", "dxe3?", "N4e3", "Kc8+", "Nc7?!", "N7h6", "7.86]", "R2b5", "Qcg7#", "Q3xf6", "Q8g7+", "Qa3?!", "-4.86]", "-6.23]", "Bxd2+??", "Ncd5#", "-4.28]", "R3f4+", "N8d7+", "hxg7#", "Ba3?", "Qdb6", "N7xf5", "Ngxf8", "Qac6", "R1h3+", "R7b3+", "Rhxb7", "c4#", "Qaxd8+", "N5xe4", "N4xh3", "N7xd5+", "exf2#", "Qxd8+?", "Bxa3?!", "Bxc3?", "Raf2#", "Bxc3+??", "3.28]", "Rhxa7", "Reh7", "Nexc5#", "a8=Q#", "-4.03]", "-6.99]", "-6.8]", "R7b4", "R6b3", "Reg4+", "bxc3?!", "R4h5", "Ngh2+", "cxd6?", "Qhe5+", "Nexd8", "-11.44]", "Reg8+", "Ree2+", "N2h3", "Kg6+", "Bxc2?!", "Nxd2#", "-8.03]", "-7.8]", "Kxd5+", "-8.1]", "Nxg4?!", "Nh7?!", "dxe4#", "Bxb5?", "5.62]", "Bc4+?", "Bxf5?!", "Ke4+", "Nhxg6", "Nexf5+", "Rgxc4", "-4.36]", "-5.37]", "Nc7?", "Nxh4?!", "Ndc8", "Rfxb6", "Bf8#", "N3a2", "Bh3?", "Nxf3+?", "R3e2+", "Rxf4#", "N7xb5", "Ref1#", "Nexg3+", "10.08]", "R1f5+", "N4xh5", "-8.98]", "gxf5??", "Qxf5??", "Qh5+??", "-9.48]", "-4.19]", "Rag3", "R1xc5", "Rbd2+", "Rac2+", "Qxd2+??", "15.57]", "15.05]", "32.14]", "18.46]", "20.7]", "20.53]", "R1xg4", "Qb4??", "Ref1+", "Qd7?", "R8h6", "Qf1?", "R2xh3", "Nd6+?", "7.87]", "8.88]", "8.91]", "9.12]", "9.08]", "9.0]", "Qhh7+", "Qeg6+", "R8g3#", "Rgxg7#", "Rdxe3+", "Nc4?!", "N4a6?!", "Rhxd6+", "6.2]", "6.12]", "Raf6", "R7h6", "-3.85]", "R6g2", "R1xb3", "Rexa4", "Bf7+?", "Ke8?!", "R2xe7", "-7.45]", "Nhxf4+", "R2xe5+", "Nd7??", "Q4e6", "Bxa1+", "7.54]", "Be4?", "Bg6??", "R4xd5", "-4.27]", "10.77]", "10.68]", "11.37]", "Bxe6??", "N5xb4", "Kxf5+", "Rcd2+", "N8h6", "R8xc4", "e1=Q#", "R8g2", "Qxh6??", "-11.71]", "-11.13]", "-13.22]", "gxf8=Q#", "Rc1?", "Bxh7??", "Rxh7??", "R4xc5", "Rb1?!", "Rhg3+", "5.31]", "Nexd5+", "Rbxc7+", "Rfxg5", "R8b2#", "Qa1?!", "N5a4", "dxe1=Q#", "Nxb4?!", "Bxb7?", "Qhxf7#", "Ba6??", "6.41]", "6.34]", "5.82]", "Qff7#", "Rcxb6", "fxg3#", "Ncb3+", "7.12]", "7.09]", "N6b5", "R8xg7", "R5g6+", "Rea3", "R2f3+", "fxg8=N+", "Qa4?", "6.98]", "7.48]", "R4xc6", "Neg3+", "R3c4+", "-5.43]", "Qde5", "Bxb8??", "Rbh7", "Nfg7", "Qh4+?", "Ke8?", "R2f5", "dxc8=R#", "5.46]", "Qa8?", "Nec3?", "Bxc4#", "Rhxe7", "Bc6?!", "Raxd8+", "R6xg7", "-7.84]", "-8.81]", "-10.23]", "-8.97]", "-8.88]", "Qdf6", "Qcd8", "Rhe2+", "N7a5", "Rexd2+", "Rgxb6", "Qd3??", "R1c3+", "5.19]", "fxg7#", "Nde8+", "Rdxg3", "Qfc8+", "Qdxc7+", "6.8]", "Ba1+", "Nc4?", "Rh6?", "5.43]", "N4xg5", "Bxb2#", "-4.33]", "Nexg6+", "Nexf7+", "R4d3+", "Rgxg1", "Bxg1?!", "Kd1+", "Rfc2+", "R4xa6", "Naxb2", "Rfxd4+", "-6.64]", "-7.26]", "-6.22]", "-6.09]", "-15.61]", "Rfb6", "-6.31]", "Qd4?", "-6.15]", "-5.87]", "-5.83]", "-6.36]", "a4??", "Bb4+??", "-7.49]", "-7.51]", "-7.79]", "Bxd4?", "R3xb2", "Rgf1+", "R2xe5", "Qgxf7", "Q3f4#", "Bxb4?!", "3.78]", "4.59]", "Qxe2+?!", "R8xd2", "Raxf5", "gxf1=Q", "-6.53]", "-6.63]", "R7c4", "-11.47]", "Rce8+", "R2g4", "Rdxb5", "Qe5??", "6.19]", "6.27]", "R5xf6", "-8.6]", "-5.93]", "Rhb2", "7.79]", "Qf5+?!", "Rxf5#", "-5.55]", "-5.53]", "-5.54]", "-4.32]", "Bxb1?", "Rxb1?", "-5.5]", "-4.9]", "Nbxa6", "Ke1??", "-7.98]", "Rgxf2+", "Q8xd5", "Q5d4", "Q8e8#", "8.33]", "8.5]", "11.18]", "dxc5??", "R1xb5", "Rgb7", "Rhxh6", "Na3??", "N6xd4+", "Rhc8#", "Nbxa5", "Raxd4+", "Nbd2+", "Qaxb8", "Qfd6#", "-5.81]", "R4xh3", "Raxh2", "R2h3+", "-4.49]", "Qff6#", "Rfxa2+", "Ncxb7", "4.72]", "4.92]", "bxa1=R", "R2xa3+", "R1a3+", "Rbg4", "R3h4", "Rcd3+", "Red3+", "Rdxg8", "R3h7", "d8=Q#", "Nexg1", "Nexc2+", "Rfxb3+", "Ree7+", "Rhxg2", "Rgb2+", "Nxd6+?", "Rcxf5+",