{"vocab": ["<PAD>", "<UNK>", "{", "[%eval", "}", "O-O", "Nf3", "e4", "Nf6", "d4", "d5", "e5", "Nc3", "Nc6", "c5", "e6", "c4", "d6", "f4", "c6", "h3", "g6", "c3", "Be7", "a6", "h6", "b5", "Bd3", "f5", "b4", "exd5", "a3", "Be3", "Bg5", "d3", "e3", "Ne5", "Bc4", "g3", "Be2", "cxd4", "Ne4", "a4", "b6", "a5", "Bg7", "Bg4", "b3", "Nxe5", "Nxd4", "Nd5", "Re1", "g4", "Bd6", "dxe5", "h4", "f6", "h5", "g5", "Nd7", "cxd5", "Bd7", "1...", "2...", "3...", "4...", "5...", "O-O-O", "f3", "Nxe4", "Bb7", "Re8", "Be6", "Bf4", "Nd4", "Qe2", "Qc7", "Qd2", "Nd2", "Bd2", "Bxf6", "Nxd5", "Qe7", "exd4", "Bc5", "Bf5", "Bg2", "Ne7", "Bxf3", "dxe4", "Bb5", "Qd7", "Qc2", "Rc8", "Qf3", "Ne2", "Bb2", "Bb4", "Ng5", "Rc1", "Nbd7", "Nf5", "Rd8", "Nc5", "Qb6", "Qf6", "Rd1", "Nc4", "Bxe5", "Nbd2", "Kh1", "Ng4", "Qd3", "Rb8", "Nf4", "Qxd5", "Bxe4", "Qxd4", "fxe5", "Kg7", "Kh8", "Rb1", "Rad1", "Bxd5", "Bb3", "Qb3", "bxc3", "bxc6", "dxc4", "Bf6", "Bxc6", "Ke7", "Kf7", "Kg2", "Bxd4", "Qd6", "Nb6", "Nb5", "Ng3", "Ng6", "Rad8", "Rf8", "Bxc3", "Bxc4", "dxc5", "Kf8", "Kf2", "Qg4", "Nh5", "Bf3", "Bg3", "Qe3", "Qxf3", "Rf1", "Nb4", "Kf1", "exf5", "Qg3", "Nxc6", "Qg5", "Ke2", "fxe4", "Rfe1", "Qh5", "Kd7", "Bh4", "axb5", "Kh2", "Bg6", "Bxc5", "Qxf6", "Nh4", "Qa5", "Nb3", "Kh7", "Rd7", "Bc6", "exf4", "Qd8", "Bd4", "Rd2", "Rg8", "Bh6", "Be4", "axb4", "Be5", "Bxf4", "Bd5", "Rfe8", "Ne3", "Na5", "Re2", "Rac1", "Qh4", "Nxc3", "Rac8", "Ba6", "Bxf5", "Qxe5", "Qg6", "Bh5", "bxc4", "Rxd8", "Bb6", "Nd6", "gxf3", "gxf6", "fxe6", "Rg1", "Qxd6", "Re7", "Qf4", "Kd2", "Ne6", "Qxe4", "Bc3", "Bc2", "Kg8", "Na4", "Qxd3", "Rxd1", "Rae1", "Qe6", "Nd3", "bxc5", "Qc6", "0.18]", "Bxd6", "hxg5", "Qd5", "0.17]", "Bxe6", "Rfd1", "0.2]", "Qf5", "Qd1", "Kb1", "hxg6", "0.22]", "Nxc4", "Qc3", "Rf7", "Bb5+", "0.25]", "Bxe7", "exf6", "0.24]", "Rfd8", "Kg1", "Bxg5", "0.15]", "Kb8", "hxg4", "Qd4", "Rf2", "Rae8", "Rc7", "Bxd3", "Qa4", "Qe4", "0.27]", "Nh6", "Nxf6", "Qf2", "Na6", "Na3", "Qe5", "Kc7", "Ba3", "Nxc5", "gxf5", "Rc2", "Rxe5", "0.29]", "Nxd7", "0.13]", "Bh3", "Qxe7", "Ra8", "fxe3", "Re3", "Ba4", "0.0]", "cxb5", "Nxe3", "Nge7", "Rf3", "Bb4+", "Rxe4", "Nxe6", "dxc6", "Nxf6+", "Qf7", "Rxd5", "Bxe2", "Qc5", "Rd3", "Qb4", "fxg6", "Kd8", "Rxd4", "Qxc3", "Nxf4", "0.31]", "Bxg4", "Qc4", "Rab1", "exd6", "Ra1", "Qxc4", "Ke8", "Qe8", "Qxg5", "0.12]", "Qxb2", "Qe1", "Rxe8", "Bxe3", "Nh3", "Bxg7", "Nxf3+", "Rd6", "Nge2", "Qb5", "Nc7", "Bf8", "Qxd7", "hxg3", "Qxc6", "Nxf5", "axb3", "Rab8", "Nxf3", "Qc8", "Kf6", "0.21]", "0.32]", "Kc2", "Rxe1", "Bxb5", "cxb4", "Re6", "0.19]", "0.16]", "Qh3", "Qxe2", "Bc7", "Qxf4", "Nxg5", "Qxc5", "Bc8", "Bxh6", "0.26]", "0.23]", "gxf4", "Qxb7", "Nxg4", "Kxg7", "Rxd6", "Rf6", "0.1]", "Rxf6", "Ke6", "Rxc1", "cxd6", "0.14]", "Nxd2", "Nc2", "0.28]", "Qb7", "Rxb2", "Nxd3", "Qh6", "Rxf7", "Qxf5", "dxc3", "Rxe6", "0.34]", "Qxg4", "Ke3", "Rxc8", "axb6", "Kg6", "Bxc3+", "Bxb4", "cxd3", "Nxd6", "Qxd2", "Kxf7", "Kd1", "Kf3", "Rxb7", "Rxf3", "Rh8", "fxg3", "Nh2", "Kg3", "Qc1", "Bxb2", "Qxe3", "Rxd3", "Bxc6+", "Ra7", "Ba5", "Rxf5", "Kd6", "Re5", "Qxe6", "Rd5", "Rxe3", "Bf2", "Rxd7", "0.3]", "Rxf2", "Rxc3", "0.08]", "dxe6", "fxg5", "Re4", "Nxb5", "Rxe7", "Rd4", "Bc1", "Rxf4", "Rg3", "Bxh3", "0.36]", "Bf1", "Rh1", "Ke1", "Rfc8", "Qb2", "Rxd2", "Bxg2", "Bxb7", "Qh5+", "Bxd7+", "Ra2", "Ngf6", "Nxg6", "Rxc6", "Rf4", "fxg4", "exf3", "Ne8", "Nf8", "0.05]", "Bxa6", "Nxf7", "Rc6", "Nh7", "0.06]", "Rxc2", "Rf5", "Rfc1", "Rc3", "Qg7", "Nf7", "0.11]", "Rxa2", "Rxe8+", "Rxd1+", "Rb2", "Rg6", "Rb7", "Kd3", "Ba2", "Rxf8", "Bxd7", "Rxc4", "Rc4", "Nxb4", "Rxa7", "Rxc7", "0.37]", "Nf1", "Bxg6", "Rxd8+", "Qa5+", "Rxf1", "Rxe1+", "Kxd8", "Qxc2", "Qxd8+", "Kxg2", "Kb7", "Bxf8", "Nxg3", "0.07]", "Rxa1", "Rxe2", "Qg2", "Kc8", "0.39]", "Nxe7", "Rxa8", "Re1+", "Qa6", "Rc5", "Qh4+", "gxh6", "Qa3", "0.33]", "Rxc5", "Qxb5", "Rhe1", "Qa4+", "Qxa2", "0.01]", "Bxf1", "0.03]", "Bf7", "Bxf7+", "Rb6", "Qxb4", "Qxd1+", "Kc6", "Rb3", "Rh3", "0.09]", "Nf2", "Bxd2", "0.35]", "Qxc7", "Bxg3", "Qxd8", "Nxb3", "0.41]", "Qxd1", "Qe6+", "Qb8", "Nfd7", "Qxa7", "Nb8", "Kxd1", "Kb2", "gxh5", "Rd1+", "Rhe8", "Kxf2", "Rxa6", "Ngf3", "cxb3", "Ne1", "Re8+", "Rxf1+", "Qxb6", "Ra3", "Rxf8+", "-0.03]", "Rg7", "Rg4", "gxh3", "Bxa3", "Nf6+", "Bxd2+", "Kc1", "-0.01]", "Bxd8", "0.43]", "cxb6", "Qxb3", "bxa5", "Kxf8", "Rg2", "Qxh4", "Nxf2", "bxa4", "Qxh5", "Bb1", "0.44]", "Rh6", "Rb4", "Nxe2", "Bxd1", "Bxa8", "Qd4+", "Qxg6", "0.46]", "Ra6", "Kh6", "Nd6+", "Rg5", "Raf8", "Raf1", "-0.05]", "Kxf1", "Be8", "Qxh6", "Rh5", "Qg5+", "Qe5+", "Qg4+", "Rd8+", "Rh7", "Qf8", "Nxb6", "Qb1", "Rde1", "Bxa1", "Rh4", "Bd8", "Nf3+", "0.5]", "0.38]", "Qxe6+", "Qe3+", "0.53]", "0.04]", "Bxb3", "Bxb6", "Kc3", "Ra5", "0.51]", "0.48]", "0.02]", "Bc5+", "Qe4+", "Nxh4", "-0.06]", "Qxe5+", "Bxc7", "Ne2+", "Qxf7", "Nb1", "Bxh4", "Bxc2", "Qf1", "Bd1", "Qxg7", "Qxh3", "Qxg3", "Rh2", "Rxa5", "Rb5", "-0.08]", "Bh2", "Qd5+", "Ra4", "Rxa4", "Kb6", "Kxd7", "dxe3", "Rxb8", "Nxf8", "bxa6", "0.55]", "Rde8", "Qxa6", "Qf4+", "Ne7+", "Nxb7", "Rxa3", "Qc5+", "Nxb2", "Rhg8", "-0.1]", "Rxb1", "Qxa4", "Kh3", "Nxd1", "Nd1", "Nbc6", "Qxf2", "Rhf8", "Nxe7+", "Ng8", "Nxc2", "bxa3", "exd3", "Qxg2", "Nxf1", "gxh4", "0.56]", "Bxf2+", "Qa7", "0.4]", "Rxg7", "Qxa5", "Nxd8", "Qb6+", "Ba7", "Rxb5", "Nxh5", "Qxa3", "Qxa8", "0.58]", "Bxa7", "Rhg1", "Kxe7", "Nxc7", "-0.02]", "Qf5+", "0.6]", "Rhd8", "Bxh5", "Qb5+", "Nxa8", "Be1", "Nd8", "-0.12]", "-0.15]", "-0.13]", "Qxe4+", "Rhd1", "0.62]", "Rxb4", "0.42]", "Qc4+", "Qxf7+", "Qxa1", "Nc8", "Red1", "Rhf1", "Rxh5", "Qxe3+", "Bxa4", "-0.04]", "Bxf7", "Nd3+", "Rxg2", "-0.07]", "Kf5", "Qe2+", "-0.18]", "Qxd4+", "Rxh6", "Qb4+", "Ndf3", "Qxe8", "Qxf2+", "Nce2", "Nxd3+", "Rfb8", "Bxc1", "0.63]", "0.45]", "Nxe2+", "Nce7", "Nfd2", "-0.17]", "Kxd2", "Kb3", "Bxa2", "Rxh7", "Qxe2+", "Nxd6+", "Rxh4", "Ng1", "Rxh8", "Qg6+", "0.49]", "Nxa1", "Rfb1", "Kxe2", "0.65]", "Nxa4", "Bh7", "Qxe7+", "Kg5", "0.52]", "Rxb3", "Ne5+", "Qf3+", "Kf4", "0.47]", "Nbc3", "Bxc8", "Rxg4", "Rxb6", "Rxg5", "-0.2]", "Rxh3", "Nxc8", "Bc4+", "Bxa5", "Ng7", "Qxf8", "Qa2", "Qg3+", "-0.22]", "Nc1", "Rcd1", "Red8", "Rxh1", "Nxa6", "Rcd8", "Na7", "Ndf6", "Qxc8", "Nb7", "0.54]", "0.57]", "Bxf2", "Bd4+", "Qf6+", "-0.09]", "Qe7+", "Bg5+", "Qxh7", "Qxe1", "Rc1+", "-0.24]", "Bxh8", "Qxd5+", "Kg4", "Ng5+", "-0.25]", "Nxa5", "Ne4+", "Nxg7", "Rxh2", "-0.11]", "Qh7", "Qxc1", "0.68]", "Nb2", "Bxe6+", "Nxc1", "Nxe1", "Qxf1", "Qxd7+", "Qc6+", "Qb3+", "Ke5", "Kxh7", "Rxg6", "Rdf1", "0.59]", "-0.27]", "Kc5", "Kxf6", "Qxh2", "Nxh8", "Bb8", "0.67]", "Ke4", "Qh2", "Nxe8", "Ka7", "Bxd4+", "Ka8", "Rxg3", "Qh6+", "Rxg8", "Nd5+", "Qxd2+", "Rd7+", "-0.14]", "Rf1+", "Rxc1+", "Qxg6+", "-0.32]", "Bxh7+", "Nxa3", "Bxe3+", "Bxh2+", "-0.16]", "Rc8+", "Ng2", "Nf4+", "0.61]", "Nf5+", "Qc3+", "Kd5", "-0.29]", "Rf8+", "Kd4", "Rxc8+", "Qh3+", "Rdg1", "Qxc6+", "e5?!", "Rdf8", "Nxa7", "Be6+", "Qxc3+", "Bg4+", "Bxe1", "Kxh2", "Qa1+", "Bxh1", "Na2", "Nxg2", "Nf2+", "Qe1+", "Nd4+", "Ka1", "0.7]", "Ng4+", "Bd5+", "-0.21]", "Ne6+", "Be3+", "Qf7+", "Rbc8", "Rdg8", "-0.31]", "Rd2+", "Nf7+", "Bxe8", "Rbd1", "Re7+", "Qd6+", "Rbd8", "Kc4", "0.72]", "Qc1+", "f4?!", "-0.19]", "Qxh8", "Nc7+", "Qa8+", "Bf4+", "Bxb8", "Rg8+", "-0.34]", "Nxh7", "Ne3+", "Qxg3+", "Nxa2", "Qd3+", "Rxg1", "Qa8", "Rbc1", "Qxg5+", "Qf2+", "Qh1+", "Rg1+", "Ka2", "-0.23]", "0.64]", "Nce5", "-0.36]", "Qe8+", "Kxf3", "-0.37]", "-0.28]", "Nxh6", "0.74]", "Qxg4+", "Rxg7+", "Rxg2+", "Bh4+", "Bxd5+", "Qh7+", "-0.41]", "Bf5+", "Qa1", "Qh8+", "Kxe8", "Nce4", "Qxg7+", "Nxh2", "-0.26]", "Rec1", "0.75]", "Qd1+", "Bxb1", "0.66]", "Rxe7+", "Nbd5", "Kh4", "Rxf7+", "Qxf6+", "Kxe1", "Kxe6", "Qg8", "Qxh1", "Re2+", "-0.39]", "d7", "Qxf3+", "Kxc7", "d5?!", "Bxf6+", "Ba8", "Qb1+", "Kh5", "Nxh3", "-0.3]", "Ra1+", "Qc7+", "Nxc7+", "Rb1+", "Bxf3+", "Nxc2+", "Rc2+", "Kb5", "Qc8+", "Qxf4+", "Qc2+", "Rc7+", "0.77]", "Rxf2+", "Rh1+", "Nc2+", "Kxd6", "0.69]", "-0.43]", "Rce1", "Qg1", "Ng6+", "Bxh7", "Nxh1", "Qd8+", "Nh6+", "Rce8", "Kxe3", "Bc4?!", "Nc5+", "Qxh7+", "Qxe1+", "0.79]", "Kb4", "Rf7+", "Qxg2+", "Qb8+", "Be5+", "Ka6", "Nh3+", "g6?!", "Ra8+", "Nc4+", "Rb8+", "-0.44]", "Qxe8+", "Nc3?!", "Qxc5+", "Qh2+", "Nxe5+", "Rbe1", "Ng3+", "Raxd1", "Qxb1", "-0.33]", "Rag8", "Bh8", "O-O-O+", "Rec8", "Kxb7", "Bh5+", "d2", "Raxd8", "Qxh2+", "Qd7+", "-0.48]", "Qxb8", "Bh6+", "Nxe6+", "Nc6+", "-0.35]", "0.71]", "Qd2+", "Kxd3", "-0.46]", "Qb7+", "Nfd5", "Qxf8+", "Nxb8", "Rh8+", "Kxb2", "Ncxe5", "Nge4", "Nf3?!", "Bxh2", "0.82]", "Rbe8", "Nf6?!", "Nge5", "Bxb5+", "e7", "-0.5]", "Rhc8", "Kxc2", "Nbd4", "0.81]", "Bxg8", "Nxh3+", "0.86]", "Rxe2+", "Qg7+", "Qf1+", "Rag1", "Nfd4", "Ka3", "0.73]", "Qxf1+", "Rf2+", "Kxg3", "Qxc4+", "exf7+", "d3?!", "Qb2+", "Kxc6", "0.84]", "0.87]", "-0.38]", "Ba1", "-0.51]", "Bg6+", "Nd7+", "Rdc8", "Qxf5+", "Kxg6", "Nc6?!", "Qxc2+", "Qxc1+", "Qf3?!", "Be4+", "-0.4]", "0.76]", "f6?!", "d6?!", "Bg1", "Nde5", "Nxe3+", "Rxe5+", "Qxc7+", "Qxb7+", "Qg2+", "Rg3+", "Qa3+", "Ngxe5", "Bd6+", "Ba6+", "c2", "Qa6+", "Qg8+", "Nec6", "-0.53]", "d4?!", "f3?!", "Nde4", "Nxf7+", "Qxb5+", "Nxb1", "Rhc1", "Qxh3+", "Bh3+", "Ncxe4", "Kxe5", "Bxc5+", "Ree1", "e2", "Rxe6+", "Qxa1+", "-0.45]", "fxg7", "Nxh6+", "a7", "c5?!", "0.78]", "Rdc1", "Rxd7+", "Rfa8", "Ka5", "0.89]", "exf6+", "Bxb4+", "Neg5", "Qxa8+", "0.93]", "Qxh6+", "Rg7+", "Ndxe5", "-0.58]", "0.8]", "cxb2", "Rg2+", "Ba3+", "-0.55]", "Qxb4+", "Rd6+", "Bxe5+", "c7", "Qh8", "Rxc7+", "Rxc2+", "Bxg6+", "Rh7+", "Rdd7", "c3?!", "0.83]", "Rdd1", "-0.42]", "Nc3+", "Qxd6+", "Bh7+", "Rdh1", "Rdd8", "Qxb2+", "-0.49]", "Nbxd7", "Rb2+", "Rh2+", "Nbxd2", "Bc6+", "0.91]", "Qg1+", "Qf8+", "Bg8", "Qxh5+", "Ndb5", "Nxf2+", "Bc3+", "Rfa1", "Rxd2+", "Nxg8", "Rdh8", "Bd3+", "Nd2+", "Rxb8+", "0.94]", "-0.47]", "Nb6+", "Nhf6", "Rb7+", "Re3+", "Rxg3+", "Nb5+", "Bh1", "Rdd2", "g3?!", "e4?!", "Kxh6", "-0.56]", "Raxc8", "Bh2+", "Nh4+", "0.96]", "Nxe4+", "Re6+", "Bxg2+", "0.98]", "Rxg6+", "Nfxd4", "Rg4+", "Ree7", "Rxg1+", "c4+", "Kxc3", "-0.52]", "Nh5+", "Ba4+", "Kxg8", "Bxg3+", "-0.63]", "e6?!", "a2", "Nxf5+", "-0.6]", "Rxb1+", "Rxe4+", "Bxg7+", "Ref1", "c6?!", "f5+", "Ned5", "N7f6", "Bc5?!", "0.85]", "fxg2", "-0.62]", "f5?!", "Nxg3+", "Ree2", "Rxe3+", "Bxf4+", "Raxc1", "N2f3", "Bb6+", "Rf3+", "Bxg1", "b4?!", "Rg6+", "1.0]", "-0.54]", "Qxg8", "Ka4", "Qxh8+", "exf2+", "Bg3+", "Qxc8+", "Kxf4", "Rxg8+", "Neg4", "Ref8", "Ngxe4", "c4?!", "Nxg6+", "Nxg7+", "Rd3+", "Rg5+", "Qxd3+", "Nxc6+", "Rfxd8", "Kxe4", "dxe7", "g5+", "Nfe5", "Bxd6+", "0.88]", "c5+", "e6+", "Kxd5", "Reb1", "Ned4", "Nxc3+", "d6+", "Bf6+", "f4+", "Qf6?!", "-0.72]", "1.01]", "Qh1", "0.92]", "-0.74]", "Qxh4+", "Nf3?", "Bxf5+", "Rxh7+", "Bxg5+", "b2", "-0.67]", "Nxd5+", "Kxg1", "0.9]", "-0.68]", "-0.65]", "Kxh3", "Rf6+", "Nxa7+", "Rxb7+", "Nxg1", "Ncd7", "Nb4+", "1.06]", "Nxf4+", "Kxg5", "Bxc4+", "Bxb7+", "Kxh8", "Nb3+", "e5+", "Kxf5", "Kxc8", "1.05]", "Kxg4", "-0.57]", "Ned7", "Ree8", "Bxe7+", "Nfe4", "Qxg8+", "Bxe4+", "Qa2+", "Rff1", "cxb7", "Bb3+", "Rxf6+", "Ncd5", "1.03]", "Rfxd1", "g4+", "Reb8", "N8d7", "Rcc7", "Nec3", "Rxb2+", "Nef6", "dxc7", "Bf7+", "Nfg5", "Nbxd5", "Qa7+", "f6+", "Bg5?!", "b6?!", "Rxd4+", "Kxc1", "Nhf3", "-0.7]", "Kxc5", "Ra7+", "Bf3+", "Rxh2+", "Rcc2", "O-O?!", "Nfxd5", "Bxd3+", "b7", "Re4+", "Raa8", "Rxg4+", "e5?", "Ra2+", "Kxd4", "Nxd4+", "Ncd4", "Qxb1+", "1.17]", "Rhb8", "Rh3+", "Qxg1+", "Bg4?!", "Ndxe4", "Rxc6+", "hxg7", "1.08]", "Rah8", "d3+", "Nxb6+", "Rxf3+", "Rxd3+", "-0.81]", "e3?!", "Rad1+", "Rxd6+", "Nxb3+", "Kxh1", "b3?!", "h6?!", "Nde2", "gxf7+", "Nef3", "Nexd4", "d4+", "Rfe1+", "1.13]", "Rff8", "Rxh3+", "Ncd2", "Bxb2+", "-0.77]", "Nh8", "Rxd5+", "-0.84]", "Be3?!", "Nxa2+", "Bxg4+", "Ned2", "Rxg5+", "1.15]", "Qxa2+", "Qxa7+", "Rf4+", "0.99]", "Rd5+", "Nxg5+", "Nbxd4", "Rcc1", "1.12]", "Bd3?!", "d5+", "Nxg2+", "Rcc8", "-0.75]", "a6?!", "1.1]", "Kxc4", "Rcf8", "Nxg4+", "0.95]", "Rge1", "Nexd5", "Ba5+", "-0.87]", "Rcf1", "Bf2+", "Rc6+", "Bxe2+", "Rbb8", "e4+", "Qxh1+", "Rge8", "1.22]", "Nfg4", "Rhb1", "Rxc3+", "Qxg1", "Rc3+", "Rxf4+", "hxg6+", "Ncxd4", "Rgf8", "h4+", "Rf5+", "-0.66]", "Nh1", "Re5+", "d4?", "hxg2", "1.24]", "Rbb1", "R1d2", "Raa1", "Rah1", "exf3+", "N1d2", "f6?", "Qe2?!", "h5+", "f5?", "Qxb8+", "Qxb6+", "Ndb4", "b5?!", "Ng5?!", "h6+", "Rh5+", "0.97]", "-0.61]", "dxc2", "Na8", "exd6+", "1.18]", "f3+", "Rgf1", "b4+", "Rd4+", "Rh6+", "-0.79]", "Nxf1+", "gxh7+", "Kxb6", "N6d7", "h3?!", "e3+", "Rxa2+", "fxg6+", "R1e2", "-0.91]", "1.02]", "Rxa8+", "-0.86]", "Nf6?", "Ngxe2", "g4?!", "Rbf8", "Qe7?!", "-0.82]", "Nc3?", "Nxd7+", "-0.71]", "1.16]", "1.27]", "exd5+", "Rff2", "-0.59]", "Red2", "Rfe8+", "dxe2", "Rb6+", "1.04]", "Rxa7+", "d5?", "Rxh8+", "Ng2+", "b5+", "Ngxe7", "-0.64]", "-0.78]", "-0.69]", "N7b6", "Qxa6+", "Rdb8", "1.19]", "Nef5", "-0.73]", "Ng7+", "Qh5?!", "Rff7", "Nc6?", "Ncb4", "Nhf5", "1.2]", "h7", "1.32]", "Bf4?!", "R8d7", "1.21]", "R8e7", "Nhf4", "1.25]", "1.09]", "-0.94]", "dxc3+", "Kxa7", "Nxc4+", "exd7", "hxg3+", "Red7", "1.23]", "d3?", "Rxh1+", "Kxb3", "Rde2", "Be2?!", "Nfxe4", "1.34]", "1.07]", "Rac1+", "Nxf8+", "Rbf1", "Rxh6+", "Kxh4", "Nxd2+", "Rcb8", "Ndc4", "Nxh7+", "f3?", "a3?!", "Rxf5+", "Rxa1+", "Rc4+", "h3+", "Rde7", "-0.96]", "fxg3+", "Nxe8+", "Rad8+", "-0.89]", "f7", "Qf3?", "Nfxe5", "hxg5+", "Kxb4", "Rdb1", "N1c3", "Nac3", "Kxh5", "1.37]", "-0.93]", "1.14]", "Nxe1+", "h2", "Nfe7", "Bd6?!", "N1e2", "Be7?!", "g3+", "R8f7", "Ne8+", "Bxf7+?", "Nxd8+", "fxe7", "-1.06]", "-1.08]", "Kxa2", "-1.0]", "Rgd1", "exf4+", "a4+", "Qxa3+", "Rc5+", "exd4+", "Kxb5", "Bf5?!", "gxh2+", "fxe6+", "Rb3+", "Bg7+", "gxf2+", "Bd2?!", "Nde7", "-1.05]", "-0.8]", "Rxb6+", "g6+", "N4f3", "Rb4+", "g7", "Rfe7", "R1f2", "Nxc8+", "1.11]", "Bb7+", "1.36]", "1.31]", "Reg1", "-0.83]", "-0.76]", "Nef4", "1.29]", "c4?", "gxf6+", "Ne5?!", "d6?", "Nd4?!", "Rxc4+", "-0.85]", "Bxh6+", "N5f6", "Rhe8+", "Rgd8", "Rae1+", "Rac8+", "Rh4+", "Bxh4+", "fxe5+", "h2+", "-1.03]", "Bb5?!", "Rcb1", "Nxd4?!", "Na1", "dxc6+", "Rfg8", "1.26]", "Rbb7", "h5?!", "-1.1]", "Nxh5+", "Bxh3+", "h7+", "Ne1+", "-0.92]", "Be7+", "-1.01]", "exf7", "-0.98]", "1.48]", "f2", "Ncxd5", "Nxh2+", "dxe5+", "fxe4+", "Rcd2", "Nac5", "f4?", "Qxa4+", "Rxh5+", "Ncb5", "Nxb7+", "Nac4", "-0.9]", "Qxb3+", "N2b3", "a5+", "axb2", "Raa7", "O-O?", "Bb2+", "bxa2", "-1.15]", "dxe6+", "Nh3?!", "Bxc7+", "-0.97]", "Ra6+", "1.28]", "Rxb3+", "Rae8+", "N1h2", "Nxc5+", "c3?", "Rea1", "Bc7+", "N7c6", "Ndc5", "Rxh4+", "Rhe1+", "Rfe2", "Bc2+", "Bc4?", "Bg4?", "-0.88]", "1.39]", "N2g3", "Nec4", "Rdc2", "g4?", "c5?", "Bxc2+", "-1.2]", "Bg2+", "bxc2", "Rxc5+", "Nac6", "exd7+", "Ndc3", "Ref2", "b3+", "R1c2", "Rfd1+", "g5?!", "Bxh5+", "gxf5+", "Nxd1+", "Na4+", "axb7", "Nfe2", "-1.07]", "Rb5+", "Bd7+", "Kxb8", "Qxa5+", "-0.99]", "Nxc1+", "dxe5?!", "N8e7", "Be6?!", "Rfd2", "Reg8", "N3d2", "fxe2", "1.5]", "Nec5", "dxe3+", "Bg5?", "Rbb2", "Na5+", "d7+", "-1.18]", "Na7+", "Nxh8+", "Rfg1", "-1.12]", "f7+", "Bc5?", "gxf4+", "Nh7+", "Ra3+", "e6?", "Nh2+", "gxf3+", "N2c3", "Ndf5", "Na2+", "fxg7+", "R3e2", "Kxa1", "fxg5+", "Bxa3+", "exf5+", "Bd3?", "bxc7", "Ndc6", "Ndf4", "g6?", "bxa7", "Be2+", "-1.17]", "Nxh4+", "Rcg1", "b6+", "Rde3", "g2", "-1.04]", "-1.13]", "Rce2", "cxb7+", "cxd7+", "Ncxe7", "Na3+", "Rec2", "fxg4+", "bxc6+", "Rdd3", "e7+", "e4?", "Kxb1", "cxd4+", "Ndxc4", "g5?", "hxg4+", "N5c3", "Nxb2+", "1.3]", "Nxe5?", "N4c6", "Rexd1", "1.4]", "gxh6+", "dxc5+", "Ne7?!", "Ree3", "Kxa8", "-1.11]", "Bd7?!", "Rbxc8", "h4?!", "c3+", "dxe4+", "Rcd7", "Nce3", "1.46]", "Rfd8+", "Bb4?!", "Kxa3", "Ne2?!", "Ndf8", "-1.31]", "1.53]", "Rhh1", "e2+", "Qb6?!", "Bxb6+", "Nxd5?!", "cxd5+", "-1.09]", "Be3?", "Raa2", "Kxa6", "1.43]", "exd3+", "Ref7", "b3?", "-0.95]", "1.41]", "Rde8+", "Nexg4", "1.65]", "cxd3+", "-1.24]", "Ngxf6", "c6+", "Ngf5", "Neg6", "Nxe5?!", "Rhg1+", "1.44]", "R3f2", "Rff3", "gxh7", "Ndf1", "Nb2+", "exd2", "Nhg5", "cxd6+", "dxc5?!", "a4?!", "Rgg8", "Rdf7", "a3+", "Rea8", "Kxa4", "e3?", "exf2", "Rfd7", "R1e3", "1.56]", "a3?", "Ndxf6", "R8d6", "Ne4?!", "bxc3+", "Rha1", "c6?", "Nh6?!", "-1.02]", "Rfe3", "d2+", "R8c7", "Qxg2#", "cxd7", "N7g6", "Nhg4", "cxb2+", "Bxa6+", "h3?", "Ra4+", "f2+", "1.52]", "Rec7", "Raxb8", "Ree6", "Bb5?", "Bb5+?!", "Rcxd8", "Be6?", "dxc4+", "Bxf8+", "Rcg8", "Rgg1", "Bd2+", "Rcxd1", "Ned3", "h6?", "Rhg8+", "Nfxd7", "Rbg8", "Ndb8", "1.67]", "1.51]", "Qb3?!", "Nbc5", "1.6]", "Red3", "1.35]", "1.33]", "Nge6", "Qd2?!", "R8f6", "Bg4??", "N5c6", "Qc7?!", "Na6+", "Rgg2", "Ncxe2", "Rca1", "Be2?", "1.42]", "Qh5?", "1.55]", "Nd5?!", "Rgh8", "Ndb6", "Ne5?", "1.66]", "Ned6", "Qa5+?!", "Rhh8", "Rcd3", "Rce7", "-1.21]", "gxh2", "Nce6", "axb3+", "exd5?!", "a8=Q", "dxe4?!", "Nxh1+", "-1.25]", "Nf8+", "Rbc7", "-1.22]", "Ndxf3", "Nb7+", "-1.43]", "Nfd3", "-1.28]", "Rfxf2", "bxc4+", "Rdf2", "c1=Q", "Ncd3", "-1.27]", "hxg2+", "-1.34]", "R3d2", "Nd8+", "R6d7", "Qg2#", "1.38]", "Ndxb5", "Qf6?", "Rbd7", "Nde3", "Rbg1", "axb2+", "-1.14]", "Bxf3?!", "Ndxe7", "Nd1+", "a6+", "Rab1+", "R1b2", "Nbd3", "-1.23]", "Kxa5", "Nxe4?", "hxg7+", "Rdd6", "Bf5?", "Rac7", "Bg1+", "Rfxc8", "1.68]", "Nxd5?", "Rab8+", "Bxf1+", "1.59]", "gxf7", "R5e3", "axb5+", "-1.32]", "R6f7", "Rgc1", "R1f3", "Nab5", "Nac2", "d1=Q", "-1.56]", "Rgc8", "gxh3+", "Bc8+", "cxb3+", "Ngxf7", "Rfxe8", "Nd4?", "R8b7", "Qd6?!", "Nfxd2", "b6?", "Rba8", "N3h4", "Bxf2+?", "N6d5", "fxg2+", "Raxb1", "Nxf7?", "Rdf3", "R8g7", "R8c6", "Bg5??", "N6h5", "Rad7", "Nb4?", "-1.4]", "Rca8", "Rfc2", "Nfg3", "1.49]", "Ref6", "Rdc7", "Bxc6?!", "R1e6", "1.81]", "Rbc2", "Bxa2+", "-1.26]", "Nac7", "Rbxd1", "Nxb5+", "Ngxf3", "N3h2", "Rae2", "Rdc3", "-1.39]", "exd4?!", "Qxd4?!", "Bxa7+", "a5?!", "Nbc4", "e8=Q+", "Rcd6", "Rdg1+", "-1.36]", "Bxb3+", "Nexd2", "Ba4?!", "-1.29]", "Rfxc1", "1.45]", "Neg3", "Qxd5?!", "-1.37]", "1.64]", "Bxa4+", "Rha8", "Rhxf1", "Rxb4+", "Nab4", "R6e7", "Nxb4+", "Nxe4?!", "Rab3", "-3.01]", "Rff6", "Nb5?!", "Ra5+", "Nge7?!", "Raxe8", "Rde4", "-1.16]", "gxh4+", "Rdg8+", "1.47]", "Ndxc5", "1.7]", "Rac2", "Nce8", "Ng5?", "1.73]", "exd2+", "Rab2", "Bb3?!", "Ndxe2", "Ngf4", "Nf1+", "Rfc7", "-1.46]", "g3?", "N4b3", "R1d3", "Raf2", "-1.41]", "-1.6]", "R4e2", "Rbd2", "Rhxf8", "-1.48]", "exf1=Q+", "-1.84]", "b5?", "Rde1+", "Rgh1", "Rxb5+", "Bg7?!", "-1.51]", "Reg3", "bxc5+", "Ng4?!", "cxb5+", "-1.33]", "Nexd7", "b4?", "fxe3+", "bxc7+", "Rda1", "Rfd6", "Nfe6", "Nh6?", "Rcb7", "cxd2", "d8=Q", "Rgf3", "R6c7", "Reh8", "-2.44]", "Red6", "Be7?", "Qd3?!", "cxd2+", "Nbxc6", "Rda8", "Nfg6", "Rhf1+", "Rxa6+", "Nfe3", "Nf6??", "Rec3", "2.17]", "1.91]", "Nf3??", "R5d2", "Rbxc1", "Neg1", "Rexd8", "R5e2", "Rcc3", "R6d2", "bxc2+", "Naxc4", "Nge3", "-1.19]", "Bc4??", "1.71]", "Rde6", "N4g3", "Rba1", "c8=Q", "Qd5?!", "Nde6", "Rfd3", "Nba6", "Bxf6?!", "R5d7", "1.58]", "N5b6", "R8d3", "1.76]", "dxc4?!", "dxe7+", "Ncb8", "Nc3??", "cxb6+", "-2.0]", "Bb5+?", "Bb4+?!", "1.86]", "Rab7", "-2.1]", "Nxc6?!", "Qh4?!", "2.12]", "R1g2", "-1.3]", "Rhg2", "Rgf6", "e1=Q+", "Nexf4", "1.98]", "1.84]", "N4d5", "1.82]", "gxf8=Q+", "a1=Q", "Qc2?!", "N5f3", "N8h7", "Ngf8", "Rdd5", "Rhh7", "Qe7?", "exf8=Q+", "R1d7+", "1.72]", "-1.55]", "Nb4?!", "b1=Q", "1.63]", "Qh4+?!", "exf6?!", "-1.65]", "Rcf7", "cxb4+", "-2.18]", "Qg4?!", "Rdxd3", "1.75]", "Qe2?", "Rexe7", "O-O+", "N5g6", "Ncd6", "Na3?!", "-2.15]", "Rfe6", "Nexg5", "Rcc4", "Rae7", "Red4", "R5f7", "1.93]", "dxc7+", "Nfxg5", "b8=Q", "-1.47]", "Nbxc3", "Ree4", "R5e7", "Ref3", "g7+", "Ngh3", "fxe4?!", "Bb2?!", "Bb7?!", "-1.44]", "Bd2?", "cxd5?!", "N3d4", "Bc1+", "N8c6", "Ba6?!", "dxe8=Q+", "R5c2", "Red5", "Nfg8", "-1.53]", "Nbd7?!", "Rff4", "Ne4?", "R4f7", "Nge2?!", "Rfb7", "Rdxd7", "2.43]", "Ng8+", "Rad2", "a6?", "Rec6", "Nbd2?!", "cxd4?!", "-1.5]", "Rfxe1", "Neg8", "Nfe8", "e8=Q", "Rfxf7", "Nbxd6", "Ncxb5", "Ng3?!", "gxf2", "1.62]", "R1e4", "1.74]", "Bd6?", "Rff5", "Rhf3", "2.03]", "Rhg3", "-1.42]", "Ncb6", "N4c3", "Raf7", "Rge3", "-1.82]", "R7d6", "Ng5??", "Nhf7", "-1.45]", "N7xf6", "Nh3?", "axb4+", "-2.04]", "Rge6", "Rde5", "Rgf2", "Nxd4?", "R4f2", "Nd7?!", "R1c5", "-2.25]", "2.2]", "Rbe2", "1.54]", "-1.72]", "-1.38]", "-3.15]", "Nxf2?", "Rfg7", "Rcb2", "Rce6", "Bxc6+?!", "N5a3", "Qh5+?!", "Nbd6", "R4e3", "R6d4", "Rfg3", "Bf1+", "Nexf5", "Rbe7", "b3??", "Ncxe6", "c2+", "Rcc6", "Nxa8+", "Rhh2", "Neg4+", "Qf2#", "c1=Q+", "R7e5", "f3??", "Rdd4", "Rhf8+", "R3c2", "Be8+", "Rgh6", "Nfh5", "d6??", "1.69]", "Rcxc2", "Ndxb4", "Rgg7", "Nfxg4", "fxe5?", "Be1+", "Nxa6+", "Nxa3+", "-1.77]", "Raxe1", "1.77]", "R1d6", "Bg2?!", "Nd2?!", "Ncb3", "g6??", "R8e6", "-2.05]", "1.88]", "fxe5?!", "Reh1", "axb6+", "1.94]", "1.87]", "Rch1", "Nxg8+", "Bh4?!", "Rfc8+", "c7+", "N4a6", "-2.08]", "exf5?!", "Bf8+", "Nexc4", "h8=Q", "Nhxf6", "-1.62]", "Bf4?", "R5d3", "2.31]", "Rdxc3", "Ndxf7", "d1=Q+", "Bb4?", "-1.98]", "Qf3??", "Rcxd4", "-1.9]", "Bxa5+", "Qa4+?!", "d4??", "-1.76]", "Nexf6", "Rdc6", "Nca6", "2.02]", "-2.01]", "Nc8+", "Nxb8+", "3.24]", "-1.75]", "Bg7?", "1.83]", "N6e5", "Nfe1", "dxe5?", "1.78]", "Re1?!", "Rxa3+", "Rdxd2", "R1d4", "Re1#", "-1.89]", "Rfd5", "Ncxb4", "g2+", "Ng1?!", "Nexc5", "-3.12]", "Ba4?", "Ng8?!", "N4e5", "Rh1#", "Na5?!", "gxf1=Q+", "R2d3", "-1.49]", "1.9]", "Ngxe6", "R5f6", "Ngf1", "Nhg6", "Bxd1+", "1.97]", "R1d5", "N6a5", "Rfh3", "R7e6", "-2.03]", "Rhf4", "R6d3", "Rdf6", "2.34]", "2.65]", "Rdxe5", "h1=Q+", "R7c6", "f1=Q+", "O-O??", "Rbxb7", "d5??", "R8d5", "2.0]", "2.25]", "e5??", "Bd3??", "Rgf7", "Nbxc4", "Qb3?", "dxc4?", "Neg5+", "R1c6", "2.06]", "1.61]", "2.32]", "-1.63]", "R8c4", "bxa2+", "-1.88]", "a4?", "-2.23]", "-1.66]", "Rbxd8", "h4?", "R4d3", "-2.22]", "dxc2+", "h1=Q", "Qd7?!", "Nc6??", "Rcd5", "-1.35]", "Rfg2", "a1=Q+", "Bxc3+?!", "a7+", "Ngf3+", "-1.67]", "R8d4", "-2.48]", "Qd1?!", "R4d2", "Red1+", "Bxc4?!", "Rge5", "3.27]", "Rbh8", "R8a7", "Nhf8", "Qh1#", "Nexf7", "Rcd4", "Nfh4", "Nec8", "Nexc3", "R5f2", "Bd1+", "Rcf2", "-1.85]", "Nhxf5", "-1.81]", "R5f3", "Rhg7", "Rbf7", "Bxg8+", "-2.93]", "Be7??", "Rfe4", "-2.5]", "exd6?!", "Rhe3", "Qe2+?!", "Rbc3", "Ke2?", "Rfg6", "hxg8=Q+", "Na8+", "Bh3??", "R7e3", "Bd8+", "-2.58]", "-2.14]", "Rhxg8", "R2e4", "Rgd7", "Bh3?!", "Rhd2", "R6f3", "N1f3", "Rfe5", "R8d2+", "Rch8", "3.48]", "1.96]", "Rce3", "Nxa1+", "Bc5??", "-1.87]", "Rexd4", "dxe1=Q+", "Nfxe6", "1.8]", "Rhg6", "Rdxe2", "Nxg1+", "N8f6", "N5h4", "N5e4", "N5d4", "Bb3?", "N3e2", "R8e3", "3.51]", "R4c7", "N3e4", "Nhxg4", "-2.33]", "-2.81]", "Rdxe7", "g3??", "-3.55]", "R5c7", "R1d2+", "Nhxf3", "Nbxc5", "Rexd5", "Qa4?!", "Raa3", "Rdb6", "R8c3", "Ngh4", "R6f4", "1.85]", "1.57]", "f8=Q+", "dxc3?!", "-2.46]", "Ndxc6", "Raa6", "Nce1", "Nd5?", "R4f6", "R5f4", "Rgd6", "Ne2?", "R8d2", "R5e4", "Ba2+", "N4f6", "Rdf4", "2.72]", "Qa5?!", "Rfc1+", "-3.18]", "-2.98]", "Ndb1", "f6??", "R1e7+", "N6e7", "Reg6", "Bb8+", "Rbh1", "-4.31]", "Rbc5", "Ba7+", "2.53]", "Qxf1#", "-2.13]", "-1.79]", "2.69]", "-2.72]", "-2.27]", "Ree5", "Ne7?", "3.2]", "R1c3", "R5c4", "R1f7+", "R4d5", "Nhxg5", "Raxa2", "Nca3", "Nh4?", "Rca7", "Rdg3", "Rfh4", "-3.13]", "-2.53]", "Bxe5?", "Rdc4", "-2.29]", "fxe5??", "Reg4", "dxe2+", "2.16]", "Bd2??", "R4e6", "Rbc6", "-2.19]", "Rac6", "cxd1=Q+", "bxa8=Q", "Nfd2?", "R1e5", "Bxd8+", "3.36]", "e6??", "2.04]", "Nc1+", "Kf1+", "-1.59]", "Ngh2", "-2.36]", "bxa6+", "Ngxf2", "-1.78]", "Qe5+?!", "R5e6", "R7d5", "-1.68]", "-3.7]", "Ng1+", "d3??", "Rdf8+", "Rf1#", "Rac4", "Rdh3", "-1.52]", "Rhf6", "Rba4", "Rgb1", "-2.12]", "Rce4", "Nxd4??", "-3.22]", "R8e5", "Reg5", "R8xc6", "-1.74]", "-2.7]", "Rab6", "R2c3", "Rdh4", "-1.96]", "-1.73]", "3.1]", "Rcxc7", "Ngh6", "-2.73]", "R1d6+", "Bb6?!", "-2.56]", "R1h2", "Qxf3?!", "Na6?!", "3.84]", "-2.41]", "3.72]", "2.13]", "bxa7+", "Rdh2", "R1e6+", "R3b2", "b6??", "2.71]", "e1=Q", "dxc8=Q", "-2.74]", "2.24]", "Rdxe4", "-3.48]", "2.21]", "Nhxf4", "a8=Q+", "-2.68]", "Rgh2", "Nac8", "cxd8=Q+", "Rfh8", "-1.86]", "axb7+", "dxc1=Q", "Rbd3", "-3.2]", "Nab8", "R3f4", "2.58]", "-2.17]", "Rge8+", "Rhxd1", "Nba3", "Rhf7", "Ne5??", "exd8=Q+", "2.27]", "N7e5", "3.17]", "3.67]", "Ndxf5", "b1=Q+", "Ngxe3", "Ref5", "Qxf2#", "Nfe5+", "2.41]", "Ng4?", "Bd5?!", "R1xe6", "Qb6?", "R6f5", "2.37]", "Rbc4", "Rbf2", "Rba7", "Rfd4", "Rdxe6", "Rbb3", "R3c7", "Ba5?!", "Rexd7", "R8xd7", "N2e4", "dxe4?", "2.46]", "Bxh6?!", "Rgf2+", "Rexc1", "2.51]", "R8f5", "exd1=Q", "Rdxd8", "Rfc3", "Bb4??", "3.13]", "Rba2", "3.55]", "-3.39]", "R8b6", "Rdxe8", "2.39]", "Nh5??", "3.37]", "Rexf8", "-3.1]", "Rdxc8", "Bb4+?", "R8h2+", "Raxb2", "Bb1+", "R4e7", "Nfd6", "Rhg4", "-2.51]", "Qe6+?!", "Rfh1", "3.43]", "3.96]", "exd8=Q", "2.91]", "-3.34]", "c3??", "Rcxc3", "Bg3?!", "cxd4?", "Ndxf4", "Qd2?", "3.11]", "3.31]", "Rexe4", "N3e5", "-1.95]", "Nb5?", "R1g3", "-1.92]", "Nec7", "Ndc7", "Rdxe1", "-1.57]", "3.46]", "3.94]", "-2.37]", "Bxc3?!", "dxc8=Q+", "-1.99]", "-1.8]", "-1.54]", "Qh4?", "gxh5+", "3.15]", "c6??", "Ncxe3", "Rexd6", "R4c3", "3.75]", "Bxd5?!", "Rexd3", "Rdxd6", "2.11]", "Ncxd7", "Raxd7", "R6e3", "Rgc3", "Qg1#", "f8=Q", "Bxe8+", "Ref4", "Rcc5", "-1.69]", "Ngh7", "Bd7?", "Rdxd5", "R4f3", "2.01]", "4.22]", "Rec5", "b7+", "Rgxf1", "Nfxe7", "Nd5??", "Rdh6", "-2.24]", "-2.97]", "R6e4", "-3.14]", "-3.19]", "2.07]", "2.33]", "3.86]", "Rcxd2", "Rexe5", "Rgh3", "Rgf4", "-3.94]", "Rdc5", "2.59]", "Nge4+", "3.22]", "Rdg4", "Rhg7+", "Naxb4", "3.81]", "-6.82]", "2.63]", "Nb6?!", "Nef3+", "Bg2?", "-2.43]", "-2.86]", "R4d6", "fxe8=Q", "Rbd1+", "fxe7+", "Reb3", "-2.85]", "Rexf1", "Kf1?!", "R8f4", "2.05]", "Qg4??", "dxc5?", "-2.39]", "Rbd6", "Rfxe3", "R8e7+", "2.82]", "Nfg1", "Rhg5", "Rbd5", "Rcxc6", "gxh8=Q", "Bxf7+?!", "h5?", "Rexe3", "R4d7", "Raxf8", "Nce4+", "Rfh2", "Qe5?!", "a2+", "Rbe4", "bxa3+", "-3.46]", "Rfxe7", "2.81]", "3.03]", "2.93]", "R8d3+", "-3.32]", "R3d6", "-3.25]", "-2.8]", "R8a3", "Ng6?!", "2.68]", "Qg5?!", "Qg3?!", "Reg2", "-2.11]", "-2.57]", "-2.83]", "Nfxg3", "R1b5", "Rgxg2", "Rexe2", "R3a2", "3.49]", "R7c2", "Bxc8+", "-3.5]", "Bh5?", "-1.71]", "3.57]", "3.65]", "Qh5+?", "-2.63]", "3.89]", "Rd1#", "R2e3", "2.73]", "Qc2#", "Qe4+?!", "-2.2]", "-2.71]", "-4.29]", "Rbe8+", "Nfxd3", "-2.67]", "-1.64]", "-1.94]", "bxa4+", "Rfa2", "Nca4", "R1b3", "Nd2?", "3.18]", "Rgd3", "2.5]", "Rgxf2", "Ngh5", "3.7]", "-2.52]", "Rhf5", "Nbd3+", "Rbxb2", "3.59]", "exf3?!", "R1h7+", "Qxd1#", "R3f5", "-2.3]", "exf6?", "Nab3", "2.08]", "Bxb1?!", "Raxa7", "Rhd8+", "-2.16]", "3.39]", "2.09]", "2.6]", "Rfg5", "-1.58]", "Rgh5", "-3.06]", "-2.45]", "Bxb7??", "-2.31]", "-3.31]", "2.79]", "R7c5", "a3??", "2.77]", "Rgb8", "Rdg2", "Naxc3", "Ng4??", "Nhf2", "Rhxh7", "exd1=Q+", "Rexd2", "1.92]", "-3.79]", "R1c4", "3.82]", "Rxf1#", "gxh1=Q", "Na5?", "Rdg6", "Rac3", "Nbc7", "Nba4", "Nhf1", "-2.89]", "Qh2#", "-3.08]", "R8a4", "R5d4", "h8=Q+", "1.79]", "Ba3?!", "Rbxc6", "Nc5?!", "2.29]", "Nexf2", "Rhxh2", "Qa1#", "Ncb1", "exf4?!", "Bh5?!", "R2d4", "-3.56]", "-3.42]", "Ne7??", "a6??", "2.45]", "3.54]", "1.95]", "R1h3", "Rhd3", "Rfb2", "Bb5??", "-3.0]", "Rb1?!", "Be5?!", "2.19]", "Rcg7+", "-4.11]", "4.03]", "Naxc5", "bxc1=Q+", "fxe4?", "-1.7]", "R1h4", "Qe1#", "2.22]", "4.01]", "R6d5", "-3.11]", "-3.09]", "Reb2", "2.36]", "Qe2#", "Qa4+?", "-1.91]", "Rdb2", "f1=Q", "R1f4", "Rcf3", "Rexe6", "R2f6", "Rbg2+", "Rhg2+", "3.6]", "Rag1+", "-1.83]", "3.58]", "R2b4", "Rhd1+", "Rexe2+", "7.6]", "1.89]", "Rhe5", "Rbd4", "Na4?!", "Rcb3", "Nhf6+", "Ncd8", "R4g2", "Naxc6", "-3.62]", "R7e2", "Bxb4??", "R3f6", "4.51]", "Rcxd6", "Rdg7+", "3.5]", "R5b7", "R6e2", "Nef2", "-2.84]", "Bxe1+", "-3.03]", "Ngxf4", "R7d2", "-2.96]", "-3.36]", "Nbc2", "N7xc6", "Rhh3", "Rexc8", "Nhg8", "Ncd3+", "R1e2+", "N6f5", "Rca2", "2.15]", "Rexf7", "3.9]", "Rbxa2", "1.99]", "2.49]", "hxg1=Q+", "R6b2", "-2.66]", "-2.06]", "-3.16]", "-3.28]", "Rdxa6", "R4c2", "Nfxd6", "bxc1=Q", "-2.26]", "R1xd5", "-3.23]", "Rad4", "R1a2", "2.76]", "3.02]", "Rec8+", "3.8]", "2.61]", "-3.07]", "Be2??", "N2xf3", "R1d7", "Nbc8", "R8f7+", "-2.61]", "Nxc3?!", "2.56]", "2.75]", "3.87]", "R2b3", "-1.61]", "Nab6", "-2.55]", "Rdh7", "Nde7+", "Qxb2#", "Rcxd5", "Rag8+", "Nfd2?!", "R3c4", "Nxa5+", "Nfd7?!", "Ncd1", "-3.59]", "f4??", "R3e4", "2.1]", "Ncxd2", "Rf2#", "Rfxf4", "Bf4??", "e4??", "-3.91]", "dxe6?!", "2.28]", "2.18]", "-2.21]", "-6.89]", "3.06]", "Rdxf1", "R6g7", "R7d3", "Rdxf7", "Rbxb6", "Rfxd3", "-2.4]", "-2.54]", "Nb8+", "-3.17]", "Be3??", "R7g2", "R2d5", "2.89]", "Rbc1+", "-2.91]", "Ngf7", "N2f4", "2.66]", "N6xe5", "-2.65]", "Rcd1+", "Rgxg7", "3.56]", "N5g4", "R4f5", "2.54]", "-2.95]", "N5f4", "Bf3?!", "3.62]", "-2.88]", "4.05]", "Rxa5+", "Rcb6", "Be4?!", "R8h4", "c4??", "2.7]", "3.77]", "Nexg6", "Rfh6", "Nhg7", "Raxb7", "Rfxf3", "f5??", "Qd4?!", "Qe3?!", "-2.77]", "Ncxa5", "Nbxd3", "-3.52]", "Qe2??", "Rfxf5", "-2.9]", "Reg7", "-3.49]", "R2f3", "Rgg3", "Rdh5", "Rce5", "R8h7", "R8c5", "Rbc2+", "Rhe2", "Rad5", "R6c5", "R8c2", "Nab1", "Qd1?", "Rdg7", "Nxe5??", "Rfxb1", "fxe1=Q+", "Bxd4?!", "R1xd3", "Rhd6", "-2.34]", "Rfxd7", "Nhxf6+", "R6e5", "Bxe7??", "-3.41]", "Ng6?", "Nfxe3", "Qxh3#", "R3g2", "-4.0]", "-3.89]", "Nd4??", "Rfb8+", "Rfh5", "Nce2?!", "R1f5", "bxa5+", "Nfe4+", "-2.59]", "2.38]", "3.21]", "-3.44]", "Rae5", "Ra6?!", "Rdf1+", "R7f6+", "2.62]", "3.0]", "Rcxf6", "Raxc4", "6.75]", "Rad3", "Nexc6", "Bg7??", "Kf7?!", "Bg8+", "3.38]", "-2.64]", "Ngf6+", "Nef7", "-4.34]", "-4.37]", "Raxa4", "Qxh2#", "N7c5", "Qd6?", "Rgh4", "4.89]", "R3e5", "Ndf4+", "Rfxe4", "Rhd5", "Qc3?!", "Rec4", "gxf6?!", "Ned6+", "-3.77]", "Rfxf6", "R6c4", "N4h5", "Nxa4+", "Nxe4??", "Ba6?", "R5g3", "N4f5", "Nfh7", "Rbxf2", "3.19]", "Rbb5", "R1xe2", "7.43]", "Rae3", "N6xc5", "Ngf2", "cxd4??", "7.52]", "-3.96]", "-3.97]", "Nec1", "Rbxc7", "Rbxb5", "2.14]", "Rcxc4", "exf8=Q", "Bxh3?!", "Nhxg2", "Raxa6", "Rca3", "Nef6+", "R8xe3", "N7f5", "Neg7", "Na3?", "N7b5", "Rac5", "a5?", "Nhf3+", "R1a6", "-3.61]", "2.87]", "Nf7?", "Nb8?!", "4.12]", "Rdb4", "Bxb8?!", "Rgxg7+", "R1a5", "Qxe1#", "Ndf6+", "-3.51]", "Rea2", "Ndf7", "Nh6??", "Rbxb7+", "4.56]", "-3.45]", "3.74]", "e3??", "Nfd3+", "Rexe6+", "Qc1#", "g8=Q", "R6h7", "-3.66]", "N1xd2", "Nce5+", "Rab4", "R3c5", "N2d4", "-3.02]", "Rgxg2+", "3.44]", "R2xd3", "Ndf7+", "Raxa3", "Nfd4+", "N3g4", "-2.28]", "R8xf6", "Rfxe6", "Bxf3?", "2.67]", "2.3]", "Nca5", "3.29]", "R8b5", "Nfh6", "Rfxf7+", "Bxd5?", "Rge4", "Bxf6?", "-4.1]", "Nde2+", "Rexc6", "3.47]", "Raa5", "Ndf2", "Raxg8", "cxd1=Q", "N3a4", "4.18]", "R8xd6", "Kd7+", "Rca6", "cxb5?", "-3.6]", "Rcxb7", "Rfxd4", "R8xc7", "Rbb6", "Ndxb2", "R5g2", "3.93]", "-2.62]", "-3.65]", "Nh4?!", "Ng8?", "R2d6", "Rgf5", "Nh3??", "Qxc1#", "Raxb6", "Rhd7", "-2.87]", "Raxc3", "R1f6", "R8a2+", "R1e7", "-4.15]", "2.84]", "Rge2", "Bh6??", "Rda3", "c8=Q+", "Bxc1+", "-4.44]", "Qf5??", "5.36]", "Qd6??", "2.97]", "R1xf2", "Nbd2?", "-2.99]", "Nbc1", "Na6?", "Rcxc1", "Qf1#", "Nexf3+", "Rh2#", "-4.05]", "Ne4??", "Rhxe1", "Bg6?", "4.27]", "7.35]", "4.2]", "g8=Q+", "Rcxc2+", "Rgd2", "Nef8", "Bxg1+", "N8g6", "-3.84]", "2.52]", "-2.94]", "4.13]", "Rhe7", "Bf1?!", "N5c4", "2.26]", "Rdxf2", "R4e5", "Nec2", "Bxf2+??", "Nhg1", "Bb6?", "3.16]", "Raf3", "-3.24]", "exd5?", "5.21]", "R1xd2", "N2d3", "7.58]", "R7e4", "Qg6?!", "Nxf7??", "R7e6+", "fxg8=Q", "Ndxf2", "R8e4", "Rae6", "Ncb7", "R8h7+", "-3.82]", "-2.32]", "-3.54]", "4.67]", "2.88]", "b8=Q+", "Rad6", "R3h2", "#1]", "Nc4?", "R8g6", "Nxd8?!", "-3.04]", "3.95]", "Qg5?", "-3.71]", "Rhxc8", "R3d4", "fxe8=Q+", "Rcxe6", "R5d6", "Rbf4", "Rcg3", "Rgxd5", "Rbxf7", "N8c7", "Rbf6", "Rexb7", "Qh5#", "Nde4+", "Rfg4", "cxd6?!", "Rhh5", "Bxc6+??", "-3.58]", "-3.53]", "dxc6?!", "Rag7", "3.61]", "g1=Q", "R4xf3", "-4.25]", "-4.18]", "-4.17]", "Rhxg1", "R6xe5", "Qc3?", "-4.32]", "Rcxc5", "3.98]", "R4g7", "Raxf2", "3.25]", "R7b6", "R3d5", "5.25]", "Nhg3", "R5g7", "Raxe7", "N4b5", "4.4]", "6.56]", "Nfd8", "Qa5?", "Reb4", "R8e3+", "g5??", "-9.19]", "Rcxb4", "R6a7", "Ke7+", "R5h4", "N1h3", "Rdxc1", "Rhc8+", "Ndf3+", "c5??", "8.51]", "6.69]", "Ke7??", "Rbxb8", "Rfc4", "R3xc5", "Rbxb4", "Ned5+", "3.42]", "Ngf6?!", "3.63]", "Qb4?!", "Bxe5?!", "Kf8+", "3.64]", "5.16]", "Rhf2", "Bxc4?", "Nge6+", "Nce7?", "Rfxb8", "3.26]", "3.09]", "Rfb5", "Qf3#", "R5c3", "Qf4??", "Qc5?!", "R1a7+", "2.86]", "Rda4", "N3g5", "R6c2", "dxe5??", "R2c4", "N3d5+", "R2d3+", "R7c3", "fxg1=Q", "Rea5", "R5a2", "Rfc6", "bxc8=Q+", "Nbc3?!", "N6e4", "N5e3", "Qxd4??", "Nf5?!", "Rea3", "2.42]", "N1a2", "-3.05]", "3.91]", "4.86]", "bxa1=Q", "Qb5??", "fxg8=Q+", "R7f4", "Rhxg4", "Naxb5", "Nfxh4", "Ndxc3", "Nexf6+", "Ncd4+", "Ng1?", "3.97]", "Ngxe6+", "-3.43]", "Ngf5+", "R1g4", "4.53]", "Rgxd8", "Bxb8+", "Reh2", "Bh6?!", "Nbd7?", "Bd6??", "h3??", "Rcxf2", "Rcxa7", "4.34]", "Reh4", "R7b3", "N6h7", "Ncxe4+", "R7f3", "4.21]", "Nxc7+?", "Qxc2#", "2.95]", "-4.01]", "-3.81]", "R2c5", "R1c7", "Raxd6", "R8g3", "3.32]", "Qd7?", "4.54]", "-3.73]", "3.52]", "Rfb3", "Rdxd4", "N2e3", "cxd6?", "Rgd4", "Rxh2#", "R5xd4", "Bd5?", "Qd7??", "3.34]", "Rce8+", "-4.53]", "-4.57]", "d8=Q+", "-2.78]", "R8e2+", "Rfxf1", "Reb1+", "Nexd6", "R6b5", "R6xd5", "Rdc1+", "-3.76]", "Rfa3", "Nge2?", "R3e7", "Kf3+", "3.08]", "Nfg4+", "-4.6]", "Raf2+", "R3f7", "Bg3?", "Nb3?!", "Qe4+?", "-2.76]", "Rg2#", "Qe7??", "Nc5?", "R1a3", "Qg3?", "3.79]", "2.44]", "4.79]", "4.73]", "4.83]", "Qa5+?", "N2xg3", "R7g6", "N2xd4", "N5xf6", "Nef1", "Rhe6", "Rexf5", "R1xc2", "R2g7", "Nef5+", "Qd8?!", "4.46]", "2.35]", "Raa4", "Nd6??", "7.27]", "7.36]", "Nf4?!", "R8b3", "N3xf4", "Nhg4+", "2.48]", "R8xc3", "N5h3", "Nexd3", "Nbxc7", "R8b4", "R8d7+", "Rfh7", "Raxb4", "Ncxe5+", "Ndxe3", "4.26]", "R8b2+", "Rbxb2+", "4.57]", "7.15]", "#6]", "-2.02]", "-7.08]", "R4b5", "Qc6?!", "Qh4??", "Rbxd3", "R1c6+", "Ngxf5", "4.17]", "Rhxg2", "Bb5+??", "Qg6?", "2.83]", "Raf8+", "cxd5?", "Rxa4+", "N3xe5", "3.04]", "Rhh6", "R1xe3", "Rcxd7", "Rexc7", "Qf4?", "R2f7", "Rgxf4", "Bb2??", "Rdxc5", "Nbxd3+", "2.96]", "Ngf2+", "-3.9]", "cxb8=Q", "R4b3", "Rdg5", "Kf7+", "R5c6", "dxe4??", "Rdb3", "Nhxf3+", "R8g4", "R6f2", "5.42]", "2.99]", "N7d5", "Nfh3", "Rce1+", "Rb8?!", "R2d7", "Qc3??", "2.8]", "Nbd6+", "Bxg4?!", "N8a6", "R8f2+", "R3f2+", "Rbg7+", "Ndxe6", "R8xd5", "R6b7", "R1g2+", "Rdf2+", "-2.75]", "2.64]", "2.55]", "Rexf6", "Nfxg6", "R8h3", "Raxf1", "4.68]", "-4.51]", "dxe1=Q", "5.11]", "#-2]", "Rdxc2", "R8xe7", "4.15]", "R2b7", "Rae4", "fxe6?!", "Rca4", "R4c5", "Qg4#", "Nab2", "Rdb7", "Rhxe4", "3.12]", "Bf5??", "Ndb3", "-3.29]", "R4b2", "2.57]", "Nexf3", "R7a6", "Ng3?", "-9.24]", "Bb7?", "-3.87]", "R7f2", "Rdxd2+", "Bg6?!", "R1h2+", "-4.41]", "R4c6", "Qe4?!", "Qd3?", "R1xc6", "Nhf4+", "Rde2+", "2.9]", "b2+", "Nd3?", "g1=Q+", "Raxg1", "Na1+", "Kf7?", "Na4?", "-4.3]", "Rbe1+", "R2xb3", "#-1]", "Rdxc6", "bxc6?!", "Bc3?!", "Rbb4", "Nh5?!", "Qc2?", "-2.07]", "Raxf7", "Qb2#", "-3.68]", "exd6?", "Rdxb7", "R2f4", "3.35]", "R8f3", "Rhh4", "Nfe6+", "Bxc5??", "Bxd5??", "Rba3", "-2.82]", "-3.67]", "axb1=Q", "5.53]", "-4.22]", "R4a3", "h6??", "Rhc1+", "7.65]", "3.3]", "Kg8+", "Raxa5", "4.43]", "Ncd6+", "N5e6", "Nbxc2", "R1g6", "-4.5]", "-3.47]", "Ke2+", "-1.97]", "R2e5", "Nd7?", "R6xe4", "Rge7", "4.29]", "3.68]", "R7f6", "Rcxd3", "-3.4]", "Ke7?!", "Rcxf7", "Qe7+?!", "-3.86]", "N4xe5", "R7xc6", "Reb7", "Red8+", "R4a5", "Rbxd2", "Qxg7?", "Rxh3#", "Rhxf5", "Nge7?", "Kf2?!", "Rfxb2", "Ncxd5+", "Nd6?!", "cxb5?!", "Nde1", "Nac3+", "Qc7?", "Rfxf2+", "Rgc2", "Qxc7?!", "Kb1+", "R2xc4", "Ned1", "Nfxh7", "Ndc2+", "-6.09]", "Rbxe5", "Reh3", "R4xd3", "2.47]", "3.4]", "Bg2??", "-8.64]", "-2.38]", "7.05]", "Rcxa3", "Ncxb6", "R5a4", "Ba6??", "Nb6?", "exd5??", "-6.81]", "-6.88]", "R7xf6", "4.3]", "4.35]", "R1b2+", "Re8#", "-6.43]", "-6.45]", "-6.83]", "Rbxa4", "4.14]", "7.11]", "7.18]", "6.61]", "6.44]", "R8xa7", "R5g4", "Bc2?!", "Ndxb7", "Ndxf1", "7.78]", "6.65]", "Bxb5?!", "5.0]", "R5g6", "R2xe3", "R1f2+", "c1=N+", "R7h6", "N1xc3", "6.42]", "N7e6", "Bf6?!", "Raf1+", "R6xd4", "N6b5", "-3.27]", "Na5??", "R1xd6", "Nge8", "N3xc4", "Rag2", "Rgxh7", "3.66]", "Raxc7", "3.23]", "Ngf4+", "R3b5", "7.46]", "7.31]", "7.7]", "7.96]", "fxe2+", "Rea6", "7.55]", "7.51]", "Raxe6", "Rgb7", "Rbf5", "Rgf1+", "cxd8=Q", "Ng5+?!", "Nbc7+", "R2g3", "Rcb5", "Kg3??", "Rdxa2", "Rda5", "exf3?", "Rdxc4", "N4xd5", "Bc3??", "5.28]", "5.23]", "Nh1+", "N1f2", "Bxe4??", "N5xe4", "R8d4+", "Raxb3", "Ndf3?!", "-7.01]", "exd3?!", "Rhe4", "Bxg8?!", "Reh5", "Rfxe2", "g6#", "Nfd5+", "Nxc6??", "Nh4??", "N8a7", "axb8=Q+", "Rhb7", "Qxf6?", "Rda7", "4.47]", "R5h6", "Rgxf5", "-2.92]", "Rdxe3", "Rda2", "Rgb3", "R3xd4", "Kf6+", "Bd7??", "6.14]", "Bf3??", "4.11]", "b6#", "Rcxc6+", "Raxe5", "Kd3+", "Qxb1#", "3.85]", "4.04]", "Qg6??", "Rcxc8", "R6a2", "N3f5", "4.38]", "Rdb5", "fxe4??", "9.18]", "2.92]", "Nexg5+", "Qb1#", "Rdxc7", "R5b2", "dxe8=Q", "R8e2", "Qe3??", "Rgxf3", "Qb4+?", "Qh3??", "R6h2", "Kd2+", "Rcxb3", "R1a4", "Nce3+", "R8h6", "Rexb2", "Nfd7?", "R8xf7", "Bf6?", "Rfg1+", "R6b4", "-3.74]", "Red7+", "N2c4", "-4.21]", "Ncxa4", "Nxb5?", "Ke6?", "Re1?", "Rexe5+", "bxa1=Q+", "Qxb7?!", "Rca5", "Rab7+", "Rbxe4", "Nexg3", "-3.63]", "R7h4", "R5xc4", "Bh3?", "R2xg3", "R3g5", "R8g3+", "Nhg6+", "2.78]", "N3xe4", "Rexe8+", "R2e3+", "R5h2", "exf8=R+", "Kxd2?!", "Qb3+?", "4.84]", "Nh5?", "Rfa7", "R4h2", "Rhxf7", "Kc4+", "bxc4?!", "R3b4", "Nfg5+", "R7xd6", "N8b6", "N8xd7", "Nfxe1", "Bxe4?!", "Rcd8+", "R2xf7", "Rgg6", "9.78]", "3.92]", "R7d4", "Ra6?", "Ke7?", "-3.72]", "-4.52]", "-4.48]", "#-11]", "-2.79]", "Rga1", "R5xe4", "N7xd5", "Rgg4", "Rhxe8", "N2xc3", "Rbd8+", "R2e7", "Qg4?", "Rbf7+", "R4g3", "4.08]", "N2g4", "Rfxc2", "Rfa4", "Rdxa7", "Rae2+", "-3.93]", "R1xf3", "Rgxe7", "5.3]", "5.18]", "Nfxe8", "10.57]", "Bxf4??", "-4.26]", "5.26]", "#5]", "R7f5", "-3.38]", "R1a7", "Rgxg6", "R7b2", "N2a4", "Rexc5", "Kf8?!", "Nd2??", "axb1=Q+", "Nac6+", "Rgg5", "Rcxd2+", "Rhf2+", "N6c5", "Ncxe8", "Raxa8", "Qxd5??", "-3.37]", "Rh3?!", "Bxe7?", "Rgxe4", "gxf3?", "R1xg5", "Nfxd6+", "Nfg2", "-2.35]", "Qee8", "Qh6#", "cxd5??", "-8.82]", "Qc4?!", "Rhxc1", "Kxf3+", "Rch4", "-7.98]", "Rgxe6", "Rh6#", "R4b6", "Be6??", "N4e5+", "Qxf3??", "Rhd4", "3.69]", "N4c5", "2.74]", "3.28]", "3.71]", "Qxd2+??", "10.56]", "Nexc8", "7.94]", "8.05]", "R2h6", "Rhxd8", "Nfxh6", "Nxe6??", "R3xc4", "Rhxh3", "Rexb3", "-3.69]", "3.07]", "5.01]", "Rfe2+", "Qxc5?!", "gxf3?!", "Bxa3?!", "R1f6+", "Rh7?!", "Nba7", "N3f4", "N3c4", "axb8=Q", "Rea7", "Ba3??", "R8xc5", "Rexf2+", "Nge3+", "4.55]", "R2a3", "-2.47]", "gxf3??", "-3.8]", "5.6]", "4.25]", "4.5]", "N5a4", "Nhxg6", "Rcxf8", "R2f5", "Nhf5+", "Rgxg3", "R5xe3", "Nfe3+", "3.83]", "Rba6", "-3.21]", "-4.4]", "R2xd6", "Qe6??", "7.56]", "Nac1", "R3g6", "N7e5+", "Ndb5+", "Bd4?!", "Rdc8+", "-5.73]", "7.21]", "10.98]", "Ndxf6+", "Nfe2+", "Ba5?", "Rgxe3", "Rg1?!", "-7.91]", "N6xd5", "Qh6??", "R6g3", "Qxd6?!", "Ndxf8", "Rdxd7+", "R8g2+", "-10.68]", "7.63]", "7.62]", "-10.18]", "Reg2+", "Bb7??", "Rgxf8", "Rhf7+", "Rd2#", "-4.93]", "-5.53]", "Kf4+", "N4xf3", "R8b2", "Qe5?", "Qc4??", "Rcxc7+", "Qd2#", "Qh4#", "Ke3+", "Rcxb6", "Kd1??", "Nfxd3+", "Nfg7", "dxe6?", "Qb3#", "Ne1?!", "Ndxc2", "Rcg6", "Rbh4", "Rdxb3", "Rbxa7", "Ndf5+", "5.06]", "6.58]", "R3a7", "Nec5+", "R2h7", "Rfc7+", "-4.23]", "R1h7", "-4.2]", "-3.78]", "N4xb3", "Rcb4", "Rcxf4", "-3.75]", "8.35]", "R1c5+", "#-3]", "Rc1#", "Rexb5", "Qxe5?!", "Qe6?!", "Qxc7?", "Qxe4+?!", "4.93]", "-4.13]", "-3.35]", "Ne6?!", "Rfxc5", "Ndc4+", "Nxg6?", "N6f5+", "Qg3#", "R8xe4", "R1xf5", "R2g4", "4.72]", "5.43]", "Ndxb6", "Qxf6?!", "Ncxd6", "Qf4#", "Nfxe4+", "R1xf4", "Ncb5+", "Bh6?", "Qd8?", "Rcg2", "Rbg2#", "3.14]", "-2.09]", "Ref2+", "R7h6+", "Neg5?!", "Rexe8", "Rdxd1", "-4.47]", "7.69]", "7.53]", "Nfxh5+", "Qh3#", "R1xd4", "Qd3??", "8.84]", "Ndc2", "Qxd3??", "Nde8", "N7xg6", "R1h6", "R2a4", "Rg1#", "Ke1?", "Ned3+", "Rgf7+", "Rfe7+", "4.06]", "Rdxe2+", "Rcxe4", "N2xe4", "Qxg1#", "Ref8+", "Nbxd6+", "N4e3", "Bxh8+", "R8xe6", "Nhxf1", "Rbxc2", "Ndc7+", "7.3]", "R2c7", "-4.43]", "N3h4+", "R7xa5", "R8h5", "N7d5+", "Rbxa6", "-6.13]", "R1b7+", "3.41]", "fxe1=Q", "10.63]", "Bxf7+??", "-7.03]", "R4g6", "Nfd6+", "Rbxd7", "N4xh5", "Qe6?", "-4.81]", "Kf2+", "Rexf3", "Nf7?!", "Qc6??", "6.57]", "5.92]", "R4xf5", "-4.08]", "3.53]", "Rcxa6", "R3e6", "2.98]", "R4h3", "Ncxd4+", "5.98]", "3.78]", "8.18]", "Qc1?!", "7.95]", "2.23]", "-2.6]", "N3c5", "Rfxf1+", "Rbxd4", "Rfb4", "-6.2]", "Rexc2", "Ncxd6+", "-2.69]", "R8g5", "Nbxa5", "3.76]", "Rbe3", "Nfxg7", "Rbxb3+", "Rbxe8", "2.4]", "Kf1?", "Ngxh4", "-5.64]", "R2xd5", "Bxc6?", "-3.33]", "Rhxe6", "cxb4?!", "Ncd5+", "Nfg6+", "6.95]", "Qxf3?", "Kf1??", "Nexc2", "Nef4+", "4.69]", "4.61]", "3.01]", "Nba5", "-2.42]", "7.37]", "R2c6", "Bc5+?", "-4.27]", "4.32]", "2.94]", "R4h7", "Qd1#", "N1c2", "Rdf5", "R2b6", "N4f5+", "5.03]", "Qd4?", "Rfxe5", "Qxb7?", "Ncxd3+", "b5??", "Nb3?", "4.36]", "Qf5?!", "N4a5", "9.74]", "R2xa3", "R6g4", "Reb6", "N2xe4+", "Rexf4", "Nexc2+", "Qxe4+?", "Rah5", "R2xh3", "-4.14]", "Nhxg4+", "Rh8#", "Rfxe6+", "N4g5", "Qxd6?", "Rbxc3", "-6.22]", "-15.61]", "Kc1+", "Ng3#", "cxb6?!", "-8.26]", "-8.2]", "-8.55]", "-2.49]", "-5.43]", "Qhc5+", "Qc1??", "R6xa3", "N6xh5", "R6xc4", "-9.35]", "O-O-O?!", "Rexb8", "R3h4", "Ned8", "R7c6+", "N3xg4", "Ned4+", "bxa6?", "Qxa7??", "R1h5+", "Ndxb3", "R5xf2", "Rxb3??", "Bxb4#", "N5xb4", "N6c4", "Kxf7??", "11.53]", "11.42]", "Bxc2?!", "Nhxf8", "6.8]", "-6.15]", "Raxh8", "-10.44]", "7.2]", "Bxh8?!", "7.19]", "6.3]", "R8c3#", "-9.12]", "-8.91]", "Ndxe6+", "Rhxd2", "Qg5#", "Nec4+", "R4xb6", "R8xf5", "R4b7", "N5g4+", "Nba7+", "c2?!", "O-O-O?", "Rhxh4", "8.33]", "8.5]", "11.18]", "dxc5??", "12.43]", "12.2]", "12.16]", "11.9]", "Qf5+?!", "R1f5+", "Reh7", "R3d7", "R1xh4", "Bb4+??", "Ncxb2", "6.35]", "R1xf7", "bxa1=R", "dxe3??", "6.94]", "Qxd8+??", "-7.45]", "Rexg7", "R8f3+", "Qcxc4", "Qcxc3", "Qed2", "Qgb5+", "Rfxe1+", "Qh4+?", "Rcxd4+", "Rcf2+", "Rbe2+", "Rgxg5", "7.42]", "7.33]", "Nef7+", "Q8xh7", "Q5f7", "Qhxe7", "-5.23]", "Qxg5#", "Qc8?!", "Raxc3+", "Rgxd4", "Rag6+", "Nxf2?!", "Ng4+??", "6.39]", "R8a3+", "N5xc6", "4.09]", "N1g3", "cxb1=Q+", "4.37]", "Rbh2", "Rg8?!", "Bxc3?", "Rfxh3+", "5.54]", "5.64]", "10.25]", "Bxc3??", "Rg6?!", "Be5??", "Rbxd5", "Qxg7??", "Ngh2+", "Raxd4", "Rgc7", "N5xh3", "Rexb1", "Nxb4?", "Rdf6+", "Rxh5?!", "8.55]", "Qee7", "Ndxc1", "Bg6??", "Qc8?", "Nbc4+", "N7xd6", "Rcg5", "-7.77]", "-7.71]", "-7.58]", "Nf7??", "Ned7+", "Ngxf8", "Rgxe7+", "R6d3+", "11.17]", "R6c3", "Reg7+", "Rh2?", "Qxf4#", "Rhxe5", "Nexd4+", "Rhxa4", "Nxh4?!", "6.74]", "6.71]", "6.67]", "6.62]", "8.79]", "Raxd4+", "fxe8=N+", "Qbc8", "Rh7#", "Rg1??", "Reb5", "5.84]", "5.63]", "9.05]", "d4#", "Ngh3+", "-9.94]", "gxf4?!", "-9.51]", "-9.49]", "-9.44]", "-9.2]", "-9.55]", "-9.32]", "-9.61]", "-8.67]", "Rcf6", "Nce7?!", "Rfxf6+", "Rexc4", "Rba5", "Nf4??", "-5.62]", "Rc3#", "Nexd5+", "Bd8??", "-4.28]", "Rbc7+", "b4??", "Rcxg2", "Nfd2+", "N4xg5", "Rfa6", "R3xd2", "Kh1?!", "-5.61]", "R6a5", "R5a3", "cxb8=Q+", "Qbb5", "N3c2", "bxa8=Q+", "R2e6", "gxf4??", "Qxf4?", "-7.82]", "e8=N+", "R1xb4", "Nxd5??", "Nbxc7+", "Rexe7+", "Ngxh2", "Bxd2+?", "Bxd2?!", "gxf5?", "Nxf4?", "Ndb4?", "Rgxe8", "R6xc3", "Rexf2", "N1xg3", "Qb5+?!", "Ke8?!", "R1xg4", "Bd4?", "Qa4#", "R4xe5", "R6f2+", "R6h4", "Q7e2", "Nbxc2+", "17.36]", "17.26]", "17.18]", "17.07]", "Nh7?!", "Qa3?!", "gxf8=R+", "Ree2+", "-6.96]", "Qxb4?", "-8.31]", "6.77]", "6.66]", "6.7]", "6.63]", "10.33]", "Rxf2#", "Ref1+", "R7a6+", "Raxc5", "c6#", "Rg8?", "5.04]", "4.94]", "R6xb2", "Rhxh5", "Kd2??", "-4.73]", "-4.79]", "R6xg7", "Rexe1", "N4h6", "4.74]", "Qxe2#", "Qf3+?", "-4.03]", "Rh3?", "-18.28]", "-18.12]", "#-12]", "Ncxa6", "Nac7+", "Nhxf4+", "Bxb4?!", "Nec3+", "Qde5", "Raxf5", "Bxe4?", "Rdxf2+", "N5xg6", "Qxc5?", "-4.83]", "Ra2#", "Rexf3+", "bxc5?!", "Ra5?!", "Bxf3??", "Nca1", "Nhxg8", "Rhf2#", "Nd7#", "Nfd2??", "Bxc6+?", "Rbxb1", "Bxd7+?!", "Bc2??", "5.5]", "Bb2#", "Nfh2+", "10.39]", "6.87]", "6.91]", "7.44]", "Qxh7??", "Rdxb6", "Rag7+", "N5xd4", "Kf5+", "Qxf7+?!", "#7]", "Qd5+?!", "R6f5+", "Nc4??", "Nc4?!", "-6.99]", "-6.94]", "-6.8]", "Nxc4?!", "Rhxb7", "Rbxd6", "Rfg6+", "Qa5#", "Nexc3+", "Rgd7+", "R3xd5", "dxc3?", "Bg4+?", "10.75]", "7.09]", "Qg5??", "10.36]", "Ke4+", "R7c4", "Ncxe3+", "Rcxe3", "R1f7", "Qe3#", "8.73]", "8.81]", "N4h5+", "Rd5?", "-5.11]", "-8.08]", "N7a5", "Qf2?!", "N7xc5", "Rexg7+", "Rcxe5", "Nc2?", "N4a6?!", "Bh5??", "-6.06]", "-9.21]", "-9.17]", "-8.77]", "R5xh4", "N4g3+", "Nbxd2?", "-7.0]", "Qxc6?", "-4.67]", "Ngxe4?", "R8c3+", "N4d6", "Ncxe6+", "Nexd8", "Qb4#", "5.24]", "-6.52]", "Naxb3+", "Bxb5+?", "-8.36]", "Qxe4?!", "Rgxb2+", "5.52]", "5.57]", "Rfxa1", "N7xf5", "-5.5]", "-4.9]", "dxc1=R#", "Bxg4?", "Rb8?", "Rbxf8", "Rcf4", "Nab7", "Rhxf4", "Qd2??", "Nb1?", "R8xh3", "Rbh7", "Rg8??", "5.45]", "Qxd5?", "Rab5", "9.4]", "9.73]", "8.96]", "8.75]", "7.93]", "7.68]", "10.46]", "10.41]", "Rch2", "R1c7+", "Qhf8", "Bxh7??", "Rxh7??", "-6.08]", "Rfxb7", "Rce6+", "Qd3#", "fxe6?", "Nxg5?!", "N2h3", "N4g5+", "R8xf3", "Rfxh3", "-5.0]", "Bf6??", "fxg6?", "fxg6??", "4.98]", "Nhg3+", "N4xg3", "Raxg3+", "Nbc2+", "Rxb1#", "Bxd3#", "Rhxf6+", "Nh2?!", "Rexb6", "Rfxa6", "Rhb2", "R7xc4", "R7b3+", "-8.98]", "Bxh5?", "R4h5", "Nec3?!", "Nb5??", "Kh6+", "Rfg5+", "R2a3+", "N4xc3", "R8a7+", "R2h4", "Ngxe5+", "Rbxf1", "Rhxd1+", "4.7]", "5.58]", "bxa6?!", "Bxb8??", "Rdxh2+", "Nfxe2", "N3f2", "R2xb4", "R8c7+", "Nbxa7", "Rexa2", "Bxf5#", "Qg6#", "Qaxd5+", "Rgxf6", "N8f7", "Rch3", "Rfxf1#", "R1xc5", "Raxc6+", "R3xe5", "6.05]", "#11]", "Nb4??", "8.14]", "Qde3+", "R5xf4", "Rcxc3+", "Qbxa1", "c8=B+", "R2b5", "Qxa5#", "Rhxd6+", "exf5??", "Raxf6", "Bf7+?!", "-5.21]", "Nac2+", "N6b4+", "R2f3+", "6.92]", "8.17]", "12.53]", "12.29]", "11.84]", "Bxb1?", "Rxb1?", "R3e4+", "-7.84]", "-8.81]", "-10.23]", "-8.97]", "-8.88]", "N6xf5", "R6b3", "Raxa2+", "Rhxh4+", "R8xg4", "cxb3?!", "Rcd3+", "Red3+", "N6xa7", "Bxa8+", "7.45]", "R4h6", "cxb1=Q", "Ngxh6", "R3h5", "R8h4+", "-9.07]", "-9.31]", "-9.04]", "Kxf7?", "8.57]", "Bf3?", "Ba2?!", "N6g5+", "5.39]", "Bxa5?", "Q6h3", "Q3g2", "Qhxg1", "Qgxe3", "Qexd2+", "Rxc4#", "bxc6?", "N7xb6", "Qh5??", "-10.84]", "-11.79]", "7.54]", "R4xd6", "5.22]", "-13.15]", "Bxc6??", "-8.54]", "Nfxh5", "Nh2#", "R3c6", "Ngxf3+", "Ke8?", "N7g6+", "Rdxg2", "Rcg2+", "Bxc3+??", "dxe8=R", "N3xc5", "N3b5", "Rhxe5+", "-5.55]", "-5.54]", "Nxd6+?", "Qe4#", "R7xd5", "dxc1=N+", "Qxd2#", "Be5#", "Rge1+", "Naxc6+", "Rbxg7", "-11.47]", "-4.62]", "-4.74]", "-14.33]", "-14.32]", "-18.61]", "Rbxa5", "-4.86]", "-6.23]", "Rexf4+", "Rgxd6", "Naxc2", "Bxe7?!", "Nxd7?!", "-4.84]", "R1b7", "Nbc5+", "Nfxe6+", "N6a7", "R7g3", "N3xa4", "Rff8+", "Rexh3", "dxc1=Q+", "Rdxg8", "cxd1=B", "4.62]", "Nbd2??", "R7b5", "R7a4", "R4a2", "-3.92]", "Rfxe7+", "N6f4", "R6c5+", "-4.77]", "Bc5+?!", "Ngh8", "-3.57]", "Nfxg2+", "Nbxd4+", "a4??", "Nde2?", "R6xf7", "Re6?!", "Rhh6?", "-4.04]", "-4.09]", "Nd6+?", "Rg5#", "8.36]", "8.31]", "7.25]", "7.86]", "7.85]", "Kg6+", "Qxe6?!", "Ngxh6+", "Bxg7??", "6.04]", "5.82]", "9.6]", "9.53]", "Ba4??", "N3a2", "Raxe7+", "R3b6", "Rcxe7", "R2xa5", "Bc4+?", "Bxf5?!", "R1xe4", "R7a2", "R2d4+", "Rfxg6", "Rfxb6", "Ne6?", "Qxb2?", "Nh6#", "exd4?", "Ra3?", "Bg6#", "Nbd7+", "N4xb5", "-8.33]", "R2a6", "Rcxd8+", "Rfxa2", "Rexd2+", "Ned2+", "Rfxd2", "Qd5?", "Bf2+??", "5.41]", "a5??", "gxf6?", "Ncb4+", "Neg2", "Ke8+", "Nbxa4", "-6.64]", "-7.26]", "Rexb4", "Nbc3?", "Nxf3+?", "Rgxc4", "Rgxg6+", "Rbxb3", "Rxd1#", "Q4e6", "Rcg4", "Qe7+?", "Bxc3+?", "N3xd5", "Qb4+?!", "Qxb2?!", "Raxf2+", "Rbxc2+", "R1xf6", "Nxf7?!", "Rfxf5+", "Qeh6+", "Bh7?", "R7h2", "fxg1=N+", "R3xa5", "7.34]", "R1e3+", "R8e4+", "Nc7?", "Qxd4?", "-3.98]", "Red5+", "#2]", "Nhxf2", "Rhxg7", "R5b4", "Rag2+", "6.0]", "5.83]", "7.89]", "7.88]", "Kd2?!", "Bxg4??", "N2xc4", "Bf2#", "Rcxe2", "R6xh5", "Qxb7??", "R8d6+", "Qad7+", "Kb6+", "Rec1+", "N2b4", "R7f2+", "18.92]", "18.61]", "R5h3", "Rfxc6", "Reg8+", "Rbf2+", "R7e5+", "Ng5+?", "-4.65]", "Qxd3?!", "Nbxa2", "Bb6??", "-4.8]", "7.67]", "Bxb5?", "5.62]", "R2f7+", "-10.67]", "-10.73]", "-10.79]", "R6e5+", "Nhxg3+", "Ne1?", "Rxg4#", "R3h7", "Bh4+?!", "Rxg2#", "R3c7+", "R1a2+", "Red2+", "Ncxb8", "Rbxe6+", "-4.7]", "Bxd2+??", "7.07]", "8.76]", "8.97]", "8.72]", "Nexg6+", "Rcf8+", "N3xh4", "Rhxf3", "5.99]", "-5.29]", "Qe3+??", "6.4]", "7.59]", "7.57]", "Na3??", "Rh5#", "Ndxe1", "Ndc1", "Nf2?", "Rbf8+", "Kxf2??", "-6.84]", "-7.22]", "-8.49]", "-6.93]", "-3.99]", "Qxb3#", "Kc7+", "Rfxd6", "cxd1=N+", "Bxd7+?", "Rexd8+", "Rdg2+", "R8h2", "Nd3#", "-7.49]", "-7.51]", "-7.79]", "15.57]", "15.05]", "32.14]", "18.46]", "20.7]", "20.53]", "Rg1?", "Reh6", "gxf8=Q", "Bxg5?", "exf1=Q", "Bb2?", "Rcxa4", "Rca6+", "Nef2+", "b6+?!", "dxc1=N", "7.64]", "7.74]", "7.5]", "8.63]", "11.79]", "11.2]", "Nbd4+", "N2f4+", "-8.03]", "-7.8]", "Rhxh2+", "Rhc2", "Rea4", "4.45]", "4.42]", "5.46]", "Qa8?", "Rbxe7", "4.82]", "R4b6+", "Rhxb3", "Ndb5?!", "c5#", "R1c2+", "R8xe5", "Nfxg4+", "6.72]", "11.23]", "Nbd7??", "Rbxf3", "7.16]", "Bxh8?", "6.52]", "Nf5?", "9.23]", "9.03]", "9.65]", "9.7]", "R7xe3+", "Qe2+?", "Be7#", "R1xb5", "N6c7", "3.33]", "Nec3?", "-7.4]", "Ba2?", "R8a6", "-4.19]", "Raxc2", "Rc1?", "Rfb6", "Rxb1?!", "-5.1]", "-4.99]", "Qc4#", "Ke3??", "Qg5+?", "Kd3?", "Nb4+?", "Kc3?!", "R5xg3", "R1g7+", "Rcxb1", "Rhe2+", "Rab2+", "Ngxh3", "N1xf3", "N2e3+", "Rag3", "Ngxf1", "11.0]", "10.82]", "10.83]", "10.47]", "Rxe4?!", "Bxc4#", "10.67]", "10.61]", "10.45]", "10.23]", "10.16]", "Rhxe2", "N6h5+", "exf5?", "Qxf6??", "-7.07]", "-7.6]", "-5.67]", "Rbxa3", "N7xh5", "Ndc5+", "R2xa4", "R4xb5", "Nb8?", "Rexf7+", "-5.16]", "10.65]", "10.64]", "10.6]", "10.91]", "R2h3", "N2g4+", "N2xh3", "Bh4+?", "Bxg3+?", "Raxd1+", "Nde3+", "N5d4+", "R2xf5", "6.33]", "6.1]", "5.81]", "-6.61]", "-6.58]", "Rexa5", "R1c3+", "-5.2]", "Nc3#", "Ra4#", "Qhc1+", "Rcb1+", "R5xe6", "N8d7?!", "Rhc5", "N6xa5", "R3xb2", "Na4??", "Nbxa6", "N8b7", "Qf5?", "5.79]", "Qxb3?!", "Nc2?!", "N5a6", "Rcxf5+", "N5g3", "Nexg3+", "Nb1?!", "Ncxe2?!", "Rfxd7+", "Qd4#", "Qa4?", "Rdxe7+", "Rga7", "Nfxd4+", "N8xc6", "-3.85]", "R8a2", "4.44]", "exf4??", "4.1]", "R4b5+", "Kxd6+", "6.36]", "6.48]", "7.22]", "Rfb1+", "R6xf5", "Rfxc3", "Kd1?", "Qxf3+?!", "-6.62]", "R8xb5", "4.59]", "8.28]", "8.29]", "7.82]", "11.88]", "11.81]", "N3xb4", "R7xc3", "Nfe7+", "Ke1?!", "Rde3+", "Rhf3+", "Rexh2+", "Rcg3+", "e8=B", "Rbg3", "7.92]", "8.04]", "Rf1?", "Kd7?!", "Qa6#", "Ncxd3", "R4xc6", "Re2#", "N6xh7", "Nb1+", "Ng3??", "Ne2??", "Rfb2+", "Nde5+", "Nfxe2+", "Ke2?!", "Rhxd7", "Kh4+", "Nbd8", "Qf3+?!", "Rcg2#", "Ngxf6+", "Rgh7", "Rfxf8+", "Qdb6", "R3c4+", "Ndxc7", "Nd7??", "Qxb7#", "Nxb5?!", "Nfxd5+", "Kxf5+", "Nfd1", "Rexg2+", "Rcf7+", "R4xf2", "Ngxf7+", "Rhxb1", "R3g7", "5.76]", "R7a3", "Nxc3?", "Qh6?!", "Bxb1+", "R6g2", "N6xg4", "-5.7]", "Kxd4+", "R1b4", "Rgd2+", "R1g6+", "Rfxc7", "Rfc2+", "Raxd2", "R2a5", "Nxc5?!", 