{"vocab": ["<PAD>", "<UNK>", "{", "[%eval", "}", "O-O", "Nf3", "e4", "Nf6", "d4", "d5", "e5", "Nc3", "Nc6", "c5", "e6", "c4", "d6", "f4", "c6", "h3", "Be7", "c3", "g6", "a6", "h6", "b5", "Bd3", "f5", "b4", "exd5", "Be3", "a3", "d3", "e3", "Bg5", "Ne5", "Bc4", "Be2", "g3", "cxd4", "Ne4", "a4", "b6", "a5", "Bg7", "Bg4", "b3", "Nxe5", "Nxd4", "Nd5", "g4", "Re1", "Bd6", "h4", "dxe5", "h5", "f6", "1...", "2...", "3...", "4...", "5...", "g5", "Nd7", "cxd5", "Bd7", "O-O-O", "f3", "Bb7", "Nxe4", "Re8", "Be6", "Bf4", "Qe2", "Nd4", "Qc7", "Nd2", "Qd2", "Bd2", "Qe7", "Bxf6", "exd4", "Nxd5", "Bc5", "Bf5", "Bg2", "Ne7", "Bxf3", "dxe4", "Qd7", "Qc2", "Bb5", "Rc8", "Qf3", "Ne2", "Bb2", "Ng5", "Bb4", "Nbd7", "Rc1", "Nf5", "Qb6", "Nc5", "Rd8", "Qf6", "Bxe5", "Rd1", "Nc4", "Ng4", "Qd3", "Kh1", "Nbd2", "Rb8", "Nf4", "Bxe4", "Qxd5", "Kh8", "Qxd4", "Kg7", "fxe5", "Rb1", "Rad1", "Bb3", "Bxd5", "bxc3", "Qb3", "dxc4", "bxc6", "Bf6", "Bxc6", "Kg2", "Kf7", "Ke7", "Qd6", "Bxd4", "Ng3", "Ng6", "Nb6", "Rf8", "Bxc4", "Nb5", "dxc5", "Kf8", "Bxc3", "Rad8", "Qg4", "Kf2", "Nh5", "Rf1", "Bf3", "Qe3", "Nb4", "Bg3", "exf5", "Qxf3", "Qg3", "Kf1", "Qg5", "Nxc6", "fxe4", "Ke2", "Qh5", "Bh4", "Rfe1", "Kh2", "Bxc5", "axb5", "Bg6", "Nh4", "Qa5", "Kd7", "Qxf6", "Qd8", "Bc6", "Kh7", "Nb3", "Bd4", "Be4", "exf4", "Rg8", "Rd2", "Bh6", "axb4", "Bd5", "Rd7", "Bxf4", "Be5", "Qh4", "Ne3", "Ba6", "Na5", "Rac8", "Rac1", "Bxf5", "Rfe8", "Nxc3", "Qg6", "Re2", "Rg1", "Bh5", "Qxe5", "Bb6", "bxc4", "Nd6", "Qf4", "fxe6", "gxf6", "gxf3", "Ne6", "0.18]", "Qe6", "Qxd6", "Qxd3", "Kd2", "Rxd8", "Kg8", "Qxe4", "Na4", "Bc2", "Re7", "Bc3", "Rae1", "0.17]", "Nd3", "Qc6", "bxc5", "0.2]", "0.22]", "Rxd1", "hxg5", "Qd1", "0.25]", "Qd5", "Bxd6", "Qf5", "Bxe6", "Rfd1", "Kb1", "0.24]", "0.15]", "Rfd8", "Nxc4", "Qc3", "Rf7", "hxg6", "Bb5+", "Bxe7", "exf6", "Qd4", "Bxg5", "Kb8", "Rf2", "hxg4", "Qa4", "Kg1", "Rae8", "0.27]", "Qe4", "Nh6", "Rc7", "Bxd3", "Qf2", "0.29]", "Na6", "Nxf6", "0.13]", "Na3", "Ba3", "Qe5", "gxf5", "Nxc5", "Bh3", "Kc7", "Rxe5", "Rc2", "Qxe7", "Nxd7", "fxe3", "0.0]", "Bb4+", "Re3", "Ra8", "Rf3", "Nxe3", "Ba4", "Qf7", "Qc5", "cxb5", "Rxe4", "Bxg4", "fxg6", "Qxc4", "Nge7", "Bxe2", "Nxe6", "Qb4", "0.12]", "Qxc3", "0.31]", "Rd3", "Kd8", "Rxd5", "Nxf6+", "Rab1", "Rxd4", "exd6", "Qc4", "Ra1", "Qe1", "dxc6", "Nxf4", "Qe8", "Qxb2", "Bxe3", "Ke8", "Nh3", "Qb5", "Qxg5", "Nxf3+", "0.32]", "0.16]", "Nxf5", "Nge2", "Bf8", "Qxd7", "Bxg7", "0.21]", "Rxe8", "0.19]", "Qxc6", "Nc7", "Nxf3", "Rab8", "Re6", "hxg3", "Rd6", "axb3", "Qc8", "0.26]", "Bxh6", "Kc2", "0.23]", "Kf6", "Qh3", "Qxe2", "Nxg5", "cxb4", "Rxe1", "Qxc5", "Bc7", "Bc8", "Bxb5", "Qxb7", "Rf6", "Qxf4", "0.1]", "gxf4", "0.14]", "Kxg7", "Rxf6", "0.28]", "Rxd6", "Nxg4", "Qh6", "Rxf7", "Rxc1", "Qb7", "axb6", "Ke6", "cxd6", "Nc2", "Qxg4", "Nxd3", "Ke3", "Rxb2", "Nxd2", "Rxe6", "0.34]", "Qxf5", "Bxb4", "Rxf3", "dxc3", "Rxc8", "Bxc3+", "Kd1", "Kg6", "cxd3", "Rh8", "Rxb7", "Nh2", "Qc1", "Kxf7", "Qxd2", "0.3]", "Qxe3", "fxg3", "Bxb2", "Kg3", "Rxd3", "Ra7", "Nxd6", "Ba5", "Kf3", "Rxf5", "0.08]", "Rxf2", "Qxe6", "Bxc6+", "Re5", "Bf2", "Bc1", "Rxc3", "Rg3", "Rxd7", "0.36]", "fxg5", "dxe6", "Rd4", "Re4", "Rxe3", "Kd6", "Bxh3", "Rd5", "Rxf4", "Rxe7", "Nxb5", "Rh1", "Qb2", "Bf1", "Ngf6", "Rxd2", "Rfc8", "Bxg2", "Bxb7", "0.05]", "0.06]", "0.11]", "Nh7", "exf3", "Ra2", "Rxc6", "Ne8", "Qh5+", "Ke1", "Bxd7+", "Nxf7", "Rf4", "Rc6", "Nxg6", "Bxa6", "fxg4", "Rf5", "Bxg6", "0.37]", "Nf8", "Rb7", "Rc3", "Ba2", "Qg7", "Rg6", "Nf1", "Rxc2", "Bxd7", "Kd3", "Rxf8", "Rxa2", "Nf7", "Rxe2", "Rb2", "Qa5+", "Rfc1", "gxh6", "Rxe8+", "Bxf8", "Nxb4", "0.33]", "Rxc4", "Rxa7", "Rxd8+", "0.07]", "Kb7", "Rxd1+", "Rc4", "Rxa8", "0.03]", "Qa6", "Kxd8", "Rxf1", "Qg2", "Kxg2", "Nxe7", "0.39]", "Kc8", "Qxd8+", "Qxc2", "Rxc7", "Nxg3", "Qa3", "Rxe1+", "Qxb5", "Rxc5", "Qh4+", "Rxa1", "0.09]", "Rhe1", "Re1+", "0.01]", "Bxf7+", "Bf7", "Qxa2", "Rh3", "0.35]", "Rb6", "Rc5", "Bxf1", "Qa4+", "0.41]", "Kc6", "Qxc7", "Bxd2", "Qxd8", "Kb2", "Qxb4", "Nf2", "Bxg3", "Rb3", "Nxb3", "Qe6+", "Qb8", "Qxa7", "Ngf3", "Qxd1+", "Nb8", "-0.03]", "Nfd7", "gxh5", "Re8+", "cxb3", "Qxd1", "Nf6+", "Rxa6", "0.43]", "Qxb6", "Rhe8", "Kxf2", "Bxa3", "Ne1", "gxh3", "Kc1", "Rd1+", "Rxf1+", "Kxd1", "Rxf8+", "-0.01]", "Ra3", "Rg4", "Bxd2+", "Rg7", "Qxh4", "Qxb3", "0.44]", "-0.05]", "Bxd8", "Bxa8", "Qd4+", "Rg2", "0.46]", "cxb6", "Rh6", "Bb1", "bxa4", "Nxf2", "Nxe2", "Kxf8", "Qxh5", "Ra6", "0.48]", "Qe5+", "Qxh6", "0.53]", "Qxg6", "0.04]", "Qb1", "bxa5", "Raf8", "0.38]", "Bd8", "Raf1", "Rb4", "0.5]", "Kh6", "Qxe6+", "Kxf1", "Rh5", "Rg5", "Nd6+", "Be8", "Rh7", "0.51]", "-0.06]", "Kc3", "Bxa1", "Qg5+", "Rde1", "Qf8", "Nxb6", "Bxh4", "Nf3+", "Bxb6", "0.02]", "Ra5", "Qg4+", "Bc5+", "Rh4", "Qd5+", "Bxd1", "Rh2", "Qxg7", "Nxh4", "Nb1", "Rd8+", "Qxf7", "Qf1", "Bxb3", "Qe3+", "-0.08]", "Qxh3", "Qxe5+", "Ne2+", "Bxc7", "Ra4", "0.55]", "Bd1", "Qe4+", "Bxc2", "Kxd7", "Bh2", "Qc5+", "Kb6", "-0.1]", "bxa3", "Rxa4", "dxe3", "Rb5", "Kh3", "Rhg8", "Nxf8", "Qxg3", "gxh4", "Rde8", "bxa6", "Ne7+", "Rxb8", "Rxa5", "0.56]", "Nxe7+", "Ng8", "0.4]", "0.58]", "Nxb7", "Nxc2", "Rxa3", "Qxa4", "Qxa6", "Nxh5", "Bxf2+", "Nxd1", "Rxb1", "Qxf2", "Qb6+", "Nbc6", "Rhf8", "Bxa7", "Nd1", "Nxb2", "Qf4+", "Bxh5", "-0.13]", "Qxa8", "0.6]", "Qa7", "exd3", "Rhg1", "-0.12]", "-0.02]", "Rxg7", "Kxe7", "Qxg2", "Nxf1", "Qxa3", "Qxa5", "Qb5+", "Nxd8", "0.62]", "-0.15]", "0.42]", "Nxc7", "Rxb4", "Nxa8", "Red1", "Ba7", "-0.07]", "Qxe4+", "-0.04]", "Nd8", "Rhd8", "Qf5+", "Rxb5", "Be1", "Qxa1", "Rhf1", "Qxf7+", "Rhd1", "Rxh5", "Nc8", "0.45]", "-0.18]", "Nd3+", "Qc4+", "Nce2", "Bxf7", "Nce7", "Qxe3+", "Qe2+", "Nxd3+", "Bxa2", "0.49]", "Qb4+", "-0.17]", "Bxa4", "0.52]", "Kb3", "0.63]", "0.65]", "Rxg2", "Qxd4+", "Kf5", "Bxc1", "Ndf3", "0.47]", "Ne5+", "Bh7", "Qxf2+", "Nxe2+", "Rxh6", "Rxh8", "Rxh7", "Rfb8", "Qf3+", "Rfb1", "Qg6+", "Nfd2", "-0.22]", "Kg5", "Qxe8", "Rxh4", "Ng1", "Kf4", "0.54]", "Nxa1", "-0.2]", "Rxb6", "Nxd6+", "0.57]", "Kxd2", "Nxa4", "Qxe2+", "Ng7", "Qxe7+", "Kxe2", "Qa2", "Rxg5", "Nxc8", "Na7", "Bc4+", "Nbc3", "-0.09]", "Rxh3", "Qxf8", "0.68]", "Ndf6", "Rxb3", "Qg3+", "Bxc8", "Rxg4", "Bxf2", "-0.25]", "Rcd1", "Nb7", "Qe7+", "Rcd8", "-0.24]", "Nxa6", "Red8", "Bxa5", "Bg5+", "-0.27]", "Qf6+", "Bd4+", "Nc1", "Qxe1", "Qxd5+", "0.59]", "Bxh8", "0.67]", "Rxh2", "Rxh1", "Ne4+", "Rc1+", "Ke5", "Nxg7", "Kg4", "Qxc8", "Kxh7", "Ng5+", "Bxe6+", "Qb3+", "Qxd7+", "Qxh7", "Nb2", "Rxg6", "Qh2", "-0.11]", "Rdf1", "Qh7", "Nxe1", "Nxh8", "Nxa5", "Qxc1", "Qxf1", "0.61]", "Ke4", "Nf4+", "Nxc1", "Ka7", "Rxg3", "Qc6+", "Bxd4+", "Bb8", "-0.32]", "Rf1+", "Bxh7+", "Nd5+", "Qxh2", "-0.14]", "Rxg8", "Qxd2+", "Qh6+", "Nxa3", "Nxe8", "Nf5+", "Qxg6+", "Kc5", "-0.29]", "Ng2", "-0.16]", "Rxc1+", "e5?!", "Ka8", "Rdf8", "Kxf6", "Rd7+", "Bxe3+", "Nd4+", "Nxg2", "Rdg1", "Rf8+", "Kd5", "Nf2+", "Qxc6+", "Kd4", "Qc3+", "Qf7+", "Rc8+", "Rxc8+", "Bxh2+", "Qxc3+", "Rd2+", "Bd5+", "-0.19]", "0.7]", "Be3+", "f4?!", "Bg4+", "Nxa7", "-0.31]", "Qh3+", "Ng4+", "Bxe1", "Qxh8", "Ne6+", "Rdg8", "Rbc8", "0.72]", "Qd6+", "Na2", "Qe1+", "Nf7+", "Bxh1", "Ka1", "-0.21]", "Be6+", "Qd3+", "Rbd8", "0.64]", "Kc4", "Qa1+", "Kxh2", "Nc7+", "Kxf3", "Qa8", "-0.34]", "Qf2+", "Re7+", "Bf4+", "-0.23]", "Qa8+", "Qc1+", "Bxe8", "Rbd1", "Nxh7", "Rbc1", "Rg1+", "Qxg5+", "Nxa2", "Rxg1", "-0.28]", "Nxh6", "Rg8+", "-0.26]", "Bxb8", "-0.37]", "Ne3+", "Bh4+", "Nce5", "Bxd5+", "Qxg3+", "Qxg4+", "0.74]", "Bf5+", "Qe8+", "Qh1+", "Kxe8", "Qa1", "Rxf7+", "Bxb1", "Ka2", "0.66]", "-0.36]", "Qd1+", "Qh7+", "Rxg7+", "Nce4", "0.75]", "Qxg7+", "Qg8", "Kxe1", "Kh4", "-0.41]", "Ba8", "Nbd5", "Rxg2+", "Qh8+", "Bxf6+", "Qxf6+", "Qc7+", "Kxe6", "Kb5", "Nxc7+", "Rb1+", "Kh5", "Nxc2+", "0.69]", "0.77]", "Re2+", "-0.3]", "Ra1+", "d5?!", "-0.39]", "d7", "Nxh2", "Qxh1", "Qxf3+", "Nxh3", "Kxc7", "Rec1", "Qxf4+", "Qb1+", "Kb4", "Qd8+", "Bc4?!", "g6?!", "Rxe7+", "Bxf3+", "-0.44]", "-0.43]", "0.79]", "Nc2+", "Nxh1", "Kxd6", "Rc2+", "Nc5+", "Nh6+", "Ra8+", "Ka6", "Rce8", "Qxe1+", "Rce1", "Qc8+", "d2", "Qg1", "-0.33]", "Kxe3", "Rxf2+", "Bxh7", "Qc2+", "Nc3?!", "Rh1+", "0.71]", "Rc7+", "Rb8+", "Qb8+", "Be5+", "Nc4+", "Ng6+", "Qxg2+", "Rag8", "Nh3+", "Qxe8+", "Qxc5+", "Nxe5+", "Rbe1", "Bh5+", "Qxh7+", "Ng3+", "Rf7+", "Kxb7", "Qxb8", "Qh2+", "Bh6+", "-0.35]", "Raxd1", "-0.48]", "Raxd8", "Bxb5+", "O-O-O+", "Nfd5", "Bh8", "Rec8", "Rh8+", "-0.46]", "Qd7+", "Qxf8+", "Qd2+", "Nxh3+", "Qxh2+", "Nc6+", "Ncxe5", "Rag1", "0.73]", "Qb7+", "Rxe2+", "0.82]", "Nxe6+", "Bxh2", "Nge4", "Nxb8", "Ka3", "Nf6?!", "0.87]", "Nf3?!", "0.86]", "Qxb1", "Kxb2", "Rf2+", "e7", "Nge5", "Bxg8", "Kxd3", "d3?!", "Ba1", "0.81]", "Kxc2", "Qf3?!", "Rbe8", "Nbd4", "Kxg6", "Kxc6", "Nc6?!", "Qg7+", "Qxf1+", "-0.5]", "0.76]", "Qxc4+", "exf7+", "Rhc8", "Rdc8", "Qa6+", "-0.38]", "-0.51]", "Qxc2+", "Qxf5+", "Qb2+", "d6?!", "Nfd4", "0.84]", "Kxg3", "e2", "Be4+", "Nxf7+", "Qxa1+", "f3?!", "Qxb7+", "-0.53]", "Qxc1+", "-0.45]", "Nec6", "f6?!", "Bd6+", "Ngxe5", "-0.4]", "0.89]", "Bg1", "Nde5", "Ree1", "exf6+", "Qf1+", "Ba6+", "Nxb1", "Kxe5", "Qxc7+", "Nc3+", "Bh3+", "Ka5", "Nd7+", "Nxh6+", "Nxe3+", "Rxe5+", "Qxb5+", "Bxc5+", "Ncxe4", "Rdc1", "Qg2+", "Rxe6+", "Bh7+", "0.78]", "-0.55]", "d4?!", "Qxh3+", "Qxh6+", "Rfa8", "c5?!", "0.93]", "c2", "Qg8+", "Bg6+", "Qxb4+", "0.8]", "Neg5", "Rg2+", "Rhc1", "Rxd7+", "Nbxd2", "Bxe5+", "Qa3+", "Rxc7+", "Rdd1", "Rg3+", "Rg7+", "a7", "Nde4", "Rd6+", "Rh2+", "Nbxd7", "cxb2", "c7", "c3?!", "fxg7", "Qxa8+", "Rfa1", "Bxb4+", "0.83]", "Qg1+", "Rdd8", "Rxc2+", "Qxd6+", "Bxg6+", "-0.47]", "Nxf2+", "g3?!", "0.91]", "-0.42]", "Qxh5+", "-0.58]", "Bg8", "Qxb2+", "-0.56]", "0.94]", "Rdd7", "Nfxd4", "Qf8+", "Rxd2+", "Qh8", "Bxg7+", "Kxg8", "Nhf6", "0.96]", "Ba3+", "Ba4+", "-0.49]", "Bc6+", "Nxg8", "Ndb5", "Nb6+", "Nxe4+", "Bc5?!", "Bd3+", "Rdh1", "Rxb1+", "Re3+", "Bc3+", "e4?!", "Nb5+", "Rxg3+", "f5?!", "Rh7+", "0.98]", "Nh4+", "Kxh6", "Nd2+", "Bxg2+", "Bxf4+", "exf2+", "Bxg3+", "Nxg6+", "-0.6]", "Rxe4+", "Rb7+", "e6?!", "Bh1", "Raxc8", "-0.62]", "c4+", "f5+", "Bxg1", "Rxg1+", "Ref1", "Rdh8", "Rxg6+", "Ndxe5", "-0.52]", "Rb2+", "Ref8", "N7f6", "a2", "Rxg8+", "b4?!", "1.0]", "Bf6+", "Ree7", "Qxc8+", "-0.54]", "Bh2+", "Raxc1", "Rf3+", "Nh5+", "fxg2", "Rxb8+", "Rxe3+", "Qxh4+", "Ree2", "Nxg3+", "Re6+", "-0.63]", "Kxc3", "Nxf5+", "Ned4", "Nxg7+", "Qxg8", "Ned5", "Nxc3+", "e6+", "Kxg4", "Ngxe4", "Bg3+", "Rg4+", "Nxc6+", "Rdd2", "Ka4", "Nfe4", "Nb3+", "Bxe7+", "Qf6?!", "Nfe5", "Nec3", "Neg4", "c6?!", "Nxd5+", "N2f3", "N8d7", "Reb1", "0.85]", "Bb6+", "Bxf5+", "0.88]", "Qxd3+", "-0.67]", "Kxe4", "Bxb7+", "Rg6+", "Rd3+", "Qh1", "Ncd7", "Kxh3", "dxe7", "0.92]", "c4?!", "Bxd6+", "c5+", "1.01]", "d6+", "Qxh8+", "Rfxd8", "Nxg1", "-0.74]", "-0.72]", "g5+", "Bxg5+", "dxc7", "Rxb7+", "1.03]", "Ned7", "1.06]", "-0.65]", "Kxf4", "Nef6", "Kxg5", "g4+", "Rff1", "Kxh8", "Kxd5", "Rg5+", "Kxg1", "Bxe4+", "Bxc4+", "Nxa7+", "b2", "1.05]", "-0.68]", "Nxf4+", "Kxc8", "O-O?!", "Ree8", "0.9]", "Reb8", "b7", "f4+", "Rxg4+", "Rxh7+", "Nef3", "-0.57]", "Qa2+", "cxb7", "e5+", "Qxg8+", "Kxc5", "d4+", "b6?!", "Rxf6+", "Nbxd5", "Nf3?", "Bf3+", "Kxf5", "Rcc7", "Nfg5", "Rfxd1", "Rxb2+", "Nhf3", "Ra7+", "1.13]", "Bb3+", "Rxh2+", "Ra2+", "Re4+", "Nde2", "Kxc1", "Ncd5", "Qxb1+", "e5?", "Kxd4", "Nexd4", "1.08]", "Nxd4+", "f6+", "Qxg1+", "Nb4+", "Rf6+", "-0.81]", "Qa7+", "Ncd2", "1.17]", "Rhb8", "Bg5?!", "Nxb6+", "Rff8", "hxg7", "Nfxd5", "Nxa2+", "Bf7+", "Raa8", "e3?!", "1.12]", "1.15]", "Ba5+", "b3?!", "-0.84]", "Rxh3+", "Rxf3+", "Ndxe4", "Rxg5+", "Rh3+", "Nh8", "Rcc2", "h6?!", "Bxg4+", "-0.7]", "Qxg1", "-0.87]", "gxf7+", "Rad1+", "1.1]", "N6d7", "Bxb2+", "Rxd4+", "Rf4+", "Bxd3+", "Qxa2+", "Bg4?!", "Rc3+", "Rcc1", "-0.75]", "Nxb3+", "a6?!", "Kxh1", "d3+", "exf3+", "Rah8", "Rfe1+", "Rxd3+", "Rxd5+", "Nxg2+", "Qxh1+", "h3?!", "f3+", "Nxg5+", "Ned2", "e4+", "0.95]", "0.97]", "Rxd6+", "Rcc8", "0.99]", "-0.77]", "Raa1", "hxg2", "hxg6+", "Be3?!", "Kxc4", "Rcf8", "-0.64]", "Rge1", "Bd3?!", "N1d2", "Rah1", "Rbb8", "Rxc3+", "Bf2+", "Nbxd4", "Rgf8", "Rhb1", "Qxa7+", "Ncd4", "Rge8", "Nh1", "Nxg4+", "b5?!", "Rc6+", "Rcf1", "Bxe2+", "-0.66]", "-0.86]", "Re5+", "1.24]", "Ncxd4", "Nexd5", "1.18]", "Na8", "Nfg4", "Rxf4+", "Rxc6+", "Kxb6", "Rxa8+", "-0.61]", "Kxa7", "Qe2?!", "d4?", "1.04]", "R1d2", "-0.71]", "1.02]", "Rd5+", "h6+", "1.16]", "-0.59]", "-0.91]", "Rh6+", "g4?!", "b4+", "Rf5+", "Rbf8", "h4+", "Rh5+", "f6?", "h5+", "-0.82]", "Nxd7+", "Qxb6+", "Qe7?!", "Nhf4", "Rbb1", "-0.78]", "h7", "Qxb8+", "-0.69]", "Rd4+", "Qxa6+", "Red2", "d5+", "1.2]", "-0.79]", "e3+", "b5+", "1.07]", "Nc3?", "exd5+", "d5?", "1.22]", "Ng5?!", "Rxh8+", "dxe2", "Rbf1", "Nf6?", "Rff2", "dxc2", "Kxb3", "Rfe8+", "-0.73]", "Ng7+", "Rdb8", "1.34]", "-0.89]", "Nc6?", "1.32]", "gxh7+", "Rb6+", "Nxf1+", "Rxa2+", "-0.94]", "h3+", "Rgf1", "Nef5", "1.27]", "R1e2", "Rdb1", "1.19]", "-0.93]", "hxg3+", "Ngxe2", "exd6+", "Bf4?!", "d3?", "Qh5?!", "1.14]", "Ng2+", "Ndb4", "Be7?!", "fxg6+", "Rde2", "Kxh4", "f5?", "Ncb4", "a3?!", "N7b6", "Qf3?", "R8e7", "exd7", "Kxb4", "Rxh6+", "Rc4+", "1.21]", "Nxf8+", "Nhf5", "dxc3+", "fxg3+", "Nxe1+", "1.25]", "f7", "-0.85]", "Red7", "Rgd1", "Rcb8", "Kxa2", "Nxd2+", "gxh2+", "Ngxe7", "R8d7", "R8f7", "Ne8+", "Rff7", "Rad8+", "Nxh7+", "Rxh1+", "1.37]", "Rxa1+", "Bxf7+?", "c4?", "Ndc4", "Be2?!", "R1f2", "Rc5+", "Bb7+", "-1.0]", "Rxf5+", "g3+", "h2", "gxf2+", "Nxd8+", "1.09]", "Rxa7+", "Kxb5", "Nfxe4", "-1.03]", "Be7+", "-0.92]", "g6+", "gxf6+", "Rgd8", "Rfe7", "Nd4?!", "Qxb3+", "1.11]", "Nfxe5", "Ne1+", "fxe7", "Nfe7", "-0.96]", "1.36]", "Qxa3+", "1.23]", "dxc6+", "exd4+", "Ra6+", "-1.08]", "-0.8]", "a4+", "1.31]", "-1.05]", "Bf5?!", "Nef4", "fxe6+", "Rae1+", "1.29]", "Nxc4+", "Nac3", "Nde7", "exf7", "f3?", "Bxh6+", "Kxh5", "hxg5+", "Bd2?!", "-0.83]", "Nac5", "g7", "Bxh4+", "N5f6", "c3?", "Rde7", "Nxe8+", "N4f3", "Nxc8+", "Nxh5+", "-1.1]", "-0.9]", "exf4+", "Bg7+", "Ncb5", "Bd6?!", "Nxc5+", "Rb3+", "Nxd4?!", "Bb5?!", "N1e2", "1.39]", "Rac1+", "Ne5?!", "1.26]", "f2", "Bc7+", "Qxa4+", "Bc4?", "Ncxd5", "-1.01]", "h2+", "Na1", "-1.06]", "Rfg8", "Rxb6+", "h7+", "Rxh4+", "a5+", "f4?", "Rxc4+", "Rcb1", "Rbb7", "axb2", "1.48]", "Bxc7+", "Nfe2", "Nxh2+", "N1c3", "O-O?", "dxe6+", "d6?", "h5?!", "f7+", "Nec4", "Nxh8+", "d7+", "bxc2", "Rea1", "N1h2", "Rfd1+", "-1.07]", "e4?", "Rhe1+", "Reg1", "Bxh3+", "N3d2", "Bc5?", "N2b3", "fxe5+", "Rfg1", "Na7+", "Nac4", "Rbb2", "Bg4?", "g5?!", "dxe5?!", "Rh4+", "dxe5+", "-1.15]", "Rxh5+", "Nxb7+", "Rac8+", "fxe4+", "-1.17]", "-0.97]", "Rb4+", "-0.76]", "Rfe2", "Bb2+", "Nh2+", "Ndc5", "Rae8+", "-1.18]", "-0.98]", "Na4+", "1.28]", "Rhe8+", "Rfd2", "gxf3+", "-0.88]", "Bd7+", "Nxd1+", "Nac6", "Nxc1+", "g6?", "Be6?!", "Rxb3+", "Ne7?!", "Bxh5+", "Rcd2", "Be2+", "Ne2?!", "Rxc5+", "-1.12]", "Na5+", "Bg5?", "Ra3+", "g4?", "Rb5+", "Nec5", "1.3]", "Rhh1", "exf5+", "-1.2]", "bxa2", "Ndc3", "Raa7", "Nce3", "Na3+", "Nh7+", "fxe2", "Reg8", "-0.99]", "Ndf4", "Bc2+", "R1c2", "Rdc2", "e7+", "exd7+", "-1.02]", "Nxh4+", "Nh3?!", "N4c6", "Bxc2+", "1.41]", "N7c6", "Bxa3+", "c6+", "b3+", "Bg2+", "Rcg1", "Ree3", "Kxb8", "Kxa8", "R3e2", "-1.04]", "Raa2", "dxe4+", "g2", "Ndc6", "Kxb1", "Ndf5", "Ndf8", "a4?!", "Qxa5+", "gxf5+", "Ref2", "Qxg2#", "N5c3", "Na2+", "dxe3+", "1.5]", "Nxd5?!", "N8e7", "Kxa1", "1.56]", "cxd7+", "Nh6?!", "Rea8", "Bd7?!", "h4?!", "Ndf1", "fxg7+", "Bd2+", "bxa7", "dxc5+", "c3+", "Ncxe7", "c5?", "1.33]", "-1.13]", "Ngf5", "Rdd3", "gxf4+", "Rfd7", "bxc6+", "N2c3", "-1.25]", "g5?", "1.35]", "R3d2", "cxd4+", "axb7", "Rde3", "-1.22]", "e3?", "bxc7", "R8c7", "Ngxf6", "cxb2+", "Kxa6", "Bxb6+", "Rce2", "a3+", "-1.14]", "exd2", "-1.11]", "Rbxc8", "Ne4?!", "fxg4+", "fxg5+", "e2+", "Bd3?", "Kxa4", "-1.24]", "Ndb6", "dxc5?!", "Ndxc4", "cxb7+", "Bxa6+", "c6?", "f2+", "Rhg1+", "Bb4?!", "Rff3", "Neg6", "1.65]", "1.53]", "Rbc7", "1.43]", "Nd1+", "cxd6+", "exd5?!", "b6+", "Kxa3", "1.52]", "Rfe3", "1.4]", "exd3+", "hxg4+", "Ned3", "-1.09]", "R1e3", "bxc3+", "-1.21]", "Ndxf6", "-0.95]", "-1.31]", "cxd5+", "gxh7", "Rcg8", "-1.27]", "d1=Q", "1.51]", "Rec2", "Rec7", "Be2?", "Red3", "N2g3", "Nxb2+", "1.46]", "Rhh8", "Ref7", "Rfd8+", "Rdf7", "Rhg8+", "Qb6?!", "hxg7+", "Nxe5?!", "Nd8+", "gxh6+", "Rcxd1", "Rce7", "e6?", "a3?", "Nce6", "b3?", "Rexd1", "h6?", "Ncxe2", "Rbg8", "1.42]", "Rdc7", "Na6+", "Rcd7", "R3f2", "Nd5?!", "Nb7+", "Nbc4", "gxf7", "Bxf2+?", "Be3?", "1.67]", "Bxf3?!", "N7g6", "Nf1+", "1.68]", "1.55]", "Nxe4?", "Nbc5", "Rgg1", "Nxe5?", "Raxb8", "Ncd3", "h3?", "Ndb8", "Nfd3", "Rgg8", "Bf5?", "Bb5?", "Ree6", "N5c6", "hxg2+", "Nhg5", "Qd2?!", "dxc4+", "gxh4+", "Rgg2", "Rcxd8", "1.44]", "Nab5", "R6d7", "Bg4??", "Rgh8", "Ra4+", "Ndxe7", "Rha1", "d2+", "Rcd3", "b6?", "Kxa5", "gxh2", "Nxd5?", "Qb3?!", "Rde8+", "Ned6", "cxd3+", "Nde3", "Rfxc8", "cxd7", "Raxb1", "Nf8+", "Qd3?!", "Ng4?!", "R8f6", "Be6?", "cxb3+", "1.45]", "Rbg1", "dxe4?!", "Qg2#", "g3?", "c1=Q", "-1.37]", "Nge6", "bxc5+", "R8d6", "-1.34]", "R6f7", "Rfxc1", "-1.16]", "exf2", "1.38]", "-1.29]", "Nxe4?!", "-1.43]", "Rgh1", "Rgc8", "e8=Q+", "N6h5", "Rdf2", "-1.28]", "fxg2+", "Bxa7+", "-1.84]", "Rca1", "R1b2", "1.47]", "fxe3+", "Rad7", "a5?!", "Qc7?!", "Qh5?", "Bb5+?!", "Bxf8+", "Ne5?", "exf8=Q+", "1.6]", "1.81]", "Nxf7?", "Ndxb5", "1.49]", "Rhxf1", "exd2+", "Ba4?!", "Rfxe8", "N4b3", "Nac2", "Rexd8", "Rdd6", "Nd4?", "Rxb4+", "Nb5?!", "Bxb3+", "-1.23]", "-1.36]", "Rgc1", "1.72]", "Qe2?", "Nxb4+", "Rhf1+", "Nxb5+", "Ngxf7", "Rba8", "Neg1", "Rfxf2", "Nac7", "Nge7?!", "Qf6?", "Nexg4", "Rfc2", "R8g7", "Nfxd7", "Rxb5+", "1.7]", "Bg7?!", "a8=Q", "R6c7", "Bxc6?!", "Qd6?!", "Ndxc5", "Rde6", "R8d3", "a6+", "Ncd6", "Rde4", "Qxd4?!", "Be7?", "Rab7", "Neg3", "Ref6", "Nfxd2", "-1.56]", "N3h2", "-1.32]", "Rha8", "Raxe8", "Ng5?", "Nce8", "Qa5+?!", "Nb2+", "Rae2", "N3h4", "-2.1]", "-1.4]", "axb3+", "axb6+", "N5b6", "Bxf1+", "Rhg7", "1.66]", "R4e2", "cxd2", "Rcd6", "Nd2?!", "Rhg2", "Bxa2+", "bxc4+", "Rab8+", "R1g2", "Nbd3", "Rfg3", "Nexd7", "R5e2", "Rbc2", "Bc8+", "Rbxd1", "-1.39]", "Nb4?", "R5e3", "Qxd5?!", "N6d5", "axb5+", "Ngxf3", "Ncxb5", "exd4?!", "Rfd3", "Ndxf3", "Na3?!", "Ncb8", "Rcf7", "R6e7", "Rdg1+", "Rca8", "R6d2", "exf1=Q+", "Raf2", "R1e6", "-2.44]", "Rac7", "O-O+", "Nxh1+", "R1f3", "Rac2", "Rcb7", "Rcc3", "Nfe6", "Rff6", "-1.41]", "fxe4?!", "Rhxf8", "Ra5+", "R5f7", "cxb5+", "Nfg3", "-2.15]", "axb2+", "Rda8", "Rbd7", "Rbxc1", "Qe7?", "gxh3+", "Nde6", "1.84]", "Rda1", "Bg5??", "Ndxe2", "Rgf6", "Rad2", "Rhh7", "Rfxf7", "Rde1+", "Bb4+?!", "Nf6??", "Nf3??", "Rec3", "R8c6", "-2.05]", "-1.26]", "b5?", "1.64]", "-2.25]", "Nhg4", "bxc2+", "Bb3?!", "R4f2", "Nexf4", "1.82]", "Rae7", "R8b7", "b8=Q", "Nge3", "Nexd2", "Ngf8", "Rab2", "-1.47]", "Red6", "N4d5", "Rdg8+", "-2.0]", "Bg1+", "cxb6+", "Rfd6", "N5f3", "fxe5?!", "Qd5?!", "Ng1?!", "1.69]", "Rdc3", "Qh4+?!", "Rba1", "e1=Q+", "Ngh3", "g6??", "dxc4?!", "R7e6", "Bc4??", "g7+", "axb4+", "Reg3", "-1.55]", "a6?", "Red5", "R8e6", "2.2]", "Nxc6?!", "cxd2+", "1.59]", "Rbe2", "Qc2?!", "Rcd5", "1.93]", "Ba6?!", "Red4", "R1d3", "Rab1+", "1.63]", "Rdf3", "-1.63]", "Nh3?", "-1.44]", "Rbd2", "-1.72]", "-1.51]", "2.17]", "-1.48]", "Naxc4", "-1.53]", "Nc8+", "cxd4?!", "Nb4?!", "dxe8=Q+", "bxc7+", "1.73]", "Qh4?!", "Nbd2?!", "-1.65]", "Ree4", "fxe5?", "Ncb3", "Rdxd7", "Bb7?!", "Nab4", "Neg4+", "Nfg8", "Bf1+", "Ng3?!", "Ng5??", "Bxf6?!", "Qf2#", "Ne4?", "N4c3", "a7+", "Bb2?!", "e8=Q", "Ngf4", "1.71]", "N8h7", "b1=Q", "-1.6]", "1.75]", "b4?", "-1.33]", "Nbd7?!", "-1.38]", "Bb5+?", "-1.67]", "Rfxe1", "Ngxe6", "Rhxg8", "-2.22]", "-1.89]", "Rxa6+", "Rgf3", "Rhg3", "Bd8+", "-1.82]", "Bxa4+", "Reh8", "Rexe7", "Rab3", "Reh1", "R1e4", "Nfe8", "Nxg1+", "Nhxf5", "R1d6", "Rec6", "Nhf7", "-1.5]", "Qf3??", "Rfd5", "Rgf2", "Qd7?!", "R5d7", "d1=Q+", "gxf2", "Rcc4", "O-O??", "Qe2+?!", "1.58]", "1.57]", "Qh1#", "Rfe6", "h8=Q", "-1.62]", "Qa4?!", "Rgg7", "Nd7?!", "Rfe5", "-2.04]", "Bc1+", "Ncb6", "Nexc4", "Nbd6", "N4a6", "Bd2?", "Rce6", "-1.77]", "Raf7", "gxf8=Q+", "2.12]", "Rde5", "-3.15]", "1.74]", "-1.75]", "Qa4+?!", "c2+", "Raxe1", "Rhh2", "2.32]", "R4f7", "a1=Q", "1.61]", "R5d2", "-3.12]", "Bd3??", "-1.46]", "1.62]", "Rfc7", "Nbxc6", "exf5?!", "Ng8?!", "Nxb8+", "Nba6", "N3d4", "Bh4?!", "R5e7", "Nfh5", "Rdf6", "Rbc6", "1.8]", "1.86]", "Nxf2?", "Rhf3", "-1.45]", "Nfxg4", "Bxc3+?!", "Rfg7", "1.97]", "Ref3", "N5g6", "cxb4+", "2.31]", "h4?", "dxe5?", "Nxa1+", "Nfe3", "Rch1", "-1.98]", "dxe7+", "1.54]", "Neg5+", "2.06]", "Rcb2", "Nec8", "Rgh6", "2.03]", "R6d3", "dxc2+", "-1.76]", "R8c4", "Rbxd8", "Nxd4?", "Rge3", "Rff4", "R4e3", "-1.95]", "Rfg6", "1.94]", "N6e7", "Nfxg5", "R5f6", "Ndxb4", "N4g3", "1.76]", "-1.3]", "Rge6", "Rxa3+", "Rcc6", "Nge2?!", "-2.23]", "Rh1#", "Rhf6", "Ncxe6", "-1.9]", "N8c6", "Nc3??", "Qxf3?!", "Rhg6", "Re1#", "Nhg6", "-1.42]", "e6??", "Ng1+", "Rdd5", "Nbxc3", "-1.87]", "d6??", "Nh6?", "dxe4?", "Bxc6+?!", "Rfc8+", "N7xf6", "Qd1?!", "d4??", "R1e5", "R1d7+", "Nexf6", "Rbe7", "R3f4", "dxc7+", "Nexc3", "2.65]", "Rcxd4", "R3c2", "-2.08]", "R7c6", "1.98]", "2.15]", "2.25]", "-1.99]", "d8=Q", "c7+", "Rfh8", "Ngh4", "Nd5?", "Nxa3+", "Nexg5", "R6d4", "Qg4?!", "2.43]", "2.37]", "1.87]", "Bxd8+", "-2.03]", "Qb3?", "Rcf2", "Ngh6", "R1c3", "Rcxc2", "R4d2", "-1.35]", "R1c5", "-1.49]", "Rfe4", "Rdd4", "3.48]", "-3.01]", "Rhe3", "Nc1+", "Nxa5+", "Rch8", "Nfe1", "1.85]", "Rfb7", "Be8+", "R7e5", "R5e6", "3.24]", "N2e4", "Ne2?", "Nfh4", "Bg2?!", "1.77]", "Nbxd6", "Neg8", "N8f6", "Nexf5", "N5a3", "Qh5+?!", "Nxa8+", "Ref5", "c1=Q+", "Nxa6+", "Nfe5+", "Rcxc3", "-1.58]", "-2.01]", "e5??", "Be1+", "c8=Q", "gxf1=Q+", "1.91]", "Nfd6", "Ba4?", "R4f6", "d8=Q+", "Bd6?", "exf3?!", "d5??", "Bb6?!", "-1.74]", "R8d5", "Na5?!", "Rcxc7", "dxc4?", "-1.88]", "-3.13]", "2.63]", "Rfc1+", "Ke2?", "-1.54]", "Nc6??", "Ng4?", "Reg4", "Nce1", "N6a5", "Bb3?", "Nhxg5", "Rgb1", "Rcc5", "Rdf4", "Na6?!", "Bxd1+", "-1.73]", "-2.18]", "exd1=Q", "R4d5", "R4f3", "R5d3", "Rhf8+", "Nfg6", "Ncxe3", "Bxe5?", "Rgf7", "-2.12]", "Qg1#", "R2d3", "N5d4", "Red1+", "2.27]", "-1.19]", "Rfh1", "Qa5?!", "Rdf8+", "Bd2??", "f3??", "-2.14]", "Rab6", "-1.85]", "exd8=Q", "R1d4", "-1.7]", "Rbc3", "Rfg2", "-3.22]", "Rge5", "1.78]", "Ref4", "Bb4?", "Nhxf6", "h1=Q", "Rdc6", "1.96]", "bxa7+", "-2.68]", "b6??", "Bb4+?", "Bh3??", "Rhd2", "-3.16]", "Rf1#", "Ngh7", "R5f3", "3.15]", "3.1]", "-1.81]", "Bf4?", "exd8=Q+", "R8d2+", "-3.2]", "a8=Q+", "Bg7?", "-1.96]", "cxd1=Q+", "h1=Q+", "-1.86]", "N5e4", "Bd1+", "Rbd3", "Nhf8", "R8d2", "Rexd4", "R8e3", "R7d6", "exd6?!", "b3??", "Ngxf2", "Rdxd3", "-2.41]", "Rdxd6", "bxa8=Q", "R7d5", "Ngf1", "Nxg8+", "2.61]", "2.1]", "g2+", "Ngh2", "Bf8+", "Bxc4?!", "R5f4", "Rce3", "2.71]", "-3.55]", "Nfd2?!", "Qh2#", "3.37]", "R8a7", "2.24]", "N6e5", "Rbxb6", "2.02]", "R5e4", "Rff5", "Rdh3", "2.53]", "R4d3", "2.34]", "R2f3", "1.83]", "Ngf3+", "N3e4", "3.84]", "R8d4", "2.16]", "Rgf4", "-2.48]", "R1e7", "N4f6", "-2.31]", "d3??", "#1]", "Rbh8", "R6f3", "Rba4", "cxd5?!", "b1=Q+", "Rfh3", "Nd2?", "Be7??", "Nhxg4", "Ba5?!", "g3??", "R1c4", "-1.59]", "Raa3", "R5c7", "2.0]", "Ng8+", "Ba7+", "Rbxb7", "Nexc6", "Bc5??", "R2e4", "2.6]", "-2.53]", "Rgd6", "R4c7", "Nxd4??", "dxc3?!", "R2c3", "Rfh4", "R1h2", "Nhf2", "2.09]", "2.21]", "R8xd7", "exf6?!", "Qg5?!", "f8=Q", "-2.86]", "Rdxe6", "Rac6", "Ncxb4", "Qxf1#", "Ngxe3", "-1.64]", "2.59]", "-2.3]", "Re1?!", "Nh4?", "Rhg5", "Rgh2", "f1=Q+", "Rdxe5", "Bxa5+", "Rhxd1", "Rhd1+", "Bxe1+", "-2.81]", "-2.46]", "-4.31]", "Ndf2", "cxd8=Q+", "2.93]", "Ngxf4", "Be2??", "Nca6", "Rbc5", "-3.48]", "hxg8=Q+", "Qb6?", "Ng6?!", "Rbd6", "c3??", "R8e5", "2.5]", "-2.2]", "Rbb6", "Na5?", "R3f5", "Ndxc6", "-2.93]", "dxe6?!", "Qd4?!", "Nd5??", "Ngf7", "Ne7?", "1.79]", "2.36]", "gxh8=Q", "Rbh1", "R4d7", "Ba2+", "axb7+", "e1=Q", "R1c6", "Rdg2", "Nhxf4", "Rbf7", "-2.5]", "-3.31]", "Nce4+", "Raa6", "3.39]", "2.41]", "Rexd5", "R2d4", "R1b3", "R8c5", "Bxb7??", "-3.79]", "Qe5?!", "Reg6", "Nab3", "a4?", "R6e4", "R1d5", "R8c3", "Nfxe6", "2.13]", "Rdh2", "Nbd2?", "Be4?!", "bxa6+", "Rac4", "bxa2+", "N5f4", "-1.52]", "Nd7?", "Rd1#", "-1.79]", "Ndc7", "1.89]", "N4e5", "R3g2", "Rhg4", "N3e5", "Nbxc5", "R7e3", "2.46]", "Rgd7", "Nbxc4", "-3.18]", "a2+", "2.11]", "Raxa7", "Nca4", "Qe1#", "R5c2", "Ree5", "-1.94]", "-3.34]", "-2.67]", "N2xf3", "-3.14]", "R1e6+", "Rac3", "-1.66]", "-3.5]", "Rgh3", "c6??", "R3b2", "Rdxc8", "1.88]", "Rec5", "Rexe2", "Rhxh7", "3.22]", "a1=Q+", "2.81]", "-2.58]", "-1.78]", "-2.72]", "Rfc3", "Nfd2?", "Nab8", "Rdxc3", "Rcd4", "Qe4+?!", "h8=Q+", "R1g3", "Rdxd4", "Nb5?", "Rfh6", "Rfxe7", "Bb8+", "2.79]", "fxe7+", "7.6]", "Rbf2", "Ndxf5", "Rxf1#", "Qxb2#", "-2.7]", "Nb6?!", "-3.0]", "Nfh3", "Bxe8+", "Rcf3", "2.08]", "Rag1+", "2.45]", "2.54]", "Bh5?", "c4??", "Qxf2#", "Rexc1", "-3.46]", "exf6?", "Nbc8", "h5?", "2.68]", "3.2]", "-3.49]", "-3.25]", "dxe2+", "R1b5", "Bd6??", "-2.96]", "-2.83]", "Rge8+", "2.3]", "bxc8=Q+", "R6f5", "-2.33]", "-2.56]", "N1f3", "Nfg1", "Rfg5", "R4c3", "R4d6", "Nexf7", "Bb1+", "-2.84]", "Nfd7?!", "Rdc5", "2.48]", "Raxa6", "R8f5", "Rhe2", "2.52]", "-2.19]", "Rexe5", "e4??", "N2f4", "4.05]", "-3.91]", "Qxh3#", "Ndf3+", "-1.57]", "R3d6", "R1f7+", "-3.17]", "N5h4", "2.51]", "2.39]", "Qe2??", "dxe1=Q+", "fxe5??", "Ndb1", "Rdh6", "Nhf1", "-3.39]", "Bh6??", "Qh5+?", "Rfxf5", "-1.69]", "Qh4?", "2.28]", "3.94]", "1.9]", "Nge4+", "3.72]", "R1d6+", "bxa5+", "f8=Q+", "Qd6?", "Rba7", "N4f5", "2.05]", "fxe1=Q+", "Bd7?", "-3.19]", "Raxa2", "Raxd7", "R4e7", "Rdg3", "-2.74]", "Rhf4", "R8d3+", "R1d2+", "Qe3?!", "Rdxd2", "2.69]", "Rdxe1", "dxc5?", "Bxc3?!", "Rdxa6", "3.03]", "Rcb3", "-3.41]", "Rbg2+", "Rbxc7", "R8b6", "Rdh4", "3.65]", "R1f4", "R6f4", "-2.36]", "Rexd2", "Ne5??", "-4.29]", "Rhh6", "-2.24]", "-2.71]", "fxe8=Q+", "Bd5?!", "Rdxe7", "Rhf2", "Kf1+", "R1h3", "4.22]", "2.58]", "Bxh6?!", "f5??", "Qe6+?!", "Nca3", "Nab6", "R4e6", "Rgb8", "Ndxf7", "2.91]", "-2.75]", "-2.37]", "Raxa3", "R5f2", "Rexf6", "Ncxd7", "Rdb2", "Rdxe4", "-3.11]", "-1.68]", "R1xd5", "Raxb7", "Ngf2", "Bxd5?!", "Bh3?!", "R7e4", "Nfxd3", "f1=Q", "-3.24]", "Ngh5", "3.27]", "Rexd3", "Ncb1", "2.04]", "R1h7+", "Ba3?!", "2.73]", "Na8+", "R5d4", "-1.61]", "1.95]", "Rdg6", "-2.95]", "2.76]", "Bb4??", "Rexe4", "-2.06]", "Qa4+?", "Qc2#", "3.67]", "Be3??", "7.52]", "-2.87]", "Reg5", "R1xd4", "-2.89]", "dxe4??", "Nhf3+", "R7f2", "Nhg8", "Rexd6", "Rbe8+", "Qf1#", "bxc1=Q", "Nh4?!", "-3.21]", "Reb3", "Rxe1#", "Rfxf4", "R8e7+", "3.02]", "4.53]", "Rbxb2", "Rca7", "Rb1?!", "-2.97]", "exf4?!", "Nef3+", "Rfa2", "Raxc3", "2.26]", "2.29]", "3.21]", "N3e2", "Bxf2+??", "Raxf8", "Naxc5", "2.64]", "Rag8+", "2.77]", "2.87]", "Na3?", "3.86]", "Qc6?!", "Rfb2", "3.06]", "-3.77]", "Nexf6+", "Bg2?", "Rgxg7+", "-2.45]", "Rbd5", "Bb5??", "-2.88]", "Nexf2", "Rgf5", "Ne4??", "b8=Q+", "-3.76]", "-2.16]", "-2.77]", "2.22]", "Bxd5?", "Kf1?!", "Rfh5", "Bb6?", "3.36]", "Rexf1", "Qc3?!", "Ke7?!", "Rbxb5", "R7c5", "Ndxe3", "-3.62]", "-2.91]", "Rdxe2", "N4h5", "Qg5?", "Naxb4", "Rhd8+", "Rxh3#", "cxd4?", "3.87]", "Rbd4", "-3.6]", "Reb7", "-3.71]", "-3.08]", "-2.02]", "Qe2#", "2.18]", "R5d6", "-2.21]", "2.01]", "3.13]", "R8e4", "Rbb5", "R7g2", "R4g7", "Rbe4", "N2xg3", "Rdg4", "Bxf7+?!", "Rfh2", "Rhh3", "Ndf7", "Rea2", "R3d4", "Rexf8", "-3.23]", "-2.85]", "Bf5??", "Reg2", "dxc8=Q+", "Nb8+", "Rdxf2", "R1e2+", "Rhxh2", "b7+", "3.5]", "R8xc6", "N6xe5", "R6e3", "Nde2+", "Bxb1?!", "Nexg6", "3.57]", "3.75]", "-1.83]", "Nh5??", "R7f6", "Nhxf3", "Rbd1+", "gxh5+", "exd1=Q+", "Bg3?!", "R8f4", "3.56]", "Bxf3?", "R7d2", "gxh1=Q", "-2.11]", "-1.97]", "fxg8=Q", "Ba6?", "3.17]", "3.29]", "R8e3+", "R8h2+", "-3.66]", "-2.29]", "Nhf6+", "dxc1=Q", "-3.03]", "Qf5??", "3.18]", "Rexc6", "Rad4", "Rba2", "Nec7", "Red8+", "-2.9]", "-2.13]", "Ndxf2", "Rce5", "R8h7", "R8a4", "Rdxf1", "Ra6?!", "dxc8=Q", "c5??", "2.56]", "R4f5", "Rcxd5", "Naxc3", "Nde7+", "Bxb8?!", "N5g4", "Nfxg3", "R3a2", "Nfxe7", "N7e5", "R1a2", "Rfxe3", "-2.26]", "Reg7", "Nxe5??", "hxg1=Q+", "R6e2", "Nexf3", "3.51]", "Qg3?!", "-2.27]", "-2.66]", "f6??", "3.55]", "Rba3", "Rfd4", "R8a3", "Qe5+?!", "R3c7", "exd5?", "Bf3?!", "Raf3", "-2.8]", "Bxg8+", "-1.91]", "2.49]", "Nba3", "-2.99]", "Qd2?", "R2f6", "N3a4", "Rfxf1", "Kd7+", "Ncd8", "Rexe6", "Ngf6+", "Ng8?", "Rge2", "Ncxe5+", "2.7]", "Qxe1#", "-9.24]", "R5a2", "Qf3#", "Reb4", "Rba6", "2.75]", "2.97]", "3.46]", "3.31]", "-4.34]", "Ndf7+", "Rhd7", "Rcxd3", "Qd7?", "Rad3", "Naxb5", "Rca6", "Bg8+", "Nef6+", "2.98]", "-2.34]", "Rge4", "R4h3", "Rdxf7", "Rdc4", "Qd3?", "Rfxd3", "2.62]", "3.82]", "3.81]", "Qe7+?!", "Rexc8", "Ncxd2", "3.01]", "Nbxc2", "2.23]", "Rac5", "-3.06]", "R2g7", "3.58]", "R1xe3", "R3e4", "Ndc2", "-6.89]", "R8h4", "R1e7+", "Rhc8+", "-2.4]", "Nh6??", "Rhe7", "bxa1=Q", "-3.44]", "5.36]", "Nbc7", "Rhxe8", "R1a6", "N4b5", "R8b3", "4.18]", "Qxd1#", "Rdxc2", "2.33]", "Rbc4", "Nc5?!", "Rxa5+", "Rexd7", "-3.53]", "-3.42]", "-3.58]", "Nfxd6", "3.77]", "Rdb7", "Na6?", "R4g2", "g8=Q+", "Rhxg1", "-3.84]", "-3.68]", "R1d7", "2.82]", "R6b7", "4.15]", "Nhf4+", "Rad6", "R4g3", "-4.17]", "4.17]", "R5g3", "Bxc8+", "Rga1", "Rae5", "3.93]", "Nxf7??", "Rhe5", "Rhf5", "R8c2", "R5c4", "-3.82]", "3.91]", "Rdh5", "Nce2?!", "-2.59]", "Rce8+", "R6c2", "2.66]", "Rcxd2", "dxc6?!", "-3.96]", "Rdb4", "N8g6", "R4h7", "2.72]", "4.27]", "Rfh7", "Rhe6", "R2d5", "Rde2+", "Rc1#", "R4c2", "N5c4", "fxe8=Q", "Nfe3+", "Rcd8+", "Rcxf7", "Rdb6", "Kf1?", "Qd6??", "-2.43]", "Rgxg7", "Raxb6", "Rdxd5", "Raxa5", "-2.32]", "-2.54]", "Rgxf1", "bxa3+", "3.6]", "5.21]", "Nhg4+", "Rxa4+", "R8g3", "-1.71]", "Nb3?!", "-3.45]", "Nac8", "Nhxf6+", "-3.36]", "Na1+", "Nbxd3", "Rfb8+", "Rfxb1", "Rce4", "Ndf6+", "Qf4??", "R2xd3", "-2.61]", "-2.65]", "Ncd1", "R1xf2", "Rbb3", "Rgxd5", "cxb5?", "Rcxc2+", "Nhg6+", "R1xe6", "N7f5", "-3.56]", "-3.51]", "3.04]", "Rbf4", "2.67]", "R6xe5", "Rexe2+", "Nbd7?", "Nc4?", "Rexe6+", "bxa4+", "3.43]", "Nxc3?!", "cxd6?!", "3.52]", "fxe6?!", "R3f6", "R4g6", "-3.09]", "-3.7]", "2.89]", "Rgh7", "Nhxg2", "Nab1", "g5??", "-2.52]", "5.42]", "Nbc1", "3.95]", "Rfxe6", "Nef8", "2.07]", "R3e7", "4.26]", "Rexe3", "Rhf7", "R6a2", "Rec8+", "Rgg3", "R8h7+", "-6.82]", "Rce1+", "R2b3", "-2.63]", "2.9]", "3.11]", "Nbd3+", "-3.1]", "3.59]", "R1g6", "-2.07]", "-2.98]", "Rae6", "6.75]", "bxc1=Q+", "Nexc5", "3.98]", "Rfb3", "Bf4??", "cxb8=Q", "Bf1?!", "N7e6", "a6??", "N2d3", "-2.57]", "Rhd6", "Rbxf2", "Rxd1#", "R8e2+", "4.13]", "Qc3??", "-2.64]", "Naxc6", "-3.59]", "Ncb7", "R8xe3", "-1.92]", "e3??", "-3.97]", "-3.07]", "Rdxd8", "b2+", "Be5?!", "Kf7?!", "-3.02]", "R7xd6", "7.65]", "7.58]", "3.54]", "Rbxc2", "R6h7", "N1c2", "Bg2??", "7.27]", "-4.18]", "5.6]", "Rcb6", "Nfxg6", "Rcxe4", "g8=Q", "3.09]", "3.63]", "Bxh3?!", "Nec1", "R3f7", "-4.01]", "Rcb5", "N4c5", "Bxe5?!", "R8f2+", "R3f2+", "-4.3]", "R6g7", "bxc6?!", "4.55]", "4.57]", "Qb5??", "6.56]", "Nc5?", "R2c7", "Nxd8?!", "Na4?", "R5g2", "3.28]", "Qf4?!", "Qh4??", "R5xe3", "gxf3?!", "Nb8?", "Rfc6", "Rcxd7", "Bh6?!", "Nxc3?", "3.9]", "3.89]", "3.0]", "4.12]", "Rca2", "Nfxe3", "3.53]", "4.5]", "cxd5?", "R8xf6", "-1.8]", "Nhg3", "Rdh7", "Rhe4", "R6b2", "Rda2", "-3.52]", "dxe8=Q", "-3.47]", "R1xf4", "R6e5", "Rda3", "f4??", "R3h2", "3.14]", "cxb5?!", "Rgd2", "Rf2#", "Rcxf4", "R1f6", "Nce7?", "Ndxc2", "-3.94]", "-4.6]", "Rdb3", "Rbd8+", "Qe6?", "Nexg3", "Rhg7+", "-2.38]", "Kf2?!", "cxd6?", "Rdxb7", "Rfxe2", "Na4?!", "N1xd2", "N4xe5", "Reb2", "R8b5", "3.62]", "Rcxe8", "R5g6", "R7c2", "R2e6", "3.12]", "-2.51]", "Nce7+", "-4.2]", "-4.15]", "Nac1", "Bxc1+", "Qg4?", "Ncd3+", "Ndxb6", "N6c5", "2.84]", "Rdxd2+", "Nef1", "Rhxc1", "Nca5", "Rgxd8", "Ba6??", "R4e5", "Nfh7", "3.08]", "3.49]", "Rcxb4", "Nf4?!", "g4??", "Neg7", "2.55]", "2.74]", "Qc5?!", "Qa5?", "R8a2+", "Nef2", "Rea5", "Rca4", "-3.63]", "-3.72]", "Rfc4", "Qe7??", "4.34]", "Kf3+", "Rbxc6", "Rfg4", "Nb8?!", "R7b3", "R6c4", "c8=Q+", "Bc3?!", "4.29]", "R8xd5", "-3.29]", "-3.54]", "-3.61]", "Nxe4??", "4.86]", "Nexc8", "h6??", "Rhc1+", "Rfxd4", "R6f2", "-4.51]", "Bxd5??", "Nbc2", "Nec2", "Rexf5", "R1f2+", "Rgg6", "Ndc7+", "Reh4", "Rdxe8", "-2.28]", "N6xc5", "Rcxc6", "Bxb4??", "4.89]", "Ned5+", "-4.1]", "-4.22]", "7.21]", "N6f5", "Ndf5+", "2.8]", "4.79]", "4.73]", "Nhxf3+", "-3.81]", "8.35]", "R8a6", "1.99]", "-3.93]", "bxa1=Q+", "Rbxd2", "R8xd6", "R5b7", "Qe4?!", "2.35]", "dxe1=Q", "Rgd3", "R1h7", "Ngf5+", "Bh6?", "R2d3+", "Rgxg2+", "Bd5?", "Qg4#", "Ne7??", "4.51]", "7.62]", "-2.69]", "N2c4", "gxf3?", "Nh3??", "Qh5#", "R1xe2", "Rbg7+", "N8c7", "R8f3", "4.56]", "Rbxa2", "R8xe4", "Rxh2#", "Ncxa5", "-3.32]", "R6d5", "cxd5??", "-9.19]", "-8.82]", "Rcd1+", "Nge7?", "N2g4", "Ng6?", "Nfd4+", "3.3]", "3.34]", "Qc2?", "N5h3", "N2e3", "Nhxf1", "Raxc4", "R5xe4", "Nba5", "Bh5?!", "Nd6??", "Nac3+", "-2.09]", "Ncd6+", "R3d7", "R1xc2", "4.67]", "Rdf1+", "Nbd8", "3.38]", "-4.32]", "Qa5+?", "R1xf3", "Rbxb7+", "Nfd3+", "Qd1?", "Nexf3+", "Rhd3", "fxe1=Q", "Bg6?", "Bg7??", "N4xd5", "Rbb4", "Qxd4??", "-4.0]", "Rgg5", "R7e6+", "Ncd4+", "R2d7", "2.38]", "N3xe4", "Rcxc1", "Kf7?", "R4b2", "Rdf2+", "Raxb2", "4.35]", "Nfg5+", "Rgxg3", "Nfg2", "R1xe4", "3.19]", "Qg4??", "Bg3?", "Rcxd6", "R2e3", "Ng3?", "Rea3", "3.4]", "4.43]", "Kf8+", "Ngxf5", "4.03]", "4.4]", "Qg6?!", "Nac6+", "Rdg7", "Bxh8+", "N7d5", "Raxa4", "Reh2", "Rbf6", "N3f4", "Rhxg2", "Raxf2", "Rhg2+", "-2.76]", "R5xd4", "R1c6+", "dxe5??", "Rfxf6", "Ke2+", "N3c4", "-4.11]", "R3e5", "-3.89]", "7.94]", "3.35]", "-4.5]", "Qxd6?!", "Rae3", "2.57]", "Nbxc7+", "R5g7", "g1=Q+", "Nbd6+", "-2.39]", "R7e2", "Raxd6", "Rdxd4+", "R2e5", "R3d5", "R5h4", "Rgc3", "Rge7", "-2.78]", "N6b5", "R8xc7", "3.68]", "Rcf6", "R6b5", "Nd3?", "R1xd3", "-3.28]", "R5b2", "Rcxa7", "4.11]", "R4c6", "R5c6", "Bxc4?", "-2.94]", "Kf7+", "dxe6?", "R2b4", "Nh5?!", "-4.05]", "N8xd7", "Raxf7", "R6xd5", "N6h7", "exd3?!", "Rcb4", "R7xc6", "-4.25]", "Ng1?", "fxe4?", "Rcxc5", "Rgd4", "a3??", "Bxf6?", "Ngf6?!", "R3c6", "R7f4", "-3.65]", "Nfd8", "-3.67]", "Rcxc8", "Rgf2+", "Kd2+", "-2.73]", "R3xc5", "Nexd3", "Qa1#", "R8g3+", "-4.44]", "Nfe4+", "3.97]", "R5b6", "R7a6", "2.19]", "R8b4", "3.61]", "Nbxc7", "N7xc6", "N2xc3", "Rgxg2", "Bxg1+", "2.96]", "Rh2#", "Nge6+", "cxd4??", "Qxf3?", "2.78]", "R8g4", "2.99]", "R7d3", "#6]", "3.74]", "Rec4", "Qxf6?!", "7.53]", "7.57]", "7.46]", "Rexa6", "Rcxc4", "Nb6?", "R6e5+", "R8c7+", "R1a5", "axb1=Q", "Rcg5", "R2e3+", "7.15]", "-4.26]", "Raxe6", "5.69]", "5.66]", "Nfxe2", "bxa4?", "Qd2#", "Qf4#", "R7xf6", "4.21]", "gxf3??", "N7c5", "-4.4]", "Raxg8", "Qc1#", "-3.27]", "-4.23]", "Qh6#", "R8h6", "7.05]", "Qe3??", "-9.94]", "2.83]", "4.36]", "Rfa7", "3.32]", "Rcxf2", "R8b2", "Rae4", "Rbxb2+", "R2f4", "N7d5+", "Nfd5+", "N4e5+", "6.44]", "5.56]", "Nde4+", "g1=Q", "R5xh4", "R1a3", "Kf1??", "N4g5", "Qd1#", "Rbxb3+", "5.04]", "Ncd5+", "Ndf4+", "Rbxa6", "N4e3", "R8d4+", "Raxb4", "Rg2#", "R6xd7", "Qxh2#", "Qxb1#", "Qb3#", "4.54]", "Ba4??", "4.37]", "-6.56]", "-2.55]", "Qh4#", "3.85]", "-3.38]", "Ke7+", "Rhxh3", "Rdxf4", "Ba3?", "R1xc5", "-5.53]", "6.79]", "6.81]", "Bxf4??", "Ndxe6", "Rexb5", "-6.09]", "-3.87]", "Ke7?", "8.07]", "R6f5+", "Ndxf6+", "Ra3?", "Ne6?!", "Rhxe1", "Rdxc6", "Kd1??", "Nhg7", "Be6??", "5.24]", "Rcxc6+", "Na3??", "R8b2+", "Rfxe5", "Rfxe7+", "Red7+", "Qb4+?", "-7.98]", "R6g3", "Rdxe3", "Rg8?!", "Qxb7?", "3.25]", "4.46]", "Bxb1+", "gxf6?!", "-2.35]", "2.44]", "3.47]", "Rgb7", "-3.57]", "Rfxd7", "Nf7?", "R6xe4", "Rdxa2", "Bxd4?!", "Ndc2+", "Rgb3", "R3b5", "Rag2", "Nexd8", "R2c5", "Rgxg6", "Bxa3?!", "Qd8?!", "Rgf1+", "Ndb3", "Reb1+", "Bxf7+??", "Qf3+?!", "-4.95]", "Qc4??", "5.06]", "N6xd5", "R2g4", "Ke3+", "3.16]", "Ke1?", "R2f7", "Qxg1#", "N7xd5", "Bxg4?!", "Rfxd6", "Rbg4", "6.42]", "3.33]", "Reh5", "Nbxd3+", "N3e4+", "Rfxf8", "Re8#", "N6f5+", "3.26]", "Kd3+", "Rdxa7", "R2f5", "Nh4??", "-6.2]", "Qf3+?", "-8.11]", "Nef7", "R2xd6", "Ndb5+", "R1h6", "1.92]", "4.38]", "5.84]", "Rcf4", "Qc6??", "3.76]", "Rg1?!", "Ndxf1", "Rdxc1", "4.68]", "Nc3#", "5.3]", "4.61]", "Rhf7+", "Qf5?", "Rfb5", "5.92]", "R6h3", "R5a6", "Rbe1+", "-3.86]", "N3c5", "Ba2?", "4.47]", "6.57]", "Rdxc5", "Rfxb2", "Bc2?!", "N6e4", "Rexe8+", "Qxc5??", "-10.06]", "R5h6", "-5.2]", "5.16]", "Ncxb2", "-3.43]", "-4.81]", "6.95]", "7.3]", "Rcg3", "-6.13]", "Raxe7", "Rab5", "-2.42]", "Qxg7?", "R8xc3", "Nfxd4+", "R8e4+", "R1b7", "Rbg2#", "N6xf4", "4.19]", "Nxc6??", "Nce3+", "Nexd6", "R7c3", "Rcf7+", "Rad5", "Rdf5", "N4xg5", "Rexe8", "Qxd6??", "Rdc8+", "R1xg5", "4.06]", "Nb1?", "7.55]", "7.63]", "Qc3?", "Rbxb8", "N3g4", "N5e3", "Ned1", "Neg5?!", "h3??", "3.69]", "Kb1+", "3.78]", "Rab4", "Ndxf8", "R5xe6", "R2b7", "10.63]", "N7b5", "Nfxd3+", "Nh1+", "fxe4??", "4.1]", "Nge8", "Nba4", "Rgxf8", "Raf2+", "Qd8?", "Rhh5", "Qg5#", "Rfxg7", "Nxf7?!", "2.47]", "R4b3", "Rgxf6", "-4.41]", "Qe6?!", "-6.72]", "-2.62]", "Nh5?", "Nce5+", "R4xe5", "5.43]", "Nbxa4", "N3f5", "R5g4", "Ndxe7+", "Nxc7+?", "Raa5", "Kf6+", "7.25]", "exf1=Q", "N1f2", "Rea6", "-2.82]", "Rfa4", "Rexb7", "3.8]", "7.96]", "Rfxc5", "2.42]", "Qf4?", "Nge2?", "Ncxa4", "9.74]", "Rch3", "bxc4?!", "Rhxd8", "Nec5+", "Rg1#", "Bxe7??", "Nge3+", "R1xc6", "-7.91]", "R7c6+", "Ba2?!", "N8b6", "Rdxd5+", "Rgxf5", "8.51]", "R6c5", "R4a3", "R1g2+", "-3.04]", "-4.53]", "Nf2?", "Rcxf6", "-4.47]", "Ke7??", "R2xc4", "10.41]", "R5a4", "Rag7", "Be5??", "R7h4", "Ned3+", "Rea7", "R6b3", "Bxc5??", "Rhxb1", "Rhd4", "4.93]", "Rbg3", "Rhc5", "Ncxb6", "Ngxh7", "Nbd7??", "Rgf7+", "Rbf7+", "N4xb3", "4.01]", "4.14]", "Ndc4+", "5.98]", "7.31]", "3.23]", "Rdxf8", "N3xe5", "R7d6+", "Qxd2+??", "10.56]", "9.18]", "Nbc7+", "Nbc3?!", "Bxc3+?", "Bg6?!", "exf8=Q", "c1=N+", "N4xh5", "Nfxh5", "5.57]", "R7g6", "R5h2", "Rgxf2", "Rgh5", "R1xd6", "b6#", "Nxb5?", "-2.17]", "Bxe7?", "Qxf6?", "R2c4", "7.84]", "Kg8+", "Nbxd6+", "7.5]", "Nb1+", "R8h3", "R2a3", "2.14]", "Rca5", "Nfh6", "Rbxe2", "-4.27]", "-3.33]", "Rbxd3", "2.4]", "R3c5", "Rgxe3", "a5?", "7.85]", "O-O-O?!", "Kg3??", "Rh7?!", "Rexf3", "axb1=Q+", "R2h6", "Nfxe4+", "Raxf1", "Qxf7+??", "Raxe5", "Ncb5+", "Ncxe8", "N2xd4", "R8xc5", "Nfe6+", "R1g4", "Nbc3?", "Qb5+?!", "N8a6", "Nfxg7", "Raxb3", "Nxe6??", "R6xd4", "6.61]", "7.18]", "7.43]", "7.36]", "Qxc7?", "Qxe4+?!", "Bd4?!", "Nfd7?", "b5??", "-5.73]", "Nexg5+", "R5b4", "R8xe7", "Ndxf4", "Rfe2+", "Qe4+?", "Rbxc3", "N3xf4", "Rhxf5", "Rh3?!", "Rhxh6", "Rbxa4", "7.35]", "-3.75]", "3.64]", "Rda7", "-3.9]", "3.83]", "Qxd6?", "Ncxe4+", "R8xh5", "exf5??", "Raa4", "-4.62]", "-3.4]", "R2h3", "Rfxf3", "Nh8+", "Rexb3", "R4xf5", "Bxc6+??", "Qxd5??", "-7.03]", "Rhxf4", "7.34]", "R1b7+", "Reb6", "Rfxc2+", "Rexe5+", "Rexc4", "Qg3#", "Nfxh5+", "3.7]", "R8f2", "Rfxc6", "4.83]", "6.65]", "6.69]", "-10.18]", "-6.02]", "N2a4", "Rfc7+", "Rdxe2+", "Nd7??", "Rexc5", "Qxc2#", "4.25]", "4.2]", "Raxc7", "Kf2+", "a5??", "Bxb5?!", "-3.35]", "bxa8=Q+", "Nfg4+", "Nbd2??", "N3xc4", "Ke6?", "Qxc5?!", "Rexf2", "Rbe3", "Rb8?!", "R6c3", "Nhg5+", "3.79]", "Nfh2", "-5.64]", "Rfxe1+", "Qd7??", "Ke1+", "-3.78]", "R2xb3", "Ba3??", "5.82]", "5.79]", "Kg7+", "Nxa4+", "Rcg2+", "cxd1=Q", "Bc5+?", "R8xe6", "Qxb7?!", "R4h2", "4.3]", "Qg3?", "Qxc7?!", "R1h2+", "R1xd2", "R6a7", "8.12]", "Nf5?!", "-4.48]", "exd5??", "Rbxb4", "Rfxb8", "N8xe7", "Nde8", "7.69]", "7.51]", "Ndxb2", "R8g6", "Rcg7+", "R2xg3", "R3g5", "Reh3", "3.66]", "gxf8=Q", "2.92]", "Nfxh4", "Kc1+", "Bf6?", "Bf3??", "N2d4", "Rgxe6", "Qh3?", "N6g5", "Bb2??", "Qh5??", "-10.68]", "Nhg1", "Rbxe4", "Ned6+", "-4.57]", "R3c4", "Reg2+", "Nfxd6+", "Rdc1+", "Rcxc7+", "Rfe7+", "Rh6#", "Rfb4", "Kf4+", "9.05]", "N3h4+", "R4b5", "Rexf7", "Rgc2", "N4xf3", "Rch4", "R3g4", "R6b4", "Rgh4", "-4.93]", "Rhxd2", "Nef5+", "Nde3+", "Kf8?!", "-3.05]", "R3b4", "Ngf7+", "6.84]", "8.18]", "Rbxb3", "R3g6", "Rfxf7+", "-4.77]", "5.5]", "5.18]", "N5e6", "fxe2+", "-4.08]", "Qc7?", "-8.36]", "-8.39]", "7.7]", "-6.41]", "-6.21]", "Qxf3??", "Rbxd4", "-9.05]", "R1h4", "Nxb4?", "Rbxe8", "10.98]", "4.84]", "#-11]", "Ba5?", "exf3?", "Ngxe6+", "Kf2?", "R5h7", "R8d7+", "Nab2", "Rgg4", "fxg1=Q", "12.53]", "-3.37]", "N4f5+", "7.11]", "-4.37]", "Nef2+", "Kxf3+", "7.42]", "N3d5+", "Rcxe7", "3.42]", "Bh3?", "Rhxe6", "Nd6?!", "N4xb5", "Rca3", "Nfe7+", "Nfxh7", "Rexf2+", "#5]", "R2d6", "3.96]", "Rbc8+", "-7.08]", "2.95]", "R8e2", "R8g5", "N3xd5", "Rfa3", "Rdb5", "-3.8]", "Rcg2", "Rgxe4", "Rhh4", "-8.64]", "R8xa7", "7.59]", "Nexd6+", "R8xg4", "Rbxe6", "Rhxc8", "Nbxa6", "-5.42]", "6.87]", "6.91]", "7.44]", "Qxh7??", "Rgd7+", "Rcxb5", "R1xg4", "Rcg3+", "Nxf3+?", "N4d5+", "N2b3+", "R2a3+", "N5c3?!", "R8c3+", "R5xc4", "N5xb3", "R1xf6", "Ncxd3", "R7b3+", "Rgxe2+", "Qc1??", "Bd7??", "4.48]", "4.45]", "4.58]", "4.69]", "Nec7+", "11.17]", "-2.92]", "Qcc2", "Nh7?!", "R2xf5", "Bxa2?!", "R5b3", "Rfxg2", "10.69]", "Qh6??", "N6g5+", "N5xf4", "-2.47]", "Kd1?!", "Rdxf3", "Kh1?!", "Qxc1#", "Ra6?", "Rg8?", "4.94]", "Rfxf8+", "Rfxd7+", "Nexg6+", "Rcxa6", "Rcg4", "Qc8?!", "N1h3", "Rfxc4", "4.08]", "Rbxc4", "Qh6?!", "Nbc5+", "Qxe2#", "N5xf6", "Ned7+", "N1xc3", "Rhxc2", "Nh2?!", "-6.6]", "-6.67]", "-6.17]", "N3xg4", "R2xc3", "R7d2+", "Nhxf2", "Raxh8", "R8a2", "Nbc3+", "Ngxh6+", "Ke8?", "Qxf2?!", "Qa7#", "Re1?", "6.02]", "N1a2", "dxc1=N", "Nc5??", "Rcxb7", "Qcxc4", "Qcxc3", "Qed2", "Qgb5+", "R4xh3", "axb8=Q", "6.72]", "6.77]", "Nexc2", "N1d3", "Nca1", "Ke8??", "-4.06]", "-4.07]", "-3.88]", "Qa1?!", "R5xg3", "Rfc5", "Ke1??", "Kh8+", "R3a7", "gxf6?", "Nc4??", "Ndb2", "Qc4?!", "Rxh5?", "N5a4", "Rfxa2", "3.07]", "Ndc1", "R7b5", "fxe1=N+", "Kh6+", "-4.16]", "-5.16]", "Nc7?", "Ncxe6+", "Rfxe6+", "Bxd7+?!", "Rfg6+", "Nexc2+", "R7b2", "Naxc2", "Nf4#", "Rexb1", "Rexe1", "Rh4?", "R1xf5", "-8.33]", "Nd2??", "Rcxb6", "Qf5+?!", "6.37]", "6.31]", "Rexb4", "Ng3#", "Nxc2+??", "5.28]", "Kd8??", "11.63]", "11.58]", "11.75]", "11.8]", "12.36]", "12.24]", "Qxg4?", "Nhxg4+", "Rff8+", "Ke1?!", "Qxb3?!", "Ke4+", "N5xc6", "4.24]", "R1b2+", "Ndxb8", "Rfxh3+", "N1g3", "Rfxc7", "R2f7+", "-3.26]", "-3.95]", "Nexc7", "Rxb4#", "Ncxe2?!", "R1d3+", "Rfxf6+", "Qxb7??", "Rdxf6", "Naxc6+", "-6.31]", "R7xh6", "5.63]", "R2g3", "6.41]", "6.34]", "Nba7", "Rh2?!", "Rgxe8", "R1b4", "R1xe5", "Ree2+", "R3xe4", "Rbf8+", "Rdxg7", "Nxf2?!", "8.43]", "8.4]", "Raf7+", "Reg7+", "Qg6??", "6.33]", "6.1]", "5.81]", "#2]", "Raxc2", "Ke3??", "Qg5+?", "Kd3?", "Nb4+?", "Kc3?!", "Ne2??", "Ndxc1", "Ng4??", "6.6]", "R6a3", "-2.79]", "-9.91]", "-12.57]", "-10.45]", "-10.58]", "-11.2]", "-5.61]", "Rhxe2", "dxe3?!", "e8=N+", "6.46]", "Bxh8??", "#-3]", "Rbxg4", "-3.85]", "6.86]", "6.82]", "7.02]", "9.15]", "7.37]", "Bf7+?!", "Rcxd4+", "Naxc8", "Rcxe6", "R1a4", "Nbxc2+", "Rdxd1", "-5.1]", "-4.99]", "R4b7", "5.03]", "4.77]", "Bc8?!", "N4xc3", "R3g7", "R2xh3", "8.55]", "8.49]", "Rc1?!", "Rch5", "R1h5+", "R4xd2", "Rcxe3", "Bxf2+?!", "Nxd6+?", "Qde3+", "Reg8+", "Qf6??", "4.62]", "12.34]", "Raxa8", "Kg6+", "R8xf5", "7.54]", "7.56]", "Rgxd7", "Rfxf5+", "Ke8+", "Bd4?", "R3h7", "Rcxg3", "7.0]", "Bxe4??", "exf3??", "4.63]", "4.95]", "Rexb6", "Rexg7+", "5.29]", "Nc2?!", "Rhxg4", "8.06]", "8.02]", "8.0]", "7.72]", "R2xf7", "Rgxg5", "Rdxb3", "Rbf5", "R7xc5", "-7.77]", "-7.71]", "-7.58]", "Nbxa3", "10.67]", "10.61]", "10.45]", "10.23]", "10.16]", "Rcxa3", "R7a4", "R4a2", "R8e6+", "-9.21]", "-9.17]", "-8.77]", "4.44]", "exf4??", "Qaa5+", "Rbxe5", "Ne1?!", "N2g4+", "Qa2#", "R1e3+", "R4xf3", "Ndxc3", "R1xf7", "R7xd2", "3.71]", "-13.15]", "Bxc6??", "-8.54]", "Rag6+", "Qxe6?!", "-6.77]", "-6.74]", "Rbh7", "Rda5", "Kxd1?!", "Q1xh2", "Q4xg3", "Qhxf3", "Qfxe2+", "Qgxe4+", "Nxf4?", "Bc5+?!", "Bf2+??", "4.72]", "5.41]", "Rhxd2+", "Nfxg5+", "-1.93]", "5.53]", "Ndxc7", "hxg3?!", "Rbxf1", "Nb1?!", "-3.73]", "Bxg8??", "-5.12]", "Rcd3+", "Red3+", "Rdxd7+", "Nbxa7", "Kc8+", "Qxe4?!", "Rxg2#", "Nf2#", "Na5??", "Bxa5?", "7.16]", "Bxh8?", "6.52]", "Nf5?", "9.23]", "9.03]", "9.65]", "9.7]", "Rxh5?!", "Nfxh2", "Rbxf7", "R7xe3+", "R3xd2", "Rxg4#", "R1a2+", "Rxh4#", "9.79]", "9.78]", "9.68]", "12.32]", "12.11]", "R2e7", "-5.55]", "-5.54]", "cxb3?!", "Ngxe5+", "dxe3??", "6.94]", "Qxd8+??", "Rgxh3", "Rc1?", "N1e3", "R3xd4", "Rbe2+", "Rhxf6+", "Ne3?!", "Qd4?", "Rxf3?!", "b5#", "Rbxa7", "R8xe7+", "Raxd8+", "R7xd4", "Rda4", "Rf6?!", "Rh6?!", "Rgxe7", "Nfxg4+", "R6c5+", "Bc4+?", "Bxf5?!", "Rh5#", "Ndc3+", "Rexc2", "Rag7+", "-2.6]", "Nd4#", "Qc7#", "-7.84]", "-8.81]", "-10.23]", "-8.97]", "-8.88]", "Qcd8", "8.33]", "8.5]", "7.78]", "11.18]", "dxc5??", "R4xb6", "fxe8=R+", "R2h5", "-4.68]", "R8g2", "R3e4+", "Rag2+", "cxd3?", "-5.14]", "-8.1]", "-8.98]", "R5xe2", "Q8xh7", "Q5f7", "Qhxe7", "R2h7", "18.92]", "18.61]", "Nc4?!", "R8f3+", "10.28]", "N2xe4+", "axb8=Q+", "Nexg3+", "Kxf2??", "Ndf3?!", "Bf7+?", "Ngf2+", "Ke8?!", "R3e2+", "Ncxd3+", "R7h6+", "Rexh3", "N7xf5", "Q6h3", "Q3g2", "Qhxg1", "Qgxe3", "Qexd2+", "Rcxb3", "-12.48]", "N7e5+", "Rbc1+", "Bxf5#", "R7xb3", "6.11]", "6.17]", "5.97]", "5.9]", "-6.03]", "-6.18]", "-6.25]", "R1xb5", "Qa4??", "gxh5?!", "Qb4?!", "Ra4#", "6.36]", "6.48]", "7.22]", "Rag3", "Rfxf1+", "Qxc5?", "Rd2#", "Ref1+", "Rge1+", "Nbc6?!", "Kxd2?!", "9.4]", "9.73]", "8.96]", "8.75]", "Nc2?", "N6b4", "R4xd6", "Bxg4?", "Rb8?", "N4xh3+", "Rbxe6+", "Bxh5?", "Nxg4?", "Nfe2+", "Nxb5?!", "5.52]", "Raxg3+", "Rcxf5", "Qxb3#", "4.91]", "Nfh2+", "Raxc3+", "R5xf6", "5.78]", "Ngxh3", "Qe5?", "Nec3?", "Bxb8??", "#-2]", "Qxd2#", "bxa3??", "Rdxe7+", "N6xg4", "N7xh5", "Ndb5?!", "Nhxf8", "Rah5", "7.64]", "7.74]", "R7f5", "R6xb2", "Bxc3+??", "Bb6??", "-4.8]", "Rcxc3+", "Bxe4?!", "R4xf2", "Rbd2+", "Rac2+", "Nhxg3", "R6xc4", "Ncxd6+", "N5xe4", "Bh7?", "-6.43]", "-7.4]", "Bxb1?", "Rxb1?", "Rfxh4", "Kg1?", "hxg8=Q", "Rhb7", "-4.21]", "N4g3+", "N5a6", "Rfxa2+", "Rbf3", "gxf1=Q", "Rhxa4", "R6xg4", "c7?", "-4.14]", "Nde2?", "4.82]", "Ngxh2", "R7xd6+", "Rhxh2+", "Rhc2", "Qe3+?", "7.86]", "Qf6+?!", "Kh3??", "-4.46]", "Kxf5+", "N6f4", "R1d4+", "Nh6#", "Nbc4+", "Rd5#", "Rch2", "Be7#", "2.88]", "-9.3]", "-9.36]", "-9.23]", "N2xe3", "Ned8", "Nexg4+", "4.09]", "Rec1+", "Bg4+?", "Nfxe1", "R6h4", "Rc3#", "Qxg7??", "-7.01]", "-4.84]", "Rfxb3", "Reb5", "R6xc5", "R2xa3", "Rbe3+", "-4.64]", "Qd4#", "R7xa6", "Nde6+", "Rh2?", "-4.82]", "-4.58]", "Rhxf3", "d4#", "-4.61]", "Ncd7?!", "Bxh7??", "Rxh7??", "-6.08]", "Kxd5+", "Bxf6#", "N3d4+", "Qa5??", "6.78]", "Rbxg2", "Rf8?", "Bb5+??", "9.6]", "9.53]", "N8a7", "6.8]", "Qh3#", "Rexa5", "Rah4", "N3xb4", "-5.82]", "Qe2+?", "Ng5+?!", "Ref8+", "exd4?", "R7d4+", "Bxb8+", "Rxa3#", "R7xc3", "Rhf2+", "Qeh6+", "b4??", "Nbxc8", "5.76]", "Rfb7+", "Rbxd7", "Qee8", "Qcxd7", "-10.44]", "Rd5?", "Raxc6", "Rcg2#", "R4h6+", "Rxb3??", "Qa4?", "Rexc7", "Qbc8", "Kd1+", "R5d6+", "R7xa5", "Rxa2#", "Rh6?", "Rga7", "Qf7#", "5.51]", "5.55]", "Bc6?!", "Qb2#", "Rea4", "fxe8=N+", "Rfxf1#", "-2.49]", "-5.43]", "Rdf7+", "R3xe2", "R7f3", "Bxc3#", "-4.74]", "-14.33]", "-14.32]", "-18.61]", "Bb7?", "8.57]", "Rgxe7+", "Rbxe7", "Bxc2?!", "R1f5", "7.79]", "Rxc4#", "N6c4", "4.32]", "R8b7+", "bxc6?", "Rc8?!", "N5xh3", "Bh4+?!", "dxc1=Q+", "-7.68]", "Qdb6", "Kf5+", "N7a5", "Ndxb4+", "exf6??", "dxc3?", "R2c6", "N3xd2", "N6a7", "Rba5", "Nde8+", "Nhxg6", "R8h2", "Nd3#", "Rexd5+", "R4xd3", "Rbg7", "dxe3?", "-5.25]", "Rcg7", "12.43]", "12.2]", "12.16]", "11.9]", "Qh3?!", "N4xa5", "R6xg7", "Qf6+?", "3.44]", "Ng4+??", "6.39]", "R1a7", "Bxc4#", "R1c7", "Rcxh3", "R2xe3", "Qxe5+?!", "Rhxd6", "-8.12]", "-8.66]", "Rah2", "exd3?", "Qxd3?", "Rfxd8+", "Rhxb3", "Ne6?", "Rgxf3", "Ngxf6+", "Ndxf2+", "Rfb2+", "Qxe6+?!", "Rxg1?!", "exf4?", "Nb5??", "R8xh7", "Qb3+?", "Bxb5+?", "Ndxe1", "Raxe1+", "bxa6?", "Qxa7??", "Rcxb8", "4.7]", "5.11]", "5.58]", "Rab6+", "Qxb7#", "Qb5#", "fxg6?", "-3.69]", "fxg6??", "Nfxd5+", "Rexh2+", "8.63]", "11.79]", "11.2]", "Qhf8", "Bf6?!", "Na7?!", "R3e6", "Rec7+", "Ncxb8", "N2b4", "Kxe2+", "Bg6??", "R1c2+", "Qxf6??", "-7.07]", "-7.6]", "Nhxg5+", "Rfa6", "R1a7+", "-6.22]", "-15.61]", "Rbxg7", "Nbc6+", "8.73]", "8.81]", "Bxg5?!", "Nxg5?!", "-6.19]", "-6.57]", "-5.66]", "-5.27]", "cxd1=B", "N8xc6", "Rexf5+", "Ndxb3", "Bxc3?", "-3.92]", "bxc5?!", "Rfg5+", "Rhxf6", "N6e4+", "4.6]", "4.71]", "R2f3+", "Rce4+", "Rfe4+", "Rff1+", "Qf2?!", "Nhf5+", "N1xg3", "Rgd8+", "R2xa4", "Rdxg2", "c6#", "Kh1?", "R3xb2", "Be4?", "N8d7?!", "R8xd4", "Rgc7", "Rbxf3", "Qxa5#", "R2a4", "R4a6", "Rcxh4", "Qd3??", "-4.7]", "Rbh2", "N5g4+", "6.74]", "6.71]", "6.67]", "6.62]", "Nf5??", "Kd2??", "-4.73]", "-4.52]", "-4.79]", "Rdg2+", "N5e4+", "R8g4+", "Nf4??", "-5.62]", "R1a6+", "R5xf2", "7.67]", "N1xh3", "Rexa4", "Rg1??", "Qc1?!", "Raxe2", "Ngh2+", "Bc5#", "N5xg6", "R1f5+", "Rcxg1", "Rdb1+", "R2xe7", "d8=N", "-4.67]", "Nec4+", "R4c5", "dxc6?", "-6.15]", "Rg5#", "Rbxh7+", "Rgxf4", "Nc7?!", "Rcxd2+", "R3h5", "Rhxd7", "Rbe5", "Rcxc4+", "-5.67]", "Bxd3#", "Rexf4", "N3xh4", "-11.44]", "R6xa3", "N3g5", "Rg8??", "5.45]", "N5g3", "-5.04]", "N3b5", "R6h2", "Nfxh6", "Nde1", "-10.67]", "-10.73]", "-10.79]", "-9.07]", "-9.31]", "-9.04]", "R3c7+", "R4xa6", "bxa6?!", "-4.65]", "N6xb5", "Rdxb6", "Rde3+", "Rhf3+", "-6.83]", "-8.08]", "N2xh3", "Qxd5?", "Qb1#", "Ndxf7+", "3.99]", "4.04]", "4.02]", "Re6?!", "Rhh6?", "Ndc5+", "-8.03]", "-7.8]", "Bf6#", "Qh3??", "Rdg7+", "N3xd4", "Rcxe2", "Nec3+", "2.94]", "Ncxd5+", "Ndf6?", "cxd1=N+", "Nfxe8", "-4.13]", "Bxd7+?", "7.87]", "8.88]", "8.91]", "9.12]", "9.08]", "9.0]", "Nfxe6+", "Rf1?", "Reh7", "Nfd1", "5.31]", "Rcb1+", "fxe3?!", "N6xf5", "N4h6", "Nge5+", "Ng3??", "Rg6?!", "N7xd5+", "Nef7+", "R3xd7", "Rxe4?!", "Ra2#", "Rae2+", "Rhf2#", "gxf4??", "Qxf4?", "-7.82]", "N1a3", "Ref2+", "R7b6", "Na4??", "Qf5?!", "11.95]", "11.85]", "R8h5", "Qeg6+", "R1f7", "-14.26]", "gxf4?!", "R2xc5", "R8c2+", "-10.34]", "R2a5", "Qe7+?", "R8xf7", "dxc1=N+", "Rxc1#", "Nf7?!", "R4xg5", "Nf7??", "c2#", "Nec6+", "Bxg7??", "6.04]", "6.83]", "8.03]", "12.79]", "12.7]", "12.68]", "11.1]", "Nfd6+", "Re2#", "Rdg5", "R5c3", "Qa4#", "Kh4+", "Ba5??", "-3.64]", "-4.92]", "Bxb4?!", "R7a2", "R3h4", "Ncxd4+", "R7c4", "R4b6+", "Rdxh2+", "N6xa5", "N4g6", "Ke2?!", "R8xd3", "R3d2+", "Rexd2+", "Bc2??", "Neg3+", "Qe6??", "10.55]", "10.31]", "10.18]", "Qe3#", "Nxc4?!", "R1xb4", "R1xg2", "-5.7]", "f6#", "Rfxc2", "-3.3]", "Rhxb7", "5.23]", "6.58]", "Kxf7?", "Nfxg2+", "Bb2?", "-8.72]", "-8.74]", "-11.25]", "Raxc5+", "Raxf3", "8.2]", "8.13]", "-5.0]", "Bf6??", "Bxc6+?", "Nbxd2?", "Bb7??", "5.22]", "N7xe5", "Ngxf3+", "Qxe4#", "R6xc3", "Ncxa6", "Rb1?", "Qxe5+??", "-9.09]", "-9.1]", "-9.11]", "-9.71]", "Rh7#", "Bxc4??", "Qa6??", "-15.46]", "Rhxg6+", "R6xa4", "Rcxe5", "c5#", "Rbxc2+", "-3.99]", "Rbxb1", "-6.96]", "Qxb4?", "-8.31]", "gxf5??", "Qxf5??", "Qh5+??", "-9.48]", "Rce6+", "-4.04]", "-4.09]", "Rgf8+", "Ncb2", "Qg6#", "6.35]", "R7e5+", "Rexg7", "10.65]", "10.64]", "10.6]", "10.91]", "Rgxb2+", "8.04]", "Rexc3", "R6xh5", "Bxf3#", "6.0]", "5.83]", "7.89]", "7.88]", "R6xe3", "Ba5+?!", "gxh8=Q+", "Qdxd4", "Qhf6+", "Rh3?", "-18.28]", "-18.12]",